Перем ЗапрещенныеСчета Экспорт;

Процедура ПередЗаписью(Отказ)

	Если Забалансовый = 0 Тогда
		Забалансовый = 1;
	КонецЕсли;

	Порядок = ПолучитьПорядокКода();
	
КонецПроцедуры

ЗапрещенныеСчета = Новый СписокЗначений();
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.СырьеИМатериалы);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.ТранспортноЗаготовительныеРасходы);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.ТоварыНаСкладах);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.ТоварыОтгруженные);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасчетыСПоставщиками);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасчетыПоАвансамВыданным);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасчетыСПокупателями);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасчетыПоАвансамПолученным);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасчетыСПерсоналомПоОплатеТруда);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасчетыСПодотчетнымиЛицами);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.РасходыБудущихПериодов);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.ТоварыПринятыеНаКомиссиюНаСкладе);
ЗапрещенныеСчета.Добавить(ПланыСчетов.НалоговыйУСН.ТоварыПринятыеНаКомиссиюПереданные);
