Перем мНеИзменятьСостояниеВЗаявке Экспорт;

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мНеИзменятьСостояниеВЗаявке = Неопределено Тогда
		мНеИзменятьСостояниеВЗаявке = Ложь;
	КонецЕсли;
	
	Если мНеИзменятьСостояниеВЗаявке Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаКандидата = Отбор.ЗаявкаКандидата.Значение;
	Если Не ЗначениеЗаполнено(ЗаявкаКандидата) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаКандидатаОбъект = ЗаявкаКандидата.ПолучитьОбъект();
	Если ЗаявкаКандидатаОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущаяРаботаПоЗаявкамКандидатов.Состояние
	|ИЗ
	|	РегистрСведений.ТекущаяРаботаПоЗаявкамКандидатов КАК ТекущаяРаботаПоЗаявкамКандидатов
	|ГДЕ
	|	ТекущаяРаботаПоЗаявкамКандидатов.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаявокКандидатов.ПустаяСсылка)
	|	И ТекущаяРаботаПоЗаявкамКандидатов.ЗаявкаКандидата = &ЗаявкаКандидата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекущаяРаботаПоЗаявкамКандидатов.Период УБЫВ";
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ЗаявкаКандидата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаКандидатаОбъект.Состояние = Выборка.Состояние;
	Иначе
		ЗаявкаКандидатаОбъект.Состояние = 0;
	КонецЕсли;
	
	ЗаявкаКандидатаОбъект.Записать();
	
КонецПроцедуры
