
Процедура Автозаполнение(ТаблицаЗапроса = Неопределено, Сотрудники = Неопределено, Показатели = Неопределено, ОдинВидРасчета = Ложь, ИзДокумента = Ложь) Экспорт
		
	Организация = Отбор.Организация.Значение;
	
	СписокНедоступныхВозможностейИзменения = Новый Массив;
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка());
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется);
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПарамВозможностьИзменения", СписокНедоступныхВозможностейИзменения);
	Запрос.УстановитьПараметр("ПарамДата", Отбор.ПериодДействия.Значение);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Отбор.ПериодДействия.Значение));
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И Сотрудник В (&Сотрудники)) КАК РаботникиОрганизаций
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &ПарамДата
		|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
		|		КОНЕЦ = &ОбособленноеПодразделение
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &ПарамДата
		|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период > &ПарамДата
		|	И РаботникиОрганизаций.Период <= &КонецМесяца
		|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
		|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|	И РаботникиОрганизаций.Сотрудник В (&Сотрудники)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.Сотрудник,
		|	ПериодыПерекрытия.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
		|		ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
		|			И (ПериодыПерекрытия.Период > Работники.Период)
		|			И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
		|			И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
		|ГДЕ
		|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И Работники.ПериодЗавершения > &ПарамДата
		|	И Работники.ПериодЗавершения <= &КонецМесяца
		|	И Работники.Организация = &ГоловнаяОрганизация
		|	И Работники.ОбособленноеПодразделениеЗавершения = &ОбособленноеПодразделение
		|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
		|	И Работники.Сотрудник В (&Сотрудники)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник"; 
		
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		
		
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|		&ОбособленноеПодразделение КАК Организация,
		|		Сотрудники.Подразделение КАК Подразделение,
		|		&ПарамДата КАК ПериодДействия,
		|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|		ВложенныйЗапрос.Показатель КАК Показатель,
		|		СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|		ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение  И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5,
		|			Показатели.Показатель
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 6)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			Сотрудники.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(Показатели.Значение),
		|			Показатели.Валюта
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК Сотрудник,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Значение,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И ФизЛицо В (ВЫБРАТЬ Сотрудник.ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 1)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель2),
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И ФизЛицо В (ВЫБРАТЬ Сотрудник.ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 2)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель3),
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И ФизЛицо В (ВЫБРАТЬ Сотрудник.ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель4),
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта4
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И ФизЛицо В (ВЫБРАТЬ Сотрудник.ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 4)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта4
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель5),
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта5
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение И ФизЛицо В (ВЫБРАТЬ Сотрудник.ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 5)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта5
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель6),
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта6
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ОбособленноеПодразделение  И ФизЛицо В (ВЫБРАТЬ Сотрудник.ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 6)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта6) КАК Показатели
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					СписокСотрудников.Сотрудник КАК Сотрудник,
		|					СписокСотрудников.Физлицо КАК Физлицо
		|				ИЗ
		|					(ВЫБРАТЬ
		|						МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
		|						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|						1 КАК Приоритет
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|					ГДЕ
		|						ВЫБОР
		|								КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
		|										И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
		|								ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
		|							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					СГРУППИРОВАТЬ ПО
		|						РаботникиОсновноеМесто.Сотрудник.Физлицо
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						МАКСИМУМ(РаботникиСовместительство.Сотрудник),
		|						РаботникиСовместительство.Сотрудник.Физлицо,
		|						2
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|					ГДЕ
		|						ВЫБОР
		|								КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
		|										И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
		|								ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
		|							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					СГРУППИРОВАТЬ ПО
		|						РаботникиСовместительство.Сотрудник.Физлицо
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						МАКСИМУМ(СотрудникиДУ.Ссылка),
		|						СотрудникиДУ.Физлицо,
		|						ВЫБОР
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|								ТОГДА 3
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|								ТОГДА 4
		|							ИНАЧЕ 5
		|						КОНЕЦ
		|					ИЗ
		|						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
		|					
		|					СГРУППИРОВАТЬ ПО
		|						СотрудникиДУ.Физлицо,
		|						ВЫБОР
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|								ТОГДА 3
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|								ТОГДА 4
		|							ИНАЧЕ 5
		|						КОНЕЦ) КАК СписокСотрудников
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							СписокФизическихЛиц.Физлицо КАК Физлицо,
		|							МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
		|						ИЗ
		|							(ВЫБРАТЬ
		|								РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|								1 КАК Приоритет
		|							ИЗ
		|								РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|										&ПарамДата,
		|										Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|											И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|							ГДЕ
		|								ВЫБОР
		|										КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
		|												И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
		|										ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
		|									КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								РаботникиСовместительство.Сотрудник.Физлицо,
		|								2
		|							ИЗ
		|								РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|										&ПарамДата,
		|										Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|											И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|							ГДЕ
		|								ВЫБОР
		|										КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
		|												И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
		|										ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
		|									КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|							
		|							ОБЪЕДИНИТЬ
		|							
		|							ВЫБРАТЬ
		|								СотрудникиДУ.Физлицо,
		|								ВЫБОР
		|									КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|										ТОГДА 3
		|									КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|										ТОГДА 4
		|									ИНАЧЕ 5
		|								КОНЕЦ
		|							ИЗ
		|								Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
		|						
		|						СГРУППИРОВАТЬ ПО
		|							СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
		|						ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
		|							И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
		|				ПО Показатели.Сотрудник = Сотрудники.Физлицо
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель В (&Показатели)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Показатели.Показатель,
		|			Сотрудники.Сотрудник,
		|			Показатели.Валюта) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.Сотрудник = ВложенныйЗапрос.Сотрудник
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.Сотрудник,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	Сотрудник,
		|	Подразделение";
		
		Запрос.Выполнить();
		
		ВТПлановыеПоказатели = "ВТПлановыеПоказатели";
		
		
		Если ЗначениеЗаполнено(ТаблицаЗапроса) Тогда
			
			
			Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ВидПоказателя,
			|	Таблица.Показатель,
			|	Таблица.Сотрудник
			|	ПОМЕСТИТЬ ВТПоказателиИСотрудники
			|ИЗ &ТаблицаЗапроса КАК Таблица
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Сотрудник";
			
			Запрос.Выполнить();
			
			ВТПоказателиИСотрудники = "ВТПоказателиИСотрудники";
			
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	&ОбособленноеПодразделение КАК Организация,
			               |	ИтоговаяТаблица.Подразделение КАК Подразделение,
			               |	ИтоговаяТаблица.Сотрудник КАК Сотрудник,
			               |	ИтоговаяТаблица.Показатель КАК Показатель,
			               |	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
			               |	ИтоговаяТаблица.Валюта КАК Валюта,
			               |	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ВложеннаяТаблица.Показатель КАК Показатель,
			               |		ВложеннаяТаблица.Подразделение КАК Подразделение,
			               |		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
			               |		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
			               |		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
			               |		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
			               |	ИЗ
			               |		(ВЫБРАТЬ
			               |			Факт.Показатель КАК Показатель,
			               |			Факт.Подразделение КАК Подразделение,
			               |			Факт.Сотрудник КАК Сотрудник,
			               |			Факт.ПериодДействия КАК ПериодДействия,
			               |			МАКСИМУМ(Факт.Валюта) КАК Валюта,
			               |			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
			               |			NULL КАК ПлановоеЗначение
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(ЗначенияПоказателейСхемМотивации.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Подразделение,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
			               |				МАКСИМУМ(ЗначенияПоказателейСхемМотивации.Валюта) КАК Валюта,
			               |				СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
			               |			ИЗ
			               |				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			               |			ГДЕ
			               |				ЗначенияПоказателейСхемМотивации.Организация = &ОбособленноеПодразделение
			               |				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			               |				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ЗначенияПоказателейСхемМотивации.Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(ЗначенияПоказателейСхемМотивации.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ЗначенияПоказателейСхемМотивации.Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия
			               |			
			               |			ОБЪЕДИНИТЬ ВСЕ
			               |			
			               |			ВЫБРАТЬ
			               |				ТаблицаЗапроса.Показатель,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				&ПарамДата,
			               |				NULL,
			               |				СУММА(0)
			               |			ИЗ
			               |				ВТПоказателиИСотрудники КАК ТаблицаЗапроса
			               |					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
			               |					ПО (Сотрудники.Сотрудник = ТаблицаЗапроса.Сотрудник)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.ПодразделенияОрганизаций)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ТаблицаЗапроса.Показатель) КАК Факт
			               |		
			               |		СГРУППИРОВАТЬ ПО
			               |			Факт.Показатель,
			               |			Факт.Подразделение,
			               |			Факт.Сотрудник,
			               |			Факт.ПериодДействия
			               |		
			               |		ОБЪЕДИНИТЬ
			               |		
			               |		ВЫБРАТЬ
			               |			ПЛАН.Показатель,
			               |			ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |					ТОГДА ПЛАН.Сотрудник
			               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |			КОНЕЦ,
			               |			ПЛАН.ПериодДействия,
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
			               |					ТОГДА NULL
			               |				ИНАЧЕ ПЛАН.Валюта
			               |			КОНЕЦ,
			               |			NULL,
			               |			ЕСТЬNULL(ПЛАН.Значение, 0)
			               |		ИЗ
			               |			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
			               |	
			               |	СГРУППИРОВАТЬ ПО
			               |		ВложеннаяТаблица.Показатель,
			               |		ВложеннаяТаблица.Подразделение,
			               |		ВложеннаяТаблица.Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
						   |
						   |ГДЕ ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ИтоговаяТаблица.Подразделение,
			               |	ИтоговаяТаблица.Сотрудник,
			               |	ИтоговаяТаблица.Показатель,
			               |	ИтоговаяТаблица.ПериодДействия,
			               |	ИтоговаяТаблица.Валюта
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Подразделение,
			               |	ИтоговаяТаблица.Сотрудник.Наименование,
			               |	Показатель";
			
			
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Показатели.Организация КАК Организация,
			|	Показатели.Подразделение КАК Подразделение,
			|	Показатели.ПериодДействия КАК ПериодДействия,
			|	Показатели.Сотрудник КАК Сотрудник,
			|	Показатели.Показатель КАК Показатель,
			|	Показатели.Валюта,
			|	СУММА(Показатели.Значение) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ПлановыеПоказатели.Организация КАК Организация,
			|		ПлановыеПоказатели.Подразделение КАК Подразделение,
			|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
			|		ПлановыеПоказатели.Сотрудник КАК Сотрудник,
			|		ПлановыеПоказатели.Показатель КАК Показатель,
			|		ПлановыеПоказатели.Значение КАК Значение,
			|		ПлановыеПоказатели.Валюта КАК Валюта
			|	ИЗ
			|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&ОбособленноеПодразделение,
			|		ЗначенияПоказателейСхемМотивации.Подразделение,
			|		&ПарамДата,
			|		ЗначенияПоказателейСхемМотивации.Сотрудник,
			|		ЗначенияПоказателейСхемМотивации.Показатель,
			|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
			|		ЗначенияПоказателейСхемМотивации.Валюта
			|	ИЗ
			|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|	ГДЕ
			|		ЗначенияПоказателейСхемМотивации.Организация = &ОбособленноеПодразделение
			|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			|		И ЗначенияПоказателейСхемМотивации.Показатель В(&Показатели)
			|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата) КАК Показатели
			|
			|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			|
			|СГРУППИРОВАТЬ ПО
			|	Показатели.Сотрудник,
			|	Показатели.Показатель,
			|	Показатели.Подразделение,
			|	Показатели.Валюта,
			|	Показатели.Организация,
			|	Показатели.ПериодДействия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организация,
			|	Подразделение,
			|	Сотрудник,
			|	Показатель";
		КонецЕсли;
	Иначе
		
		
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Отбор.ПериодДействия.Значение));
		
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Работники.ФизЛицо КАК ФизЛицо,
		|	Работники.Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&ПарамДата, ) КАК Работники
		|ГДЕ
		|	Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|ГДЕ
		|	Работники.Период > &ПарамДата
		|	И Работники.Период <= &КонецМесяца
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК ПериодыПерекрытия
		|		ПО (ПериодыПерекрытия.Период > Работники.Период)
		|ГДЕ
		|	ПериодыПерекрытия.Период ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		
		Запрос.Текст = СотрудникиТекст;
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Сотрудники.Подразделение КАК Подразделение,
		|	&ПарамДата КАК ПериодДействия,
		|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
		|	ВложенныйЗапрос.Показатель КАК Показатель,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|				И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|				И ((НЕ Показатели.Показатель.Предопределенный))
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата,ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			Показатели.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(Показатели.Значение),
		|			Показатели.Валюта
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 1)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта1
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель2) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта2 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 2)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта2
		
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель3) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта3 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта3
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель4) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта4 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 4)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта4
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель5) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта5 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта5
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель6) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта6 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 6)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта6) КАК Показатели
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель В (&Показатели)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Показатели.Показатель,
		|			Показатели.ФизЛицо,
		|			Показатели.Валюта) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.ФизЛицо,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	ФизЛицо,
		|	Подразделение";
		
		Запрос.Выполнить();
		
		ВТПлановыеПоказатели = "ВТПлановыеПоказатели";
		
		
		
		Если ИзДокумента Тогда
			
			Запрос.УстановитьПараметр("ТаблицаЗапроса",ТаблицаЗапроса);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Таблица.ВидПоказателя,
			|	Таблица.Показатель,
			|	Таблица.Сотрудник
			|	ПОМЕСТИТЬ ВТПоказателиИСотрудники
			|ИЗ &ТаблицаЗапроса КАК Таблица
			|ИНДЕКСИРОВАТЬ ПО
			|	Таблица.Сотрудник";
			
			Запрос.Выполнить();
			
			ВТПоказателиИСотрудники = "ВТПоказателиИСотрудники";
			
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ИтоговаяТаблица.Подразделение КАК Подразделение,
			               |	Сотрудники.Сотрудник КАК Сотрудник,
			               |	ИтоговаяТаблица.Показатель КАК Показатель,
			               |	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
			               |	ИтоговаяТаблица.Валюта КАК Валюта,
			               |	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
			               |ИЗ
			               |	(ВЫБРАТЬ
			               |		ВложеннаяТаблица.Показатель КАК Показатель,
			               |		ВложеннаяТаблица.Подразделение КАК Подразделение,
			               |		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
			               |		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
			               |		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
			               |		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
			               |		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
			               |	ИЗ
			               |		(ВЫБРАТЬ
			               |			Факт.Показатель КАК Показатель,
			               |			Факт.Подразделение КАК Подразделение,
			               |			Факт.Сотрудник.Физлицо КАК Сотрудник,
			               |			Факт.ПериодДействия КАК ПериодДействия,
			               |			МАКСИМУМ(Факт.Валюта) КАК Валюта,
			               |			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
			               |			NULL КАК ПлановоеЗначение
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
			               |						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
			               |				КОНЕЦ КАК Подразделение,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ КАК Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
			               |				МАКСИМУМ(ЗначенияПоказателейСхемМотивации.Валюта) КАК Валюта,
			               |				СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
			               |			ИЗ
			               |				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			               |			ГДЕ
			               |				ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			               |				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			               |				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ЗначенияПоказателейСхемМотивации.Показатель,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
			               |						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
			               |				КОНЕЦ,
			               |				ЗначенияПоказателейСхемМотивации.Сотрудник,
			               |				ЗначенияПоказателейСхемМотивации.ПериодДействия,
			               |				ВЫБОР
			               |					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ
			               |			
			               |			ОБЪЕДИНИТЬ ВСЕ
			               |			
			               |			ВЫБРАТЬ
			               |				ТаблицаЗапроса.Показатель,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.Подразделения)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				&ПарамДата,
			               |				NULL,
			               |				СУММА(0)
			               |			ИЗ
			               |				ВТПоказателиИСотрудники КАК ТаблицаЗапроса
			               |					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
			               |					ПО (Сотрудники.ФизЛицо = ТаблицаЗапроса.Сотрудник.ФизЛицо)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
			               |						ТОГДА ВЫРАЗИТЬ(Сотрудники.Подразделение КАК Справочник.Подразделения)
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ВЫБОР
			               |					КОГДА ТаблицаЗапроса.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |						ТОГДА ТаблицаЗапроса.Сотрудник
			               |					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |				КОНЕЦ,
			               |				ТаблицаЗапроса.Показатель) КАК Факт
			               |		
			               |		СГРУППИРОВАТЬ ПО
			               |			Факт.Показатель,
			               |			Факт.Подразделение,
			               |			Факт.Сотрудник,
			               |			Факт.ПериодДействия,
			               |			Факт.Сотрудник.Физлицо
			               |		
			               |		ОБЪЕДИНИТЬ
			               |		
			               |		ВЫБРАТЬ
			               |			ПЛАН.Показатель,
			               |			ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка),
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
			               |					ТОГДА ПЛАН.ФизЛицо
			               |				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
			               |			КОНЕЦ,
			               |			ПЛАН.ПериодДействия,
			               |			ВЫБОР
			               |				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
			               |					ТОГДА NULL
			               |				ИНАЧЕ ПЛАН.Валюта
			               |			КОНЕЦ,
			               |			NULL,
			               |			ЕСТЬNULL(ПЛАН.Значение, 0)
			               |		ИЗ
			               |			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
			               |	
			               |	СГРУППИРОВАТЬ ПО
			               |		ВложеннаяТаблица.Подразделение,
			               |		ВложеннаяТаблица.Сотрудник,
			               |		ВложеннаяТаблица.Показатель,
			               |		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			СписокСотрудников.Сотрудник КАК Сотрудник,
			               |			СписокСотрудников.Физлицо КАК Физлицо
			               |		ИЗ
			               |			(ВЫБРАТЬ
			               |				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			               |				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			               |				1 КАК Приоритет
			               |			ИЗ
			               |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			               |			ГДЕ
			               |				ВЫБОР
			               |						КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			               |								И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |							ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			               |						ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			               |					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				РаботникиОсновноеМесто.Сотрудник.Физлицо
			               |			
			               |			ОБЪЕДИНИТЬ
			               |			
			               |			ВЫБРАТЬ
			               |				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			               |				РаботникиСовместительство.Сотрудник.Физлицо,
			               |				2
			               |			ИЗ
			               |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			               |			ГДЕ
			               |				ВЫБОР
			               |						КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			               |								И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |							ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			               |						ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			               |					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				РаботникиСовместительство.Сотрудник.Физлицо
			               |			
			               |			ОБЪЕДИНИТЬ
			               |			
			               |			ВЫБРАТЬ
			               |				МАКСИМУМ(СотрудникиДУ.Ссылка),
			               |				СотрудникиДУ.Физлицо,
			               |				ВЫБОР
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |						ТОГДА 3
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |						ТОГДА 4
			               |					ИНАЧЕ 5
			               |				КОНЕЦ
			               |			ИЗ
			               |				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			               |			
			               |			СГРУППИРОВАТЬ ПО
			               |				СотрудникиДУ.Физлицо,
			               |				ВЫБОР
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |						ТОГДА 3
			               |					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |						ТОГДА 4
			               |					ИНАЧЕ 5
			               |				КОНЕЦ) КАК СписокСотрудников
			               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |					СписокФизическихЛиц.Физлицо КАК Физлицо,
			               |					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			               |				ИЗ
			               |					(ВЫБРАТЬ
			               |						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			               |						1 КАК Приоритет
			               |					ИЗ
			               |						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			               |								&ПарамДата,
			               |								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			               |					ГДЕ
			               |						ВЫБОР
			               |								КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			               |										И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |									ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			               |								ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			               |							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |					
			               |					ОБЪЕДИНИТЬ
			               |					
			               |					ВЫБРАТЬ
			               |						РаботникиСовместительство.Сотрудник.Физлицо,
			               |						2
			               |					ИЗ
			               |						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			               |								&ПарамДата,
			               |								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			               |					ГДЕ
			               |						ВЫБОР
			               |								КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			               |										И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |									ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			               |								ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			               |							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			               |					
			               |					ОБЪЕДИНИТЬ
			               |					
			               |					ВЫБРАТЬ
			               |						СотрудникиДУ.Физлицо,
			               |						ВЫБОР
			               |							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			               |								ТОГДА 3
			               |							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			               |								ТОГДА 4
			               |							ИНАЧЕ 5
			               |						КОНЕЦ
			               |					ИЗ
			               |						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			               |				
			               |				СГРУППИРОВАТЬ ПО
			               |					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			               |				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			               |					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			               |		ПО ИтоговаяТаблица.Сотрудник = Сотрудники.Физлицо
						   |
						   |ГДЕ ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ИтоговаяТаблица.Подразделение,
			               |	Сотрудники.Сотрудник,
			               |	ИтоговаяТаблица.Показатель,
			               |	ИтоговаяТаблица.ПериодДействия,
			               |	ИтоговаяТаблица.Валюта
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Подразделение,
			               |	Сотрудники.Сотрудник.Наименование,
			               |	Показатель";
			
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Показатели.Подразделение КАК Подразделение,
			|	Показатели.ПериодДействия КАК ПериодДействия,
			|	Показатели.Сотрудник КАК Сотрудник,
			|	Показатели.Показатель КАК Показатель,
			|	Показатели.Валюта,
			|	СУММА(Показатели.Значение) КАК Значение
			|ИЗ
			|	(ВЫБРАТЬ
			|		ПлановыеПоказатели.Подразделение КАК Подразделение,
			|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
			|		Сотрудники.Сотрудник КАК Сотрудник,
			|		ПлановыеПоказатели.Показатель КАК Показатель,
			|		ПлановыеПоказатели.Значение КАК Значение,
			|		ПлановыеПоказатели.Валюта КАК Валюта
			|	ИЗ
			|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				СписокСотрудников.Сотрудник КАК Сотрудник,
			|				СписокСотрудников.Физлицо КАК Физлицо
			|			ИЗ
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			|					РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|					1 КАК Приоритет
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			|									И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|							ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиОсновноеМесто.Сотрудник.Физлицо
			|				
			|				ОБЪЕДИНИТЬ
			|				
			|				ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			|					РаботникиСовместительство.Сотрудник.Физлицо,
			|					2
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			|									И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			|							ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиСовместительство.Сотрудник.Физлицо
			|				
			|				ОБЪЕДИНИТЬ
			|				
			|				ВЫБРАТЬ
			|					МАКСИМУМ(СотрудникиДУ.Ссылка),
			|					СотрудникиДУ.Физлицо,
			|					ВЫБОР
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|							ТОГДА 3
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|							ТОГДА 4
			|						ИНАЧЕ 5
			|					КОНЕЦ
			|				ИЗ
			|					Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			|				
			|				СГРУППИРОВАТЬ ПО
			|					СотрудникиДУ.Физлицо,
			|					ВЫБОР
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|							ТОГДА 3
			|						КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|							ТОГДА 4
			|						ИНАЧЕ 5
			|					КОНЕЦ) КАК СписокСотрудников
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|						СписокФизическихЛиц.Физлицо КАК Физлицо,
			|						МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			|					ИЗ
			|						(ВЫБРАТЬ
			|							РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|							1 КАК Приоритет
			|						ИЗ
			|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|									&ПарамДата,
			|									Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|						ГДЕ
			|							ВЫБОР
			|									КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ПарамДата
			|											И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|										ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|									ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|						
			|						ОБЪЕДИНИТЬ
			|						
			|						ВЫБРАТЬ
			|							РаботникиСовместительство.Сотрудник.Физлицо,
			|							2
			|						ИЗ
			|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|									&ПарамДата,
			|									Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|										И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|						ГДЕ
			|							ВЫБОР
			|									КОГДА РаботникиСовместительство.ПериодЗавершения <= &ПарамДата
			|											И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|										ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			|									ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
			|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|						
			|						ОБЪЕДИНИТЬ
			|						
			|						ВЫБРАТЬ
			|							СотрудникиДУ.Физлицо,
			|							ВЫБОР
			|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|									ТОГДА 3
			|								КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|									ТОГДА 4
			|								ИНАЧЕ 5
			|							КОНЕЦ
			|						ИЗ
			|							Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			|					
			|					СГРУППИРОВАТЬ ПО
			|						СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			|					ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			|						И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			|			ПО ПлановыеПоказатели.Физлицо = Сотрудники.Физлицо
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗначенияПоказателейСхемМотивации.Подразделение,
			|		&ПарамДата,
			|		ЗначенияПоказателейСхемМотивации.Сотрудник,
			|		ЗначенияПоказателейСхемМотивации.Показатель,
			|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
			|		ЗначенияПоказателейСхемМотивации.Валюта
			|	ИЗ
			|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
			|	ГДЕ
			|		ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
			|		И ЗначенияПоказателейСхемМотивации.Показатель В(&Показатели)
			|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата) КАК Показатели
			|
			|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Ежемесячно)
			|
			|СГРУППИРОВАТЬ ПО
			|	Показатели.Подразделение,
			|	Показатели.Сотрудник,
			|	Показатели.Показатель,
			|	Показатели.Валюта,
			|	Показатели.ПериодДействия
			|
			|УПОРЯДОЧИТЬ ПО
			|	Подразделение,
			|	Сотрудник,
			|	Показатель";
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение

