
Процедура ЗаполнитьПараметрыБлокировкиСеансов(ПараметрыБлокировки, ТекущаяДата) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ВремяПринудительногоЗавершения) Тогда
		// если блокировка уже установлена (из-за обновления, например), 
		// то не будем ее "сдвигать" на более поздний срок
		Если ПараметрыБлокировки.Установлена И ПараметрыБлокировки.Начало < ПараметрыСеанса.ВремяПринудительногоЗавершения Тогда
			Возврат;
		КонецЕсли;
		ПараметрыБлокировки.Вставить("Установлена", Истина);
		ПараметрыБлокировки.Вставить("Начало", ПараметрыСеанса.ВремяПринудительногоЗавершения);
		ПараметрыБлокировки.Вставить("Конец", Дата(1,1,1));
		ПараметрыБлокировки.Вставить("ПерезапуститьПриЗавершении", Ложь);
		ПараметрыБлокировки.Вставить("Сообщение", НСтр("ru = ', установлено ограничение времени сеанса'"));
	КонецЕсли;
	
КонецПроцедуры
