
// Возвращает список видов документов для этого журнала в виде списка значений
// 
Функция ПолучитьСписокВидовДокументов(мСписокВидовДокументов) Экспорт
	Если мСписокВидовДокументов <> НеОпределено Тогда
		Возврат мСписокВидовДокументов;
	КонецЕсли;
	
	мСписокВидовДокументов = Новый СписокЗначений;
	мСписокВидовДокументов.Добавить("ТабельУчетаРабочегоВремениОрганизации");
	мСписокВидовДокументов.Добавить("ТабельУчетаРабочегоВремениВодителейОрганизации");
	мСписокВидовДокументов.Добавить("ТабельУчетаРабочегоВремениВредность");
	мСписокВидовДокументов.Добавить();
	мСписокВидовДокументов.Добавить("ВводИндивидуальныхГрафиковРаботыОрганизации");
	мСписокВидовДокументов.Добавить();
	
	РаботаСДиалогами.ДополнитьСписокВидовДокументов(Метаданные.ЖурналыДокументов.УчетТабелейОрганизаций, мСписокВидовДокументов);
	
	Возврат мСписокВидовДокументов;
	
КонецФункции
