     
Функция ПолучитьТаблицуВозможныхОбменовСРТ() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации           = "РТ";                                             				 // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена            = "ОбменРозницаЗарплатаИУправлениеПерсоналом";       				 // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации  = "Розница для Беларуси, редакция 1.0";
	СтрокаТаблицы.ПредставлениеКонфигурации = "1С:Розница для Беларуси 8 (начиная с версии 1.0)"; 				 // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию        = "РТ";                                              				 // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазе() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "ЗУП");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменРозницаЗарплатаИУправлениеПерсоналом");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "1С:Зарплата и Управление Персоналом для Беларуси (начиная с версии 2.5)");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "ЗУП");
	
	Возврат СтруктураДанных;
	
КонецФункции

