// Общий модуль"ПравилаОбменаСПрограммамиБухгалтерскогоУчета"
// Выполняется на сервере, содержит набор методов,
// предназначеных для процедур администрирования и организации
// обменов с бухгалтерскими программами.

// Получает макет правил обмена, при этом производится проверка на возможность
// администрирования правил обмена. В случае администррования проверяет наличие альтернативных правил.
// Параметры: 
//	"ПрограммаБухгалтерскогоУчета" - перечисление ссылка "ПрограммыБухгалтерскогоУчета"
// Возвращаемое значение:
//	Макет правил обмена:
// 	Неопределено - если наличие правил обмена не предусмотрено
Функция ПолучитьМакетПравилОбмена(ОбработкаОбъект, ПрограммаБухгалтерскогоУчета) Экспорт
	
	ИмяТиповогоМакета = ПолучитьИмяТиповогоМакетаПравилОбмена(ПрограммаБухгалтерскогоУчета);
	
	Если ПустаяСтрока(ИмяТиповогоМакета) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ОбработкаОбъект.ПолучитьМакет(ИмяТиповогоМакета);
	
КонецФункции

// Возвращает имя макета типовых правил обмена
// Параметры:
//	"ПрограммаБухгалтерскогоУчета" - перечисление ссылка "ПрограммыБухгалтерскогоУчета" 
// Возвращаемое значение:
//	Строка, содержащая имя макета типовых правил обмена. 
//	Пустая строка во всех случаях, когда наличие макета не предусматривается
Функция ПолучитьИмяТиповогоМакетаПравилОбмена(ПрограммаБухгалтерскогоУчета) Экспорт
	
			
	Если ПрограммаБухгалтерскогоУчета = Перечисления.ПрограммыБухгалтерскогоУчета.БухгалтерияПредприятия16 Тогда
		
		Возврат "ПравилаОбменаБП16";
		
	ИначеЕсли ПрограммаБухгалтерскогоУчета = Перечисления.ПрограммыБухгалтерскогоУчета.БухгалтерияПредприятияРБ20  Тогда
		
		Возврат "ПравилаОбменаБП20";
		
	КонецЕсли;
	
	Возврат "";

КонецФункции

