Функция ЭтоСправочник(Значение) 
	
	Возврат  Найти(Значение.Метаданные().ПолноеИмя(),"Справочник")>0;
	
КонецФункции

Функция ПорядковыйНомер(Значение)
	Возврат Перечисления[Значение.Метаданные().Имя].Индекс(Значение) + 1;
КонецФункции

Функция ЭтоПеречисление(Значение) 
	
	Возврат  Найти(Значение.Метаданные().ПолноеИмя(),"Перечисление")>0;
	
КонецФункции

Процедура ВыборФайлаДляВыгрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.Каталог;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьПроводки() Экспорт
	
	БД=Новый  xBase;	
	
	БД.поля.Добавить("DATA","D",10);
	
	БД.поля.Добавить("DEBET","S",10);
	БД.поля.Добавить("SUB_D1","S",11);
	БД.поля.Добавить("SUB_D2","S",11);
	БД.поля.Добавить("SUB_D3","S",11);
	БД.поля.Добавить("SUB_D4","S",11);
	
	БД.поля.Добавить("CREDIT","S",10);
	БД.поля.Добавить("SUB_K1","S",11);
	БД.поля.Добавить("SUB_K2","S",11);
	БД.поля.Добавить("SUB_K3","S",11);
	БД.поля.Добавить("SUB_K4","S",11);
	
	БД.поля.Добавить("SUM","N",19,2);
	
	БД.СоздатьФайл(ФайлВыгрузки+"\entries8.DBF");
	
	ДокОбъект=ВыгружаемыйДокумент.ПолучитьОбъект();
	
	Для Каждого Стр Из ДокОбъект.ОтражениеВУчете Цикл
		
		Если (Стр.СчетДт.НеПереносить) или (Стр.СчетКт.НеПереносить) Тогда
			Продолжить;
		КонецЕсли;
		
		БД.Добавить();
		БД.DEBET=Строка(Стр.СчетДт.Код);
		БД.DATA=ДокОбъект.ПериодРегистрации;
		БД.SUM=Стр.Сумма;
		
		Если (Стр.СчетДт.ВидыСубконто.Количество()>0) и (ЗначениеЗаполнено(Стр.СубконтоДт1)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоДт1) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоДт1.ПолучитьОбъект().Метаданные()) ТОгда
					Если ТипЗнч(Стр.СубконтоДт1.Код77)=Тип("Число") ТОгда
						БД.SUB_D1=Строка(Формат(Стр.СубконтоДт1.Код77,"ЧГ="));
					Иначе							
						БД.SUB_D1=Строка(Стр.СубконтоДт1.Код77);
					КонецЕсли;					
				Иначе					
					БД.SUB_D1=Строка(Стр.СубконтоДт1.Код);
				КонецЕсли;
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоДт1) ТОгда							
				БД.SUB_D1=Строка(ПорядковыйНомер(Стр.СубконтоДт1));
			КонецЕсли;			
		КонецЕсли;	
		
		Если (Стр.СчетДт.ВидыСубконто.Количество()>1) и (ЗначениеЗаполнено(Стр.СубконтоДт2)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоДт2) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоДт2.ПолучитьОбъект().Метаданные()) ТОгда
					Если ТипЗнч(Стр.СубконтоДт2.Код77)=Тип("Число") ТОгда
						БД.SUB_D2=Строка(Формат(Стр.СубконтоДт2.Код77,"ЧГ="));
					Иначе							
						БД.SUB_D2=Строка(Стр.СубконтоДт2.Код77);				
					КонецЕсли;					
				Иначе					
					БД.SUB_D2=Строка(Стр.СубконтоДт2.Код);				
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоДт2) ТОгда							
				БД.SUB_D2=Строка(ПорядковыйНомер(Стр.СубконтоДт2));
			КонецЕсли;			
		КонецЕсли;	
		Если (Стр.СчетДт.ВидыСубконто.Количество()>2) и (ЗначениеЗаполнено(Стр.СубконтоДт3)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоДт3) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоДт3.ПолучитьОбъект().Метаданные()) ТОгда
					//БД.SUB_D3=Строка(Формат(Число(Стр.СубконтоДт3.Код77),"ЧГ="));					
					Если ТипЗнч(Стр.СубконтоДт3.Код77)=Тип("Число") ТОгда
						БД.SUB_D3=Строка(Формат(Стр.СубконтоДт3.Код77,"ЧГ="));
					Иначе							
						БД.SUB_D3=Строка(Стр.СубконтоДт3.Код77);				
					КонецЕсли;
				Иначе					
					БД.SUB_D3=Строка(Стр.СубконтоДт3.Код);
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоДт3) ТОгда							
				БД.SUB_D3=Строка(ПорядковыйНомер(Стр.СубконтоДт3));
			КонецЕсли;			
		КонецЕсли;		
		Если (Стр.СчетДт.ВидыСубконто.Количество()>3) и (ЗначениеЗаполнено(Стр.СубконтоДт4)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоДт4) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоДт4.ПолучитьОбъект().Метаданные()) ТОгда
					Если ТипЗнч(Стр.СубконтоДт4.Код77)=Тип("Число") ТОгда
						БД.SUB_D4=Строка(Формат(Стр.СубконтоДт4.Код77,"ЧГ="));
					Иначе							
						БД.SUB_D4=Строка(Стр.СубконтоДт4.Код77);
					КонецЕсли;					
				Иначе					
					БД.SUB_D4=Строка(Стр.СубконтоДт4.Код);		
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоДт4) ТОгда							
				БД.SUB_D4=Строка(ПорядковыйНомер(Стр.СубконтоДт4));
			КонецЕсли;				
		КонецЕсли;		
		БД.CREDIT=Строка(Стр.СчетКт.Код);
		Если (Стр.СчетКт.ВидыСубконто.Количество()>0) и (ЗначениеЗаполнено(Стр.СубконтоКт1)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоКт1) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоКт1.ПолучитьОбъект().Метаданные()) ТОгда
					БД.SUB_K1=Строка(Стр.СубконтоКт1.Код77);
				Иначе					
					БД.SUB_K1=Строка(Стр.СубконтоКт1.Код);
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоКт1) ТОгда							
				БД.SUB_K1=Строка(ПорядковыйНомер(Стр.СубконтоКт1));
			КонецЕсли;				
		КонецЕсли;		
		Если (Стр.СчетКт.ВидыСубконто.Количество()>1) и (ЗначениеЗаполнено(Стр.СубконтоКт2)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоКт2) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоКт2.ПолучитьОбъект().Метаданные()) ТОгда
					БД.SUB_K2=Строка(Стр.СубконтоКт2.Код77);
				Иначе					
					БД.SUB_K2=Строка(Стр.СубконтоКт2.Код);
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоКт2) ТОгда							
				БД.SUB_K2=Строка(ПорядковыйНомер(Стр.СубконтоКт2));
			КонецЕсли;				
		КонецЕсли;		
		Если (Стр.СчетКт.ВидыСубконто.Количество()>2) и (ЗначениеЗаполнено(Стр.СубконтоКт3)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоКт3) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоКт3.ПолучитьОбъект().Метаданные()) ТОгда
					БД.SUB_K3=Строка(Стр.СубконтоКт3.Код77);
				Иначе					
					БД.SUB_K3=Строка(Стр.СубконтоКт3.Код);
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоКт3) ТОгда							
				БД.SUB_K3=Строка(ПорядковыйНомер(Стр.СубконтоКт3));
			КонецЕсли;				
		КонецЕсли;		 
		Если (Стр.СчетКт.ВидыСубконто.Количество()>3) и (ЗначениеЗаполнено(Стр.СубконтоКт4)) ТОгда
			Если ЭтоСправочник(Стр.СубконтоКт4) ТОгда
				Если ОбщегоНазначения.ЕстьРеквизитСправочника("Код77",Стр.СубконтоКт4.ПолучитьОбъект().Метаданные()) ТОгда
					БД.SUB_K4=Строка(Стр.СубконтоКт4.Код77);
				Иначе					
					БД.SUB_K4=Строка(Стр.СубконтоКт4.Код);
				КонецЕсли;				
			ИначеЕсли ЭтоПеречисление(Стр.СубконтоКт4) ТОгда							
				БД.SUB_K4=Строка(ПорядковыйНомер(Стр.СубконтоКт4));
			КонецЕсли;				
		КонецЕсли;	
		БД.Записать();
	КонецЦикла;
КонецПроцедуры

