//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ, В КОТОРОМ ОПРЕДЕЛЯЮТСЯ НАСТРОЙКИ ПОДСИСТЕМЫ

Функция ОписаниеВиртуальныхПодсистем() Экспорт
	
	СписокПодсистем = Новый СписокЗначений;
	
	Возврат СписокПодсистем;
	
КонецФункции

Функция СортировкаПредопределенныхВариантов() Экспорт
	СоответствиеСортировкиИВариантов = Новый Соответствие;
	Возврат СоответствиеСортировкиИВариантов;
КонецФункции

Функция СписокОтчетовПоддерживаемыхПодсистемой() Экспорт

	СписокОтчетов = Новый СписокЗначений;
	СписокОтчетов.Добавить("Отчет.АнализНачисленийИПлатежныхВедомостей");
	СписокОтчетов.Добавить("Отчет.Вакансии");
	СписокОтчетов.Добавить("Отчет.Грейды");
	СписокОтчетов.Добавить("Отчет.ДвижениеРаботников");
	СписокОтчетов.Добавить("Отчет.ЖурналИнструктажейПоОхранеТруда");
	СписокОтчетов.Добавить("Отчет.ЗаявкиНаОбучениеРазвитие");
	СписокОтчетов.Добавить("Отчет.ИндивидуальныеПакетыЛьгот");
	СписокОтчетов.Добавить("Отчет.ИспользованиеРабочегоВремени");
	СписокОтчетов.Добавить("Отчет.ИспытательныйСрок");
	СписокОтчетов.Добавить("Отчет.КадровыйРезерв");
	СписокОтчетов.Добавить("Отчет.КонтрольДопусковКРаботам");
	СписокОтчетов.Добавить("Отчет.КонтрольЗадачАдаптацииУвольнения");
	СписокОтчетов.Добавить("Отчет.КонтрольПеремещенийСотрудниковПоТерриториям");
	СписокОтчетов.Добавить("Отчет.МатрицаГрейдов");
	СписокОтчетов.Добавить("Отчет.МояЗарплата");
	СписокОтчетов.Добавить("Отчет.НесчастныеСлучаиНаПроизводстве");
	СписокОтчетов.Добавить("Отчет.ОбучениеРазвитие");
	СписокОтчетов.Добавить("Отчет.ОтпускаКомпании");
	СписокОтчетов.Добавить("Отчет.ПланОбученияРазвития");
	СписокОтчетов.Добавить("Отчет.ПредоставленныеЛьготы");
	СписокОтчетов.Добавить("Отчет.РасходыНаПерсонал");
	СписокОтчетов.Добавить("Отчет.РеестрКадровыхПриказов");
	СписокОтчетов.Добавить("Отчет.РезультатыМедицинскихОсмотров");
	СписокОтчетов.Добавить("Отчет.РезультатыОбученияРазвития");
	СписокОтчетов.Добавить("Отчет.СведенияОбАттестацииСотрудников");
	СписокОтчетов.Добавить("Отчет.СписокВакансий");
	СписокОтчетов.Добавить("Отчет.СравнительныйАнализРасходовНаПерсонал");
	СписокОтчетов.Добавить("Отчет.СхемыМотивацииГрейдов");
	СписокОтчетов.Добавить("Отчет.ТелефоннаяКнига");
	СписокОтчетов.Добавить("Отчет.УченическиеДоговоры");
	СписокОтчетов.Добавить("Отчет.УчетИнструктажейПоОхранеТруда");
	
	Возврат СписокОтчетов;

КонецФункции

Функция КомандныйИнтерфейс() Экспорт
	
	ДанныеОПодсистемахВариантов = Новый Структура("СоответствиеПодсистемИВариантов, НеИспользоватьПодсистемыОтчета");
	ДанныеОПодсистемахВариантов.СоответствиеПодсистемИВариантов = Новый ТаблицаЗначений;
	ДанныеОПодсистемахВариантов.СоответствиеПодсистемИВариантов.Колонки.Добавить("Ключ");
	ДанныеОПодсистемахВариантов.СоответствиеПодсистемИВариантов.Колонки.Добавить("ПутьКПодсистеме");
	
	ДанныеОПодсистемахВариантов.НеИспользоватьПодсистемыОтчета = Новый ТаблицаЗначений;
	ДанныеОПодсистемахВариантов.НеИспользоватьПодсистемыОтчета.Колонки.Добавить("Ключ");
	ДанныеОПодсистемахВариантов.НеИспользоватьПодсистемыОтчета.Колонки.Добавить("ПутьКПодсистеме");

	
	
	Возврат ДанныеОПодсистемахВариантов;
	
КонецФункции	

