Процедура ВыборФайлаДляЗагрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "(*.xls,*.xlsx)|*.xls;*xlsx";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьПользователей() Экспорт
	
	Окно = Новый COMОбъект("Excel.Application");
	Книги = Окно.Workbooks;
	Книга = Книги.open(СокрЛП(Файлзагрузки));
	
	Если Книга.ActiveSheet.Name <> "Лист1" Тогда
		Книга.WorkSheets("Лист1").Activate();    	
	КонецЕсли;
	
	ТЗПользователи = Новый ТаблицаЗначений;
	
	ТЗПользователи.Колонки.Добавить("ИмяПользователяЗУП");
	ТЗПользователи.Колонки.Добавить("ИмяПользователяАД");
	
	Для ном = 2 по 200 Цикл		
		
		ИмяПользователяЗУП = Окно.Cells(ном,2).Value;
		
		Если СокрЛП(ИмяПользователяЗУП)="" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяДомена = Окно.Cells(ном,4).Value;
		
		Если СокрЛП(ИмяДомена)="" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПользователяАД = Окно.Cells(ном,5).Value;
		
		Если СокрЛП(ИмяПользователяАД)="" Тогда
			Продолжить;
		КонецЕсли;
		
		КартСчет = Окно.Cells(ном,2).Value;
		ДатаРождения = Окно.Cells(ном,3).Value;
		
		НоваяСтрока=ТЗПользователи.Добавить();
		
		НоваяСтрока.ИмяПользователяЗУП=СокрЛП(ИмяПользователяЗУП);
		НоваяСтрока.ИмяПользователяАД="\\"+СокрЛП(ИмяДомена)+"\"+СокрЛП(ИмяПользователяАД);
		
	КонецЦикла;

	Попытка
		Окно.Application.Quit();
	Исключение		
	КонецПопытки;
	
	
	Для каждого Стр Из ТЗПользователи Цикл
		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Стр.ИмяПользователяЗУП);
		
		Если Пользователь = Неопределено ТОгда
			
			Сообщить("Не найден пользователь с именем "+Стр.ИмяПользователяЗУП);
			
			Продолжить;
			
		КонецЕсли;
		
		Пользователь.АутентификацияОС = Истина;
		Пользователь.ПользовательОС = Стр.ИмяПользователяАД;
		Пользователь.АутентификацияСтандартная = Ложь;
		Пользователь.ПоказыватьВСпискеВыбора = Ложь;
		Пользователь.Записать();
		
	КонецЦикла;
	
	
	
КонецПроцедуры
