


// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВводАвансовОрганизаций.Ссылка,
	|	ВводАвансовОрганизаций.Дата,
	|	ВводАвансовОрганизаций.Организация,
	|	ВводАвансовОрганизаций.ПериодРегистрации
	|ИЗ
	|	Документ.ВводПлановыхАвансовОрганизаций КАК ВводАвансовОрганизаций
	|ГДЕ
	|	ВводАвансовОрганизаций.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()


Функция	СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводАвансовОрганизацийРаботникиОрганизации.Ссылка,
	|	ВводАвансовОрганизацийРаботникиОрганизации.ФизЛицо,
	|	ВводАвансовОрганизацийРаботникиОрганизации.Аванс
	|ИЗ
	|	Документ.ВводПлановыхАвансовОрганизаций.РаботникиОрганизации КАК ВводАвансовОрганизацийРаботникиОрганизации
	|ГДЕ
	|	ВводАвансовОрганизацийРаботникиОрганизации.Ссылка = &ДокументСсылка";
	
	 Возврат Запрос.Выполнить();

	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
    Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации();
		ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать();
		Пока ВыборкаПоРаботникиОрганизации.Следующий() цикл
			ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
		
		
		
// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)
	
	//Минск н
		// Движения по регистру "АвансыРаботниковОрганизаций"
		Движение = Движения.АвансыРаботникамОрганизаций.Добавить();
		// Свойства
		Движение.Период                     = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоРаботникиОрганизации.ФизЛицо;
		Движение.Организация   		    	= ВыборкаПоШапкеДокумента.Организация;
		
		// Ресурсы
		Движение.СуммаАванса           = ВыборкаПоРаботникиОрганизации.Аванс;

	КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений		
//vvv
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,, "Физлицо");
	
КонецПроцедуры
