////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ КЛИЕНТСКИЕ ПРОЦЕДУРЫ ПОДСИСТЕМЫ «ВАРИАНТЫ ОТЧЕТОВ»


Процедура ОткрытьПанельОтчетов(Подсистемы, НазваниеФормы, ПараметрыВыполненияКоманды, КартинкаФормы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Подсистемы, ИмяФормы, КартинкаФормы");
	ПараметрыФормы.Подсистемы    = Подсистемы;
	ПараметрыФормы.ИмяФормы      = НазваниеФормы;
	ПараметрыФормы.КартинкаФормы = КартинкаФормы;
	ОткрытьФорму("ОбщаяФорма.ПанельОтчетов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	
КонецПроцедуры
