
#Если ТолстыйКлиентОбычноеПриложение Тогда
	
Процедура ФормаЭлементаПередОткрытиемДополнительно(Форма) Экспорт
	
	//Форма.ЭлементыФормы.ЯвляетсяДСВ.Доступность = Не Форма.Предопределенный;
	//Форма.ЭлементыФормы.НадписьРасшифровкаЯвляетсяДСВ.Доступность = Не Форма.Предопределенный;
	
	ЭлементыФормы = Форма.ЭлементыФормы;
	
	// переключаем страницу
	Панель = ЭлементыФормы.ПанельСпискиВидовРасчета;
	Панель.ТекущаяСтраница = Панель.Страницы.Использование;
	
	// определяем параметры
	Лево	= 6;
	Верх	= 110;
	Ширина	= 448;
	
	// добавляем флажок
	ЯвляетсяУдержаниемВПользуТретихЛицФл = ЭлементыФормы.Добавить(Тип("Флажок"), "ЯвляетсяУдержаниемВПользуТретихЛиц", Истина, Панель);
	ЯвляетсяУдержаниемВПользуТретихЛицФл.Данные = "ЯвляетсяУдержаниемВПользуТретихЛиц";
	ЯвляетсяУдержаниемВПользуТретихЛицФл.Заголовок = "Является удержанием в пользу третих лиц";
	ЯвляетсяУдержаниемВПользуТретихЛицФл.Лево 	= Лево; 
	ЯвляетсяУдержаниемВПользуТретихЛицФл.Верх 	= Верх + 7; 
	ЯвляетсяУдержаниемВПользуТретихЛицФл.Ширина = Ширина; 
	ЯвляетсяУдержаниемВПользуТретихЛицФл.Высота = 15;
	ЯвляетсяУдержаниемВПользуТретихЛицФл.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);
	ЯвляетсяУдержаниемВПользуТретихЛицФл.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ЯвляетсяУдержаниемВПользуТретихЛицФл, ГраницаЭлементаУправления.Низ);
	ЯвляетсяУдержаниемВПользуТретихЛицФл.УстановитьПривязку(ГраницаЭлементаУправления.Право, Панель, ГраницаЭлементаУправления.Право);
	
	// добавляем информационную надпись
	ИнфНадписьЯУдВПТЛ = ЭлементыФормы.Добавить(Тип("Надпись"), "ИнфНадписьЯУдВПТЛ", Истина, Панель);
	ИнфНадписьЯУдВПТЛ.Заголовок = "Удержание выполняется в пользу третих лиц: профсоюзной организации, кредитной организации, получателя по исполнительному листу и др.";
	ИнфНадписьЯУдВПТЛ.Лево 		= ЯвляетсяУдержаниемВПользуТретихЛицФл.Лево + 15; 
	ИнфНадписьЯУдВПТЛ.Верх 		= Верх + ЯвляетсяУдержаниемВПользуТретихЛицФл.Высота + 7; 
	ИнфНадписьЯУдВПТЛ.Ширина 	= Ширина - 15; 
	ИнфНадписьЯУдВПТЛ.Высота 	= 27;
	ИнфНадписьЯУдВПТЛ.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	ИнфНадписьЯУдВПТЛ.УстановитьПривязку(ГраницаЭлементаУправления.Низ, Панель, ГраницаЭлементаУправления.Низ);
	ИнфНадписьЯУдВПТЛ.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ИнфНадписьЯУдВПТЛ, ГраницаЭлементаУправления.Низ);
	ИнфНадписьЯУдВПТЛ.УстановитьПривязку(ГраницаЭлементаУправления.Право, Панель, ГраницаЭлементаУправления.Право);
	
	// "сбрасываем" текущую страницу
	Панель.ТекущаяСтраница = Панель.Страницы[0];

КонецПроцедуры

#КонецЕсли