////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции


////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции модуля объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы списка

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДМЕНЮ ВВОД НА ОСНОВАНИИ

#Если Клиент Тогда

Процедура ДействиеВводНаОснованииПриемНаРаботу(Кнопка, ИсточникЗаполнения) Экспорт
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.ПриемНаРаботу) Тогда
		Предупреждение("Нарушение прав доступа!");
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Документы.ПриемНаРаботу.СоздатьДокумент();
	Если ТипЗнч(ИсточникЗаполнения) = Тип("ВыделенныеСтрокиТабличногоПоля") Тогда
		Для Каждого ВыделеннаяСтрока Из ИсточникЗаполнения Цикл
			ДокументОбъект.Заполнить(ВыделеннаяСтрока);
		КонецЦикла;
	Иначе
		ДокументОбъект.Заполнить(ИсточникЗаполнения);
	КонецЕсли;
	
	ФормаДокумента = ДокументОбъект.ПолучитьФорму();
	ФормаДокумента.Открыть();
	
КонецПроцедуры

Процедура ДействиеВводНаОснованииКадровоеПеремещение(Кнопка, ИсточникЗаполнения) Экспорт
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.КадровоеПеремещение) Тогда
		Предупреждение("Нарушение прав доступа!");
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Документы.КадровоеПеремещение.СоздатьДокумент();
	Если ТипЗнч(ИсточникЗаполнения) = Тип("ВыделенныеСтрокиТабличногоПоля") Тогда
		Для Каждого ВыделеннаяСтрока Из ИсточникЗаполнения Цикл
			ДокументОбъект.Заполнить(ВыделеннаяСтрока);
		КонецЦикла;
	Иначе
		ДокументОбъект.Заполнить(ИсточникЗаполнения);
	КонецЕсли;
	
	ФормаДокумента = ДокументОбъект.ПолучитьФорму();
	ФормаДокумента.Открыть();
	
КонецПроцедуры

Процедура ДействиеВводНаОснованииУвольнение(Кнопка, ИсточникЗаполнения) Экспорт
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.Увольнение) Тогда
		Предупреждение("Нарушение прав доступа!");
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Документы.Увольнение.СоздатьДокумент();
	Если ТипЗнч(ИсточникЗаполнения) = Тип("ВыделенныеСтрокиТабличногоПоля") Тогда
		Для Каждого ВыделеннаяСтрока Из ИсточникЗаполнения Цикл
			ДокументОбъект.Заполнить(ВыделеннаяСтрока);
		КонецЦикла;
	Иначе
		ДокументОбъект.Заполнить(ИсточникЗаполнения);
	КонецЕсли;
	
	ФормаДокумента = ДокументОбъект.ПолучитьФорму();
	ФормаДокумента.Открыть();
	
КонецПроцедуры
	
#КонецЕсли
