
Функция ВалютаПоказателяУсловиеЗапроса(НомерПоказателя) Экспорт
	
	Возврат	"Показатели.Валюта" + НомерПоказателя;
	
КонецФункции

Функция ПолеЗапросаТочностьПредставленияПоказателя() Экспорт
	
	Возврат "
	|	ВЫБОР
	|		КОГДА ПоказателиВидаРасчета.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
	|			ТОГДА 3
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПоказателиВидаРасчета.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|					ТОГДА 2
	|				ИНАЧЕ 3
	|			КОНЕЦ
	|	КОНЕЦ КАК ТочностьПредставления,";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ ПОКАЗАТЕЛЯ

Процедура ПоказателиФормаЭлементаПередОткрытиемДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ПоказателиФормаЭлементаПриСозданииФормы(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ПоказателиФормаЭлементаПриИзмененииВалютыДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ПоказателиФормаЭлементаПриИзмененииТипаПоказателяДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры
Процедура ДополнитьТипыВидимыхПоказателей(ТипыПоказателей) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ДополнитьТипыВидимыхПоказателей
