////////////////////////////////////////////////////////////////////////////////
// Функции для переноса данных из ЗУП 2.5 / ЗБУ 1.0
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Обработать параметры запуска, связанные с завершение и разрешение соединений ИБ.
//
// Параметры
//  ЗначениеПараметраЗапуска  – Строка – главный параметр запуска
//  ПараметрыЗапуска          – Массив – дополнительные параметры запуска, разделенные
//                                       символом ";".
//
// Возвращаемое значение:
//   Булево   – Истина, если требуется прекратить выполнение запуска системы.
//
Функция ОбработатьПараметрыЗапуска(Знач ЗначениеПараметраЗапуска, Знач ПараметрыЗапуска) Экспорт

	// Обработка параметра запуска программы - ЗарплатаКадрыПереносДанных
	Если ЗначениеПараметраЗапуска = Врег("ЗарплатаКадрыПереносДанных") Тогда
		Параметры = Новый Структура("ИмяФайлаИнструкций", СтрЗаменить(ПараметрыЗапуска[1], "*", " "));
		
		ОткрытьФормуМодально("Обработка.ПереносДанныхВНовуюПрограмму.Форма", Параметры);
		
		ЗавершитьРаботуСистемы(Ложь);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

