////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// при изменении структуры результата запроса необходимо корректировать эти номера
// стартовый номер для субконто дебета - позволяет адресоваться в строке из данных бухучета
// к конкретному субконто по его номеру 
Перем НомерДт;

// стартовый номер для субконто кредита - позволяет адресоваться в строке из данных бухучета
// к конкретному субконто по его номеру 
Перем НомерКт;

// номера субконто для счета РасчетыПоИсполнительнымДокументамРаботников, который обрабатывается специальным образом
Перем мНомерСубконтоКонтрагентыКт;
Перем мНомерСубконтоИсполнДокументыКт;

//Налоговый режим организации
Перем мУСН;
Перем мОбъектНалогообложенияУСН;
Перем мЕНВД;
Перем мФСС_БЛ;

Перем мДлинаСуток;

Перем мТаблицаОшибок;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Автозаполнение() Экспорт
	
	//vvv
	НачалоАвтозаполнения = ТекущаяДата();
	ЗаписьЖурналаРегистрации("ОтражениеВУчете.Автозаполнение",УровеньЖурналаРегистрации.Информация,Метаданные.Документы.ОтражениеЗарплатыВРеглУчете,Ссылка,"Начало автозаполнения "+НачалоАвтозаполнения);
	//
	//подготовим таблицу для регистрации ошибок
	мТаблицаОшибок = Новый ТаблицаЗначений;
	мТаблицаОшибок.Колонки.Добавить("Сотрудник");
	мТаблицаОшибок.Колонки.Добавить("ВидРасчета");
	мТаблицаОшибок.Колонки.Добавить("ПериодДействияНачало");
	мТаблицаОшибок.Колонки.Добавить("ПериодДействияКонец");
	мТаблицаОшибок.Колонки.Добавить("Сторно");
	мТаблицаОшибок.Колонки.Добавить("КодОшибки");
	мТаблицаОшибок.Колонки.Добавить("Регистратор");
	мТаблицаОшибок.Колонки.Добавить("НомерСтроки");
	
	
	НаборЗаписейОсновной = РегистрыРасчета.БУОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейОсновной.Отбор.Регистратор.Значение = Ссылка;
	
	НаборЗаписейДополнительный = РегистрыРасчета.БУДополнительныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейДополнительный.Отбор.Регистратор.Значение = Ссылка;
	
	// сначала очищаем соответствующие движения
 	Для Каждого Набор Из Движения Цикл
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУОсновныеНачисления") Тогда
			НаборЗаписейОсновной.Записать();
		КонецЕсли;
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУДополнительныеНачисления") Тогда
			НаборЗаписейДополнительный.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// определим налоговый режим
	БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету"), КонецМесяца(ПериодРегистрации), Организация);
	УчетнаяПолитика = глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету")[КонецМесяца(ПериодРегистрации)][Организация];
	мУСН = УчетнаяПолитика.УСН;
	мОбъектНалогообложенияУСН = УчетнаяПолитика.ОбъектНалогообложенияУСН;
	мЕНВД = УчетнаяПолитика.ОрганизацияЯвляетсяПлательщикомЕНВД;
	мФСС_БЛ = УчетнаяПолитика.УплачиватьДобровольныеВзносыВФСС;
    
	 //запрос по соответсвиям статей затрат начислений и статей затарт для 
	 //отражения б/л за счет работодателя
	ДополнительныеСтатьиЗатратЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат,
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатратНачисления,
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатрат
	|ИЗ
	|   РегистрСведений.СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете КАК СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете
	|ГДЕ
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат = &ПособияЗаСчетРаботодателя");
	
	ДополнительныеСтатьиЗатратЗапрос.УстановитьПараметр("ДатаЗапроса", ПериодРегистрации);
	ДополнительныеСтатьиЗатратЗапрос.УстановитьПараметр("ПособияЗаСчетРаботодателя", Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя);
	ДополнительныеСтатьиЗатрат = ДополнительныеСтатьиЗатратЗапрос.Выполнить().Выгрузить();
	
	ПараметрыПолученияСубконто = Новый Соответствие;
	ПараметрыПолученияСубконто[Тип("СправочникСсылка.СтатьиЗатрат")] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", 
									Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя, 
									ДополнительныеСтатьиЗатрат);
	//vvv добавим переопределение субконто для видов расчета
	ДополнительныеСтатьиЗатратЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат,
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатратНачисления,
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатрат
	|ИЗ
	|   РегистрСведений.СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете КАК СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете
	|ГДЕ
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций");
	
	ДополнительныеСтатьиЗатрат = ДополнительныеСтатьиЗатратЗапрос.Выполнить().Выгрузить();
	ПараметрыПолученияСубконто[Тип("СправочникСсылка.СтатьиЗатрат")] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", 
									, 
									ДополнительныеСтатьиЗатрат);
	//								
	
	
	ТаблицаНачислений = ПолучитьТаблицуНачислений();
	ПорядкиРасчета = ТаблицаНачислений.ВыгрузитьКолонку("ПорядокРасчета");

	
	СтруктураПоиска = Новый Структура;
	СписокНачисленийДляОтбора = Новый СписокЗначений;
	
	Успешно = Истина;
	
	ПорядокРасчета = Неопределено;
    Для Счетчик = 0 По ПорядкиРасчета.ВГраница() Цикл
		
		Если ПорядкиРасчета[Счетчик] = ПорядокРасчета Тогда
			Продолжить;
		КонецЕсли;
		
		ПорядокРасчета = ПорядкиРасчета[Счетчик];

		СписокНачисленийДляОтбора.Очистить();

		СтруктураПоиска.Вставить("ПорядокРасчета", ПорядокРасчета);
		
		//основные начисления
		СтруктураПоиска.Вставить("ВидНачисления", "Основные");
		СтрокиТаблицы = ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
		Для каждого Строка Из СтрокиТаблицы Цикл
			СписокНачисленийДляОтбора.Добавить(Строка.ВидРасчета);
		КонецЦикла;
		Если СписокНачисленийДляОтбора.Количество() > 0 Тогда
			//получим и обработаем данные учета
			ДанныеУчета = ПолучитьДанныеУчета(СписокНачисленийДляОтбора, Истина, ?(Счетчик = 0, Истина, Ложь));
			ОбработатьДанныеУчета(ДанныеУчета, Успешно, НаборЗаписейОсновной, ПараметрыПолученияСубконто);
		КонецЕсли;
			
		//дополнительные начисления
		СписокНачисленийДляОтбора.Очистить();
		СтруктураПоиска.Вставить("ВидНачисления", "Дополнительные");
		СтрокиТаблицы = ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
		Для каждого Строка Из СтрокиТаблицы Цикл
			СписокНачисленийДляОтбора.Добавить(Строка.ВидРасчета);
		КонецЦикла;
		Если СписокНачисленийДляОтбора.Количество() > 0 Тогда
			//получим и обработаем данные учета
			ДанныеУчета = ПолучитьДанныеУчета(СписокНачисленийДляОтбора, Ложь, ?(Счетчик = 0, Истина, Ложь));
			ОбработатьДанныеУчета(ДанныеУчета, Успешно, НаборЗаписейДополнительный, ПараметрыПолученияСубконто);
		КонецЕсли;
		
	КонецЦикла;	
	
	НаборЗаписейОсновной.Прочитать();
	
	ВременнаяТаблица = НаборЗаписейОсновной.Выгрузить();
	ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоДт4,СчетКт,СубконтоКт1,СубконтоКт2, СубконтоКт3,СубконтоКт4,
	|СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3,
	|ПериодДействияНачало,ПериодДействияКонец,Сторно,ДокументОснование,СчетДтНалогов,СубконтоДтНалогов1,СубконтоДтНалогов2,СубконтоДтНалогов3,СубконтоДтНалогов4,СчетДтСотрудника,СубконтоДтСотрудника1,СубконтоДтСотрудника2,СубконтоДтСотрудника3,СубконтоДтСотрудника4,ОтчисленияОтносятсяНаЗатратыСотрудника","Результат");
	ОсновныеНачисления.Загрузить(ВременнаяТаблица);
	
	НаборЗаписейДополнительный.Прочитать();
	
	ВременнаяТаблица = НаборЗаписейДополнительный.Выгрузить();
	ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоДт4,СчетКт,СубконтоКт1,СубконтоКт2, СубконтоКт3,СубконтоКт4,
	|СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3,Сторно,ДокументОснование,СчетДтСотрудника,СубконтоДтСотрудника1,СубконтоДтСотрудника2,СубконтоДтСотрудника3,СубконтоДтСотрудника4,ОтчисленияОтносятсяНаЗатратыСотрудника,ПериодДействияДоп","Результат");
	
	ДополнительныеНачисления.Загрузить(ВременнаяТаблица);
	
	// очистим движения
 	Для Каждого Набор Из Движения Цикл
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУОсновныеНачисления") 
			или ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУДополнительныеНачисления") Тогда
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Успешно Тогда
		// есть ошибки в сборе данных по отражению начислений
		
		ТекстСообщения = "Для автоматического учета начислений при формировании проводок не хватает данных!";
		РодительскаяСтрока = ОбщегоНазначения.КомментарийРасчета(ТекстСообщения);
		
		Если мТаблицаОшибок.Количество() > 0 Тогда
			// сообщим пользователю об ошибках
			// таблица ошибок собирается только по пособиям
			
			СтруктураПоискаОсновныеНачисиления = Новый Структура("Сотрудник,ВидРасчета,ПериодДействияНачало,ПериодДействияКонец,СчетДт");
			СтруктураПоискаДополнительныеНачисиления = Новый Структура("Сотрудник,ВидРасчета,СчетДт");
			
			мТаблицаОшибок.Сортировать("ВидРасчета");
			ТекущийВР = Неопределено;
			//ДоляЕНВДПоБазе = Неопределено;
			//ДоляРаботодателяПоБазе =  Неопределено;
			
			Для каждого СтрокаТаблицыОшибок Из мТаблицаОшибок Цикл
				ВР = СтрокаТаблицыОшибок.ВидРасчета;
				
				Если ЗначениеЗаполнено(СтрокаТаблицыОшибок.ПериодДействияНачало) Тогда
					СтруктураПоискаОсновныеНачисиления.Сотрудник  = СтрокаТаблицыОшибок.Сотрудник;	
					СтруктураПоискаОсновныеНачисиления.ВидРасчета = СтрокаТаблицыОшибок.ВидРасчета;
					СтруктураПоискаОсновныеНачисиления.ПериодДействияНачало = СтрокаТаблицыОшибок.ПериодДействияНачало;
					СтруктураПоискаОсновныеНачисиления.ПериодДействияКонец  = НачалоДня(СтрокаТаблицыОшибок.ПериодДействияКонец);
					СтруктураПоискаОсновныеНачисиления.СчетДт  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
					НайденныеСтроки = ОсновныеНачисления.НайтиСтроки(СтруктураПоискаОсновныеНачисиления);
					ТекстСообщения = "Основные начисления, ";
				Иначе
					СтруктураПоискаДополнительныеНачисиления.Сотрудник  = СтрокаТаблицыОшибок.Сотрудник;	
					СтруктураПоискаДополнительныеНачисиления.ВидРасчета = СтрокаТаблицыОшибок.ВидРасчета;
					СтруктураПоискаДополнительныеНачисиления.СчетДт  = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
					НайденныеСтроки = ДополнительныеНачисления.НайтиСтроки(СтруктураПоискаДополнительныеНачисиления);
					ТекстСообщения = "Дополнительные начисления, ";
				КонецЕсли;
				
				Для каждого СтрокаТЧ Из НайденныеСтроки Цикл
					ТекстСообщенияПоСтроке = ТекстСообщения + "строка номер: " + СтрокаТЧ.НомерСтроки;
					ОбщегоНазначения.КомментарийРасчета(ТекстСообщенияПоСтроке, РодительскаяСтрока);
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;	
		
		Возврат;
		
	КонецЕсли;
	
	//vvv
	ЗаписьЖурналаРегистрации("ОтражениеВУчете.Автозаполнение",УровеньЖурналаРегистрации.Информация,Метаданные.Документы.ОтражениеЗарплатыВРеглУчете,Ссылка,"Окончание автозаполнения "+Строка(ТекущаяДата())+".Затраченное время "+СервисныеПроцедурыИФункции.РазностьВремени(ТекущаяДата(),НачалоАвтозаполнения));
	//
	
	АвтозаполнениеПроводок();

КонецПроцедуры //  Автозаполнение

Процедура АвтозаполнениеПроводок() Экспорт
	
	//vvv
	НачалоАвтозаполненияПроводок = ТекущаяДата();
	ЗаписьЖурналаРегистрации("ОтражениеВУчете.АвтозаполнениеПроводок",УровеньЖурналаРегистрации.Информация,Метаданные.Документы.ОтражениеЗарплатыВРеглУчете,Ссылка,"Начало автозаполнения проводок "+НачалоАвтозаполненияПроводок);
	//
	ОтражениеВУчете.Очистить();
	
	Записать(); // запишем документ
	ВыборкаПоДоходам = СформироватьЗапросПоДоходам().Выбрать();
	
	// определим налоговый режим
	БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету"), КонецМесяца(ПериодРегистрации), Организация);
	УчетнаяПолитика = глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету")[КонецМесяца(ПериодРегистрации)][Организация];
	мОбъектНалогообложенияУСН = УчетнаяПолитика.ОбъектНалогообложенияУСН;
	мУСН = УчетнаяПолитика.УСН;
	
	// запишем движения по текущему состоянию табличной части с начислениями
	// как при проведении
	НаборЗаписейОсновной = РегистрыРасчета.БУОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейОсновной.Отбор.Регистратор.Значение = Ссылка;
	
	НаборЗаписейДополнительный = РегистрыРасчета.БУДополнительныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейДополнительный.Отбор.Регистратор.Значение = Ссылка;
	
	ПлохиеДанные = Ложь;
	
	Пока ВыборкаПоДоходам.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, ПлохиеДанные, Не мУСН);
		ДобавитьСтрокуВДвиженияПоДоходам(ВыборкаПоДоходам, НаборЗаписейОсновной, НаборЗаписейДополнительный);
	КонецЦикла;
	
	Если ПлохиеДанные Тогда
		//vvv
		ЗаписьЖурналаРегистрации("ОтражениеВУчете.АвтозаполнениеПроводок",УровеньЖурналаРегистрации.Ошибка,Метаданные.Документы.ОтражениеЗарплатыВРеглУчете,Ссылка,"Окончание автозаполнения проводок"+Строка(ТекущаяДата())+".Затраченное время "+СервисныеПроцедурыИФункции.РазностьВремени(ТекущаяДата(),НачалоАвтозаполненияПроводок));
		//
		Возврат;
	КонецЕсли;
	
	Для Каждого Набор Из Движения Цикл
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУОсновныеНачисления") Тогда
			НаборЗаписейОсновной.Записать();
		КонецЕсли;
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУДополнительныеНачисления") Тогда
			НаборЗаписейДополнительный.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	// фактически - создаем структуру промежуточной таблицы
	ПромежуточнаяТаблица = ОтражениеВУчете.Выгрузить();

	// готовим список счетов
	СчетаИсключения = Новый Массив();
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РезервыПредстоящихРасходов);
	
	ТекстСчетаИсключения =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаИсключения)";
	
	Запрос = Новый Запрос(ТекстСчетаИсключения);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	СчетаИсключения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// подготовим данные по РБП
	ТекстПредыдущихПериодов =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//vvv
	|	БУОсновныеНачисления.ФизЛицо КАК ФизЛицо,
	//
	|	БУОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|ГДЕ
	|	БУОсновныеНачисления.ПериодДействия = &парамПериод
	|	И БУОсновныеНачисления.ПериодРегистрации < &парамПериод
	|	И (НЕ БУОсновныеНачисления.СчетДт В (&СчетаИсключения))
	|	И БУОсновныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРегистрации";
	
	Запрос = Новый Запрос(ТекстПредыдущихПериодов);
	Запрос.УстановитьПараметр("парамПериод", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Запрос.УстановитьПараметр("Облагается", Перечисления.ДоходыФСС_НС.Облагается);
	
	ПериодыРегистрацииПредыдущихПериодов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПериодРегистрации");
	//vvv
	ТаблицаРезультата =  Запрос.Выполнить().Выгрузить();
	ПериодыРегистрацииПредыдущихПериодов = ТаблицаРезультата.ВыгрузитьКолонку("ПериодРегистрации");
	
	Если ПериодыРегистрацииПредыдущихПериодов.Количество() > 0 Тогда
		
		ТаблицаРезультата.Свернуть("Физлицо");
		МассивФизлиц = ТаблицаРезультата.ВыгрузитьКолонку("Физлицо");
		
	КонецЕсли;
	//
	НачалоПериодаОтраженияВУчете = НачалоГода(ПериодРегистрации);
	Для каждого Период Из ПериодыРегистрацииПредыдущихПериодов Цикл
	     НачалоПериодаОтраженияВУчете = Мин(НачалоГода(Период), НачалоПериодаОтраженияВУчете);
		 Прервать
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	// отражение исчисленного ЕСН
	//
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//	список периодов - первые даты месяцеы с начала года по "текущий" для запроса период

	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоПериодаОтраженияВУчете);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	// прибавим остальные месяцы
	Пока КонецМесяца < КонецМесяца(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
		ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	
	//vvv
	// запрос по соответствиям статей затрат начислений и удержаний с ФОТ
    // для подстановки статей затрат при формировании проводок по ЕСН, ПФР, ФСС и т.п.
    // (перечисление ВидыДополнительныхСтатейЗатрат)
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат,
    |   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатратНачисления,
    |   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатрат
    |ИЗ
    |   РегистрСведений.СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете КАК СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете
    |ГДЕ
    |   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат ССЫЛКА Перечисление.ВидыДополнительныхСтатейЗатрат";
    
    ДополнительныеСтатьиЗатрат = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПолученияСубконто = Новый Соответствие;
    ТипСтатьиЗатрат = Тип("СправочникСсылка.СтатьиЗатрат");
    ПараметрыПолученияСубконто[ТипСтатьиЗатрат] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", , ДополнительныеСтатьиЗатрат);
	ТипСтатьиКалькуляции = Тип("СправочникСсылка.СтатьиКалькуляции");
	ПараметрыПолученияСубконто[ТипСтатьиКалькуляции] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", , ДополнительныеСтатьиЗатрат);
	ТипСтатьиПрибыли = Тип("СправочникСсылка.СтатьиПрибыли");
	ПараметрыПолученияСубконто[ТипСтатьиПрибыли] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", , ДополнительныеСтатьиЗатрат);
	ТипНоменклатурныеГруппы = Тип("СправочникСсылка.НоменклатурныеГруппы");
	ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", , ДополнительныеСтатьиЗатрат);
	ТипСчет = Тип("ПланСчетовСсылка.Хозрасчетный");
	ПараметрыПолученияСубконто[ТипСчет] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", , ДополнительныеСтатьиЗатрат);
	ТипЭлементыЗатрат = Тип("ПеречислениеСсылка.ЭлементыЗатрат");
	ПараметрыПолученияСубконто[ТипЭлементыЗатрат] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", , ДополнительныеСтатьиЗатрат);
	//
	
	// ЕСНДоходы
	// Поля:
	//		ФизЛицо
	//		ПериодРегистрации
	//		КодДоходаЕСН
	//		Результат
	//		
	//	
	//	Описание:
	//	Данные отражения доходов в учете ЕСН - для учета льгот инвалидов

	ЕСНДоходыТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.ПериодРегистрации,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ДоходППС,
	|	СУММА(Доходы.БазаСтрах) КАК БазаСтрах,
	|	СУММА(Доходы.БазаФСЗН) КАК БазаФСЗН,
    |	СУММА(Доходы.БазаППС) КАК БазаППС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН КАК КодДоходаЕСН,
	|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало <= ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ КАК ПериодРегистрации,
	|		ЕСНОсновныеНачисления.ДоходППС КАК ДоходППС,
  	|		СУММА(ЕСНОсновныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНОсновныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНОсновныеНачисления.БазаППС) КАК БазаППС
   	|	ИЗ
	|		РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|	
	|	ГДЕ
	|		ЕСНОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация И
	|		ЕСНОсновныеНачисления.ПериодРегистрации >= &парамНачалоПериода И
	|		ЕСНОсновныеНачисления.ПериодРегистрации <= &парамПериод И
	|		(ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ИЛИ ЕСНОсновныеНачисления.ДоходППС = &Облагается)
	|      	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН,
	|		ЕСНОсновныеНачисления.ДоходППС,
   	|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало <= ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ
  	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации,
	|		ЕСНДополнительныеНачисления.ДоходППС КАК ДоходППС,
   	|		СУММА(ЕСНДополнительныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНДополнительныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНДополнительныеНачисления.БазаППС) КАК БазаППС

	|	ИЗ
	|		РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|	
	|	ГДЕ
	|		ЕСНДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация И
	|		ЕСНДополнительныеНачисления.ПериодРегистрации >= &парамНачалоПериода И
	|		ЕСНДополнительныеНачисления.ПериодРегистрации <= &парамПериод И
	|		(ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ИЛИ ЕСНДополнительныеНачисления.ДоходППС = &Облагается)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ДоходППС,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ДоходППС";
	
	//Запрос.Текст =  ЕСНДоходыТекст;
	//Запрос.УстановитьПараметр("парамОрганизация", Организация);
	//Запрос.УстановитьПараметр("парамНачалоПериода", НачалоМесяца(ПериодРегистрации));
	//Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));

	//Запрос.Выполнить().Выгрузить();
	
	//vvv
	ЕСНДоходыРБПТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.ПериодРегистрации,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ДоходППС,
	|	СУММА(Доходы.БазаСтрах) КАК БазаСтрах,
	|	СУММА(Доходы.БазаФСЗН) КАК БазаФСЗН,
    |	СУММА(Доходы.БазаППС) КАК БазаППС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН КАК КодДоходаЕСН,
	|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало <= ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ КАК ПериодРегистрации,
	|		ЕСНОсновныеНачисления.ДоходППС КАК ДоходППС,
  	|		СУММА(ЕСНОсновныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНОсновныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНОсновныеНачисления.БазаППС) КАК БазаППС
   	|	ИЗ
	|		РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|	
	|	ГДЕ
	|		ЕСНОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация И
	|		ЕСНОсновныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И ФизЛицо В (&МассивФизлиц) И 
	|		(ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ИЛИ ЕСНОсновныеНачисления.ДоходППС = &Облагается)
	|      	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН,
	|		ЕСНОсновныеНачисления.ДоходППС,
   	|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало <= ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ
  	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации,
	|		ЕСНДополнительныеНачисления.ДоходППС КАК ДоходППС,
   	|		СУММА(ЕСНДополнительныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНДополнительныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНДополнительныеНачисления.БазаППС) КАК БазаППС

	|	ИЗ
	|		РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|	
	|	ГДЕ
	|		ЕСНДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация И
	|		ЕСНДополнительныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И ФизЛицо В (&МассивФизлиц) И 
	|		(ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ИЛИ ЕСНДополнительныеНачисления.ДоходППС = &Облагается)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ДоходППС,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ДоходППС";
	//

	// БУДоходыПоВР
	//	Поля:
	//		ФизЛицо
	//		Приказ
	//		ВидРасчета
	//		ПериодРегистрации
	//		СчетДт
	//		СчетДтНУ
	//		СубконтоДт1
	//		СубконтоДт2
	//		СубконтоДт3
	//		Результат
	//	
	//	Описание:
	//	Данные отражения начислений в бухучете

	БУДоходыПоВРТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.СчетДт,
	|	Доходы.СубконтоДт1,
	|	Доходы.СубконтоДт2,
	|	Доходы.СубконтоДт3,
	//vvv
	|	Доходы.СубконтоДт4,
	|	Доходы.СчетДтНалогов,
	|	Доходы.СубконтоДтНалогов1,
	|	Доходы.СубконтоДтНалогов2,
	|	Доходы.СубконтоДтНалогов3,
	|	Доходы.СубконтоДтНалогов4,
	//
	|	Доходы.СчетДтНУ,
	|	Доходы.СубконтоДтНУ1,
	|	Доходы.СубконтоДтНУ2,
	|	Доходы.СубконтоДтНУ3,
	|	СУММА(Доходы.Результат) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		БУОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|		БУОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		ВЫБОР
	//vvv Здесь и везде ниже меняем "<=" на "=", т.к. если был пересчет за пред. месяцы, эти суммы сворачивались с текущими и не учитывались при отражении налогов, т.е.
	// налогов отражалось меньше, чем начислено.
	//|			КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|			КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|				ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ КАК ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &Счет97
	//vvv комментируем
	//|			ИНАЧЕ БУОсновныеНачисления.СчетДт
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ
	//
	|		КОНЕЦ КАК СчетДт,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &РБПНаОплатуТруда
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт1
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ
	//
	|		КОНЕЦ КАК СубконтоДт1,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА БУОсновныеНачисления.ФизЛицо
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт2
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ
	//
	|		КОНЕЦ КАК СубконтоДт2,
	//vvv
	//|		БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
	//vvv
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУОсновныеНачисления.СубконтоДт3 КОНЕЦ КАК СубконтоДт3,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУОсновныеНачисления.СубконтоДт4 КОНЕЦ КАК СубконтоДт4,
	|		БУОсновныеНачисления.СчетДтНалогов,
	|		БУОсновныеНачисления.СубконтоДтНалогов1,
	|		БУОсновныеНачисления.СубконтоДтНалогов2,
	|		БУОсновныеНачисления.СубконтоДтНалогов3,
	|		БУОсновныеНачисления.СубконтоДтНалогов4,
	//
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &СчетН97
	|			ИНАЧЕ БУОсновныеНачисления.СчетДтНУ
	|		КОНЕЦ КАК СчетДтНУ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &РБПНаОплатуТруда
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
	|		КОНЕЦ КАК СубконтоДтНУ1,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА БУОсновныеНачисления.ФизЛицо
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
	|		КОНЕЦ КАК СубконтоДтНУ2,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &ОтпускБудПериода
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
	|		КОНЕЦ КАК СубконтоДтНУ3,
	|		СУММА(БУОсновныеНачисления.Результат) КАК Результат
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|	ГДЕ
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУОсновныеНачисления.ПериодРегистрации >= &парамНачалоПериода
	|		И БУОсновныеНачисления.ПериодРегистрации <= &парамПериод
	|		И БУОсновныеНачисления.ВидРасчета.СпособРасчета <> &парамРасчетОтпуска
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		ВЫБОР
	//vvv
	//|			КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|			КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|				ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &Счет97
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СчетДт
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ
	//
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &РБПНаОплатуТруда
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт1
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ
	//
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА БУОсновныеНачисления.ФизЛицо
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт2
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ
	//
	|		КОНЕЦ,
	//vvv
	//|		БУОсновныеНачисления.СубконтоДт3,
	//vvv
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУОсновныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУОсновныеНачисления.СубконтоДт4 КОНЕЦ,
	|		БУОсновныеНачисления.СчетДтНалогов,
	|		БУОсновныеНачисления.СубконтоДтНалогов1,
	|		БУОсновныеНачисления.СубконтоДтНалогов2,
	|		БУОсновныеНачисления.СубконтоДтНалогов3,
	|		БУОсновныеНачисления.СубконтоДтНалогов4,
	//
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &СчетН97
	|			ИНАЧЕ БУОсновныеНачисления.СчетДтНУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &РБПНаОплатуТруда
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА БУОсновныеНачисления.ФизЛицо
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|				ТОГДА &ОтпускБудПериода
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	//vvv
	//|						КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|						КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|							ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|						ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &Счет97
	//vvv
	//|						ИНАЧЕ БУОсновныеНачисления.СчетДт
	|						ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ
	//
	|					КОНЕЦ
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СчетДт
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ
	//
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &РБПНаОплатуТруда
	//vvv
	//|						ИНАЧЕ БУОсновныеНачисления.СубконтоДт1
	|						ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ
	//
	|					КОНЕЦ
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт1
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ
	//
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА БУОсновныеНачисления.ФизЛицо
	//vvv
	//|						ИНАЧЕ БУОсновныеНачисления.СубконтоДт2
	|						ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ
	//
	|					КОНЕЦ
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт2
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ
	//
	|		КОНЕЦ,
	//vvv
	//|		БУОсновныеНачисления.СубконтоДт3,
	//vvv
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУОсновныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУОсновныеНачисления.СубконтоДт4 КОНЕЦ,
	|		БУОсновныеНачисления.СчетДтНалогов КАК СчетДтНалогов,
	|		БУОсновныеНачисления.СубконтоДтНалогов1,
	|		БУОсновныеНачисления.СубконтоДтНалогов2,
	|		БУОсновныеНачисления.СубконтоДтНалогов3,
	|		БУОсновныеНачисления.СубконтоДтНалогов4,
	//
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &СчетН97
	|						ИНАЧЕ БУОсновныеНачисления.СчетДтНУ
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СчетДтНУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &РБПНаОплатуТруда
	|						ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА БУОсновныеНачисления.ФизЛицо
	|						ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &ОтпускБудПериода
	|						ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
	|		КОНЕЦ,
	|		СУММА(БУОсновныеНачисления.Результат)
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|	ГДЕ
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И ВЫБОР
	|				КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|					ТОГДА БУОсновныеНачисления.ПериодРегистрации >= &парамНачалоПериода
	|							И БУОсновныеНачисления.ПериодРегистрации <= КОНЕЦПЕРИОДА(&парамНачалоПериода, МЕСЯЦ)
	|				ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало >= &парамНачалоПериода
	|						И БУОсновныеНачисления.ПериодДействияНачало <= КОНЕЦПЕРИОДА(&парамНачалоПериода, МЕСЯЦ)
	|			КОНЕЦ
	|		И БУОсновныеНачисления.ВидРасчета.СпособРасчета = &парамРасчетОтпуска
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	//vvv
	//|						КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|						КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|							ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|						ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &Счет97
	//vvv
	//|						ИНАЧЕ БУОсновныеНачисления.СчетДт
	|						ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ
	//
	|					КОНЕЦ
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СчетДт
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ
	//
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &РБПНаОплатуТруда
	//vvv
	//|						ИНАЧЕ БУОсновныеНачисления.СубконтоДт1
	|						ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ
	//
	|					КОНЕЦ
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт1
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ
	//
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА БУОсновныеНачисления.ФизЛицо
	//vvv
	//|						ИНАЧЕ БУОсновныеНачисления.СубконтоДт2
	|						ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ
	//
	|					КОНЕЦ
	//vvv
	//|			ИНАЧЕ БУОсновныеНачисления.СубконтоДт2
	|			ИНАЧЕ ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ
	//
	|		КОНЕЦ,
	//vvv
	//|		БУОсновныеНачисления.СубконтоДт3,
	//vvv
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУОсновныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУОсновныеНачисления.СубконтоДт4 КОНЕЦ,
	|		БУОсновныеНачисления.СчетДтНалогов,
	|		БУОсновныеНачисления.СубконтоДтНалогов1,
	|		БУОсновныеНачисления.СубконтоДтНалогов2,
	|		БУОсновныеНачисления.СубконтоДтНалогов3,
	|		БУОсновныеНачисления.СубконтоДтНалогов4,
	//
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &СчетН97
	|						ИНАЧЕ БУОсновныеНачисления.СчетДтНУ
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СчетДтНУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &РБПНаОплатуТруда
	|						ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА БУОсновныеНачисления.ФизЛицо
	|						ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	|						КОГДА БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации
	|							ТОГДА &ОтпускБудПериода
	|						ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	//vvv
	//|		БУДополнительныеНачисления.СчетДт,
	//|		БУДополнительныеНачисления.СубконтоДт1,
	//|		БУДополнительныеНачисления.СубконтоДт2,
	//|		БУДополнительныеНачисления.СубконтоДт3,
	//vvv
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СчетДтСотрудника ИНАЧЕ БУДополнительныеНачисления.СчетДт КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт1 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт2 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт4 КОНЕЦ,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	//
	|		БУДополнительныеНачисления.СчетДтНУ,
	|		БУДополнительныеНачисления.СубконтоДтНУ1,
	|		БУДополнительныеНачисления.СубконтоДтНУ2,
	|		БУДополнительныеНачисления.СубконтоДтНУ3,
	|		СУММА(БУДополнительныеНачисления.Результат)
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|	ГДЕ
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУДополнительныеНачисления.ПериодРегистрации >= &парамНачалоПериода
	|		И БУДополнительныеНачисления.ПериодРегистрации <= &парамПериод
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	//vvv
	//|		БУДополнительныеНачисления.СчетДт,
	//|		БУДополнительныеНачисления.СубконтоДт1,
	//|		БУДополнительныеНачисления.СубконтоДт2,
	//|		БУДополнительныеНачисления.СубконтоДт3,
	//vvv
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СчетДтСотрудника ИНАЧЕ БУДополнительныеНачисления.СчетДт КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт1 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт2 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт4 КОНЕЦ,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	//
	|		БУДополнительныеНачисления.СчетДтНУ,
	|		БУДополнительныеНачисления.СубконтоДтНУ1,
	|		БУДополнительныеНачисления.СубконтоДтНУ2,
	|		БУДополнительныеНачисления.СубконтоДтНУ3) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.СчетДт,
	|	Доходы.СчетДтНУ,
	|	Доходы.СубконтоДт1,
	|	Доходы.СубконтоДт2,
	|	Доходы.СубконтоДт3,
	//vvv
	|	Доходы.СубконтоДт4,
	|	Доходы.СчетДтНалогов,
	|	Доходы.СубконтоДтНалогов1,
	|	Доходы.СубконтоДтНалогов2,
	|	Доходы.СубконтоДтНалогов3,
	|	Доходы.СубконтоДтНалогов4,
	//
	|	Доходы.СубконтоДтНУ1,
	|	Доходы.СубконтоДтНУ2,
	|	Доходы.СубконтоДтНУ3";

    //vvv
	БУДоходыПоВРРБПТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ПериодДействия,
	|	Доходы.СчетДт,
	|	Доходы.СубконтоДт1,
	|	Доходы.СубконтоДт2,
	|	Доходы.СубконтоДт3,
	|	Доходы.СубконтоДт4,
	|	Доходы.СчетДтНалогов,
	|	Доходы.СубконтоДтНалогов1,
	|	Доходы.СубконтоДтНалогов2,
	|	Доходы.СубконтоДтНалогов3,
	|	Доходы.СубконтоДтНалогов4,
	|	Доходы.СчетДтНУ,
	|	Доходы.СубконтоДтНУ1,
	|	Доходы.СубконтоДтНУ2,
	|	Доходы.СубконтоДтНУ3,
	|	СУММА(Доходы.Результат) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		БУОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|		БУОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		БУОсновныеНачисления.ПериодРегистрации,
	|		БУОсновныеНачисления.ПериодДействия,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ КАК СчетДт,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ КАК СубконтоДт1,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ КАК СубконтоДт2,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУОсновныеНачисления.СубконтоДт3 КОНЕЦ КАК СубконтоДт3,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУОсновныеНачисления.СубконтоДт4 КОНЕЦ КАК СубконтоДт4,
	|		БУОсновныеНачисления.СчетДтНалогов,
	|		БУОсновныеНачисления.СубконтоДтНалогов1,
	|		БУОсновныеНачисления.СубконтоДтНалогов2,
	|		БУОсновныеНачисления.СубконтоДтНалогов3,
	|		БУОсновныеНачисления.СубконтоДтНалогов4,
	|		БУОсновныеНачисления.СчетДтНУ КАК СчетДтНУ,
	|		БУОсновныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
	|		БУОсновныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
	|		БУОсновныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
	|		СУММА(БУОсновныеНачисления.Результат) КАК Результат
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|	ГДЕ
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУОсновныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И БУОсновныеНачисления.Сотрудник.ФизЛицо В (&МассивФизлиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		БУОсновныеНачисления.ПериодРегистрации,
	|		БУОсновныеНачисления.ПериодДействия,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СчетДтСотрудника ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУОсновныеНачисления.СубконтоДт1 КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУОсновныеНачисления.СубконтоДт2 КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУОсновныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУОсновныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУОсновныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУОсновныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУОсновныеНачисления.СубконтоДт4 КОНЕЦ,
	|		БУОсновныеНачисления.СчетДтНалогов,
	|		БУОсновныеНачисления.СубконтоДтНалогов1,
	|		БУОсновныеНачисления.СубконтоДтНалогов2,
	|		БУОсновныеНачисления.СубконтоДтНалогов3,
	|		БУОсновныеНачисления.СубконтоДтНалогов4,
	|		БУОсновныеНачисления.СчетДтНУ,
	|		БУОсновныеНачисления.СубконтоДтНУ1,
	|		БУОсновныеНачисления.СубконтоДтНУ2,
	|		БУОсновныеНачисления.СубконтоДтНУ3
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СчетДтСотрудника ИНАЧЕ БУДополнительныеНачисления.СчетДт КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт1 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт2 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт4 КОНЕЦ,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		БУДополнительныеНачисления.СчетДтНУ,
	|		БУДополнительныеНачисления.СубконтоДтНУ1,
	|		БУДополнительныеНачисления.СубконтоДтНУ2,
	|		БУДополнительныеНачисления.СубконтоДтНУ3,
	|		СУММА(БУДополнительныеНачисления.Результат)
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|	ГДЕ
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУДополнительныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И БУДополнительныеНачисления.Сотрудник.ФизЛицо В (&МассивФизлиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СчетДтСотрудника ИНАЧЕ БУДополнительныеНачисления.СчетДт КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника1 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт1 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника2 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт2 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника3 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт3 КОНЕЦ,
	|		ВЫБОР КОГДА БУДополнительныеНачисления.ОтчисленияОтносятсяНаЗатратыСотрудника И БУДополнительныеНачисления.СчетДтСотрудника<>ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) ТОГДА БУДополнительныеНачисления.СубконтоДтСотрудника4 ИНАЧЕ БУДополнительныеНачисления.СубконтоДт4 КОНЕЦ,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		NULL,
	|		БУДополнительныеНачисления.СчетДтНУ,
	|		БУДополнительныеНачисления.СубконтоДтНУ1,
	|		БУДополнительныеНачисления.СубконтоДтНУ2,
	|		БУДополнительныеНачисления.СубконтоДтНУ3) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ПериодДействия,
	|	Доходы.СчетДт,
	|	Доходы.СчетДтНУ,
	|	Доходы.СубконтоДт1,
	|	Доходы.СубконтоДт2,
	|	Доходы.СубконтоДт3,
	|	Доходы.СубконтоДт4,
	|	Доходы.СчетДтНалогов,
	|	Доходы.СубконтоДтНалогов1,
	|	Доходы.СубконтоДтНалогов2,
	|	Доходы.СубконтоДтНалогов3,
	|	Доходы.СубконтоДтНалогов4,
	|	Доходы.СубконтоДтНУ1,
	|	Доходы.СубконтоДтНУ2,
	|	Доходы.СубконтоДтНУ3";
	//
	
	// ЕСНДоходыПоВР
	//	Поля:
	//		ФизЛицо
	//		Приказ
	//		ВидРасчета
	//		ПериодРегистрации
	//		КодДоходаЕСН
	//		Результат
	//
	// Описание:
	//	список доходов по кодам ЕСН в разрезе видов расчета
	//

	ЕСНДоходыПоВРТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	//vvv
	|	Доходы.ПериодДействия,
	//
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ДоходППС,
	|	СУММА(Доходы.БазаСтрах) КАК БазаСтрах,
	|	СУММА(Доходы.БазаФСЗН) КАК БазаФСЗН,
    |	СУММА(Доходы.БазаППС) КАК БазаППС
    |ИЗ
	|	(ВЫБРАТЬ
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		ЕСНОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН КАК КодДоходаЕСН,
	//vvv
	//|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало <= ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ КАК ПериодРегистрации,
	|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало = ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодДействияНачало,МЕСЯЦ) КАК ПериодДействия,
	//
	|		ЕСНОсновныеНачисления.ДоходППС КАК ДоходППС,
  	|		СУММА(ЕСНОсновныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНОсновныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНОсновныеНачисления.БазаППС) КАК БазаППС
	|	ИЗ
	|		РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|	
	|	ГДЕ
	|		ЕСНОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация И
	|		ЕСНОсновныеНачисления.ПериодРегистрации >= &парамНачалоПериода И
	|		ЕСНОсновныеНачисления.ПериодРегистрации <= &парамПериод И
	|		(ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж  ИЛИ ЕСНОсновныеНачисления.ДоходППС = &Облагается)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник,
	|		ЕСНОсновныеНачисления.ВидРасчета,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН,
	|		ЕСНОсновныеНачисления.ДоходППС,
	//vvv
	//|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало <= ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ
	|		ВЫБОР КОГДА ЕСНОсновныеНачисления.ПериодДействияНачало = ЕСНОсновныеНачисления.ПериодРегистрации ТОГДА ЕСНОсновныеНачисления.ПериодРегистрации ИНАЧЕ ЕСНОсновныеНачисления.ПериодДействияНачало КОНЕЦ,
	|		НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодДействияНачало,МЕСЯЦ)
	//
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.ВидРасчета,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации,
	//vvv
	|		НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.БазовыйПериодНачало,МЕСЯЦ),
	//
	|		ЕСНДополнительныеНачисления.ДоходППС КАК ДоходППС,
  	|		СУММА(ЕСНДополнительныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНДополнительныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНДополнительныеНачисления.БазаППС) КАК БазаППС

	|	ИЗ
	|		РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|	
	|	ГДЕ
	|		ЕСНДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация И
	|		ЕСНДополнительныеНачисления.ПериодРегистрации >= &парамНачалоПериода И
	|		ЕСНДополнительныеНачисления.ПериодРегистрации <= &парамПериод И
	|		(ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ИЛИ ЕСНДополнительныеНачисления.ДоходППС = &Облагается)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.ВидРасчета,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ДоходППС,
	//vvv
	|		НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.БазовыйПериодНачало,МЕСЯЦ),
	//
	|		ЕСНДополнительныеНачисления.ПериодРегистрации) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ДоходППС,
	//vvv
	|	Доходы.ПериодДействия,
	//
  	|	Доходы.ПериодРегистрации";

    //vvv
	ЕСНДоходыПоВРРБПТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ПериодДействия,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ДоходППС,
	|	СУММА(Доходы.БазаСтрах) КАК БазаСтрах,
	|	СУММА(Доходы.БазаФСЗН) КАК БазаФСЗН,
    |	СУММА(Доходы.БазаППС) КАК БазаППС
    |ИЗ
	|	(ВЫБРАТЬ
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		ЕСНОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН КАК КодДоходаЕСН,
	|		ЕСНОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|		ЕСНОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|		ЕСНОсновныеНачисления.ДоходППС КАК ДоходППС,
  	|		СУММА(ЕСНОсновныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНОсновныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНОсновныеНачисления.БазаППС) КАК БазаППС
	|	ИЗ
	|		РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|	
	|	ГДЕ
	|		ЕСНОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И ЕСНОсновныеНачисления.ПериодРегистрации В(&МассивПериодовРегистрации) И ЕСНОсновныеНачисления.ФизЛицо В (&МассивФизлиц) И
	|		(ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж  ИЛИ ЕСНОсновныеНачисления.ДоходППС = &Облагается)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНОсновныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНОсновныеНачисления.Сотрудник,
	|		ЕСНОсновныеНачисления.ВидРасчета,
	|		ЕСНОсновныеНачисления.КодДоходаЕСН,
	|		ЕСНОсновныеНачисления.ДоходППС,
	|		ЕСНОсновныеНачисления.ПериодРегистрации,
	|		ЕСНОсновныеНачисления.ПериодДействия
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.ВидРасчета,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации,
	|		ЕСНДополнительныеНачисления.ДоходППС КАК ДоходППС,
  	|		СУММА(ЕСНДополнительныеНачисления.БазаБелгосстрах) КАК БазаСтрах,
	|		СУММА(ЕСНДополнительныеНачисления.БазаФСЗН) КАК БазаФСЗН,
    |		СУММА(ЕСНДополнительныеНачисления.БазаППС) КАК БазаППС

	|	ИЗ
	|		РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|	
	|	ГДЕ
	|		ЕСНДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация 
	|		И ЕСНДополнительныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И ЕСНДополнительныеНачисления.ФизЛицо В (&МассивФизлиц) И  
	|		(ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуФСЗН ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуСтрах ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ИЛИ ЕСНДополнительныеНачисления.ДоходППС = &Облагается)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		ЕСНДополнительныеНачисления.Сотрудник,
	|		ЕСНДополнительныеНачисления.ВидРасчета,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.ДоходППС,
	|		ЕСНДополнительныеНачисления.ПериодРегистрации) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.ФизЛицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.КодДоходаЕСН,
	|	Доходы.ДоходППС,
  	|	Доходы.ПериодРегистрации,
	|	Доходы.ПериодДействия";
	//



	// ЕСНДоходыЗаГод
	//	Поля:
	//		ФизЛицо
	//		КодДоходаЕСН
	//		ПериодРегистрации
	//		Результат			- доход за период
	//		РезультатЗаГод		- доход за год нарастающим итогом
	//	Описание:
	//	соединение таблицы ЕСНДоходыЗаГод с самой собой для получения
	//	нарастающего итога
	//

	ЕСНДоходыЗаГодТекст = 
	"ВЫБРАТЬ
	|	ЕСНДоходыОсновная.ФизЛицо,
	|	ЕСНДоходыОсновная.КодДоходаЕСН,
	|	ЕСНДоходыОсновная.ПериодРегистрации,
	|	ЕСНДоходыОсновная.Результат,
	|	СУММА(ЕСНДоходыВспомогательная.Результат) КАК РезультатЗаГод
	|ИЗ
	|	("+ЕСНДоходыТекст +") КАК ЕСНДоходыОсновная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+ЕСНДоходыТекст +") КАК ЕСНДоходыВспомогательная
	|		ПО ЕСНДоходыВспомогательная.ПериодРегистрации <= ЕСНДоходыОсновная.ПериодРегистрации И ЕСНДоходыОсновная.ФизЛицо = ЕСНДоходыВспомогательная.ФизЛицо И ЕСНДоходыОсновная.Приказ = ЕСНДоходыВспомогательная.Приказ И ЕСНДоходыОсновная.КодДоходаЕСН = ЕСНДоходыВспомогательная.КодДоходаЕСН
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСНДоходыОсновная.ФизЛицо,
	|	ЕСНДоходыОсновная.КодДоходаЕСН,
	|	ЕСНДоходыОсновная.Результат,
	|	ЕСНДоходыОсновная.ПериодРегистрации";


	// БУДоходыСводПоВР
	//	Поля:
	//		ФизЛицо
	//		Приказ
	//		ВидРасчета
	//		ПериодРегистрации
	//		Результат
	//
	// Описание:
	//	доходы, отраженные в бухучете, сведенные по видам расчета
	//

	БУДоходыСводПоВРТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	СУММА(Доходы.Результат) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		БУОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|		БУОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		ВЫБОР
	//vvv
	//|			КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|			КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|				ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ КАК ПериодРегистрации,
	|		СУММА(БУОсновныеНачисления.Результат) КАК Результат
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|	ГДЕ
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУОсновныеНачисления.ПериодРегистрации >= &парамНачалоПериода
	|		И БУОсновныеНачисления.ПериодРегистрации <= &парамПериод
	|		И БУОсновныеНачисления.ВидРасчета.СпособРасчета <> &парамРасчетОтпуска
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		ВЫБОР
	//vvv
	//|			КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|			КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|				ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	//vvv
	//|						КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|						КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|							ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|						ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ,
	|		СУММА(БУОсновныеНачисления.Результат)
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|	ГДЕ
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И ВЫБОР
	|				КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|					ТОГДА БУОсновныеНачисления.ПериодРегистрации >= &парамНачалоПериода
	|							И БУОсновныеНачисления.ПериодРегистрации <= &парамПериод
	|				ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало >= &парамНачалоПериода
	|						И БУОсновныеНачисления.ПериодДействияНачало <= КОНЕЦПЕРИОДА(&парамНачалоПериода, МЕСЯЦ)
	|			КОНЕЦ
	|		И БУОсновныеНачисления.ВидРасчета.СпособРасчета = &парамРасчетОтпуска
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		ВЫБОР
	|			КОГДА &парамУчетОтпусковДляФСЗНвМесяцеНачисления
	|				ТОГДА ВЫБОР
	//vvv
	//|						КОГДА БУОсновныеНачисления.ПериодДействияНачало <= БУОсновныеНачисления.ПериодРегистрации
	|						КОГДА БУОсновныеНачисления.ПериодДействияНачало = БУОсновныеНачисления.ПериодРегистрации
	//
	|							ТОГДА БУОсновныеНачисления.ПериодРегистрации
	|						ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|					КОНЕЦ
	|			ИНАЧЕ БУОсновныеНачисления.ПериодДействияНачало
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		СУММА(БУДополнительныеНачисления.Результат)
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|	ГДЕ
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУДополнительныеНачисления.ПериодРегистрации >= &парамНачалоПериода
	|		И БУДополнительныеНачисления.ПериодРегистрации <= &парамПериод
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации";

    //vvv
	БУДоходыСводПоВРРБПТекст = 
	"ВЫБРАТЬ
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ПериодДействия,
	|	СУММА(Доходы.Результат) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		БУОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|		БУОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		БУОсновныеНачисления.ПериодРегистрации,
	|		БУОсновныеНачисления.ПериодДействия,
	|		СУММА(БУОсновныеНачисления.Результат) КАК Результат
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|	ГДЕ
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУОсновныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И БУОсновныеНачисления.Сотрудник.ФизЛицо В (&МассивФизлиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУОсновныеНачисления.Сотрудник.Физлицо,
	|		БУОсновныеНачисления.Сотрудник,
	|		БУОсновныеНачисления.ВидРасчета,
	|		БУОсновныеНачисления.ПериодРегистрации,
	|		БУОсновныеНачисления.ПериодДействия
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		БУДополнительныеНачисления.ПериодРегистрации,
	|		СУММА(БУДополнительныеНачисления.Результат)
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|	ГДЕ
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
	|		И БУДополнительныеНачисления.ПериодРегистрации В (&МассивПериодовРегистрации) И БУДополнительныеНачисления.Сотрудник.ФизЛицо В (&МассивФизлиц)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БУДополнительныеНачисления.Сотрудник.Физлицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.ВидРасчета,
	|		БУДополнительныеНачисления.ПериодРегистрации) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Сотрудник.Физлицо,
	|	Доходы.Сотрудник,
	|	Доходы.ВидРасчета,
	|	Доходы.ПериодРегистрации,
	|	Доходы.ПериодДействия";
	//
	//	ЕСНДоходыБУДоходы
	//	Поля:
	//		ФизЛицо
	//		Приказ
	//		ВидРасчета
	//		ПериодРегистрации
	//		КодДоходаЕСН
	//		СчетДт
	//		СчетДтНУ
	//		СубконтоДт1
	//		СубконтоДт2
	//		СубконтоДт3
	//		РезультатЕСН
	//		РезультатБУ
	//	Описание:
	//	соединение таблиц с доходами в разрезе кодов дохода ЕСН и в 
	//	разрезе отражения в бухучете
	//	сопоставление выполняется по видам расчета
	//

	ЕСНДоходыБУДоходыТекст = 
	"ВЫБРАТЬ
	|	ЕСНДоходыПоВР.Сотрудник.ФизЛицо,
	|	ЕСНДоходыПоВР.Сотрудник,
	|	ЕСНДоходыПоВР.ВидРасчета,
	|	ЕСНДоходыПоВР.ПериодРегистрации,
	//vvv
	|	ЕСНДоходыПоВР.ПериодДействия,
	//
	|	ЕСНДоходыПоВР.КодДоходаЕСН,
	|	ЕСНДоходыПоВР.ДоходППС,
	|	БУДоходыПоВР.СчетДт,
	|	БУДоходыПоВР.СубконтоДт1,
	|	БУДоходыПоВР.СубконтоДт2,
	|	БУДоходыПоВР.СубконтоДт3,	
	//vvv
	|	БУДоходыПоВР.СубконтоДт4,	
	|	БУДоходыПоВР.СчетДтНалогов,
	|	БУДоходыПоВР.СубконтоДтНалогов1,
	|	БУДоходыПоВР.СубконтоДтНалогов2,
	|	БУДоходыПоВР.СубконтоДтНалогов3,	
	|	БУДоходыПоВР.СубконтоДтНалогов4,
	//
	|	БУДоходыПоВР.СчетДтНУ,
	|	БУДоходыПоВР.СубконтоДтНУ1,
	|	БУДоходыПоВР.СубконтоДтНУ2,
	|	БУДоходыПоВР.СубконтоДтНУ3,	
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА ЕСНДоходыПоВР.БазаФСЗН < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ ЕСНДоходыПоВР.БазаФСЗН 
	|					  КОНЕЦ
	|		  ИНАЧЕ ЕСНДоходыПоВР.БазаФСЗН 
	|	КОНЕЦ КАК РезультатФСЗН,
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА ЕСНДоходыПоВР.БазаСтрах < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ ЕСНДоходыПоВР.БазаСтрах 
	|					  КОНЕЦ
	|		  ИНАЧЕ ЕСНДоходыПоВР.БазаСтрах 
	|	КОНЕЦ КАК РезультатСтрах,
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА ЕСНДоходыПоВР.БазаППС < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ ЕСНДоходыПоВР.БазаППС 
	|					  КОНЕЦ
	|		  ИНАЧЕ ЕСНДоходыПоВР.БазаППС 
	|	КОНЕЦ КАК РезультатППС,
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА БУДоходыПоВР.Результат < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ БУДоходыПоВР.Результат 
	|					  КОНЕЦ
	|		  ИНАЧЕ БУДоходыПоВР.Результат 
	|	КОНЕЦ КАК РезультатБУ
	|ИЗ
	|	("+ ЕСНДоходыПоВРТекст +") КАК ЕСНДоходыПоВР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+ БУДоходыПоВРТекст +") КАК БУДоходыПоВР
	|		ПО ЕСНДоходыПоВР.Сотрудник = БУДоходыПоВР.Сотрудник И ЕСНДоходыПоВР.ВидРасчета = БУДоходыПоВР.ВидРасчета И ЕСНДоходыПоВР.ПериодРегистрации = БУДоходыПоВР.ПериодРегистрации";

	//vvv
	ЕСНДоходыБУДоходыРБПТекст = 
	"ВЫБРАТЬ
	|	ЕСНДоходыПоВР.Сотрудник.ФизЛицо,
	|	ЕСНДоходыПоВР.Сотрудник,
	|	ЕСНДоходыПоВР.ВидРасчета,
	|	ЕСНДоходыПоВР.ПериодРегистрации,
	|	ЕСНДоходыПоВР.ПериодДействия,
	|	ЕСНДоходыПоВР.КодДоходаЕСН,
	|	ЕСНДоходыПоВР.ДоходППС,
	|	БУДоходыПоВР.СчетДт,
	|	БУДоходыПоВР.СубконтоДт1,
	|	БУДоходыПоВР.СубконтоДт2,
	|	БУДоходыПоВР.СубконтоДт3,	
	|	БУДоходыПоВР.СубконтоДт4,	
	|	БУДоходыПоВР.СчетДтНалогов,
	|	БУДоходыПоВР.СубконтоДтНалогов1,
	|	БУДоходыПоВР.СубконтоДтНалогов2,
	|	БУДоходыПоВР.СубконтоДтНалогов3,	
	|	БУДоходыПоВР.СубконтоДтНалогов4,
	|	БУДоходыПоВР.СчетДтНУ,
	|	БУДоходыПоВР.СубконтоДтНУ1,
	|	БУДоходыПоВР.СубконтоДтНУ2,
	|	БУДоходыПоВР.СубконтоДтНУ3,	
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА ЕСНДоходыПоВР.БазаФСЗН < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ ЕСНДоходыПоВР.БазаФСЗН 
	|					  КОНЕЦ
	|		  ИНАЧЕ ЕСНДоходыПоВР.БазаФСЗН 
	|	КОНЕЦ КАК РезультатФСЗН,
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА ЕСНДоходыПоВР.БазаСтрах < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ ЕСНДоходыПоВР.БазаСтрах 
	|					  КОНЕЦ
	|		  ИНАЧЕ ЕСНДоходыПоВР.БазаСтрах 
	|	КОНЕЦ КАК РезультатСтрах,
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА ЕСНДоходыПоВР.БазаППС < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ ЕСНДоходыПоВР.БазаППС 
	|					  КОНЕЦ
	|		  ИНАЧЕ ЕСНДоходыПоВР.БазаППС 
	|	КОНЕЦ КАК РезультатППС,
	|	ВЫБОР КОГДА &РасчетФСЗНотБПМ 
	|		  ТОГДА ВЫБОР КОГДА БУДоходыПоВР.Результат < &парамБПМ 
	|		  			  ТОГДА &парамБПМ 
	|					  ИНАЧЕ БУДоходыПоВР.Результат 
	|					  КОНЕЦ
	|		  ИНАЧЕ БУДоходыПоВР.Результат 
	|	КОНЕЦ КАК РезультатБУ
	|ИЗ
	|	("+ ЕСНДоходыПоВРРБПТекст +") КАК ЕСНДоходыПоВР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+ БУДоходыПоВРРБПТекст +") КАК БУДоходыПоВР
	|		ПО ЕСНДоходыПоВР.Сотрудник = БУДоходыПоВР.Сотрудник И ЕСНДоходыПоВР.ВидРасчета = БУДоходыПоВР.ВидРасчета И ЕСНДоходыПоВР.ПериодРегистрации = БУДоходыПоВР.ПериодРегистрации И ЕСНДоходыПоВР.ПериодДействия = БУДоходыПоВР.ПериодДействия";
	//
	
	// КоэффициентыОтраженияЕСН
	//	Поля:
	//		СчетДт
	//		СчетДтНУ
	//		СубконтоДт1
	//		СубконтоДт2
	//		СубконтоДт3
	//		БазаФСЗН
	//		БазаСтрах
	//		БазаЕдиныйПлатеж
	// Описание:
	// таблица коэффициентов отражения составных частей исчисленного ЕСН по счетам бухучета
	//

	КоэффициентыОтраженияЕСНТекст = 
	"ВЫБРАТЬ
	|	ЕСНДоходыБУДоходы.Сотрудник.ФизЛицо КАК ФизЛицо,
	//vvv
	|	ЕСНДоходыБУДоходы.ПериодДействия,
	//
	|	ЕСНДоходыБУДоходы.СчетДт,
	|	ЕСНДоходыБУДоходы.СубконтоДт1,
	|	ЕСНДоходыБУДоходы.СубконтоДт2,
	|	ЕСНДоходыБУДоходы.СубконтоДт3,	
	//vvv
	|	ЕСНДоходыБУДоходы.СубконтоДт4,
	|	ЕСНДоходыБУДоходы.СчетДтНалогов,
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов1,
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов2,
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов3,	
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов4,
	//
	|	ЕСНДоходыБУДоходы.СчетДтНУ,
	|	ЕСНДоходыБУДоходы.СубконтоДтНУ1,
	|	ЕСНДоходыБУДоходы.СубконтоДтНУ2,
	|	ЕСНДоходыБУДоходы.СубконтоДтНУ3,	
	|	ВЫБОР КОГДА НЕ(ЕСНДоходыБУДоходы.КодДоходаЕСН.ВходитВБазуФСЗН) ИЛИ БУДоходыСводПоВР.Результат = 0 ТОГДА 0 ИНАЧЕ ЕСНДоходыБУДоходы.РезультатФСЗН / БУДоходыСводПоВР.Результат * ЕСНДоходыБУДоходы.РезультатБУ КОНЕЦ КАК БазаФСЗН,
	|	ВЫБОР КОГДА НЕ(ЕСНДоходыБУДоходы.КодДоходаЕСН.ВходитВБазуСтрах) ИЛИ БУДоходыСводПоВР.Результат = 0 ТОГДА 0 ИНАЧЕ ЕСНДоходыБУДоходы.РезультатСтрах / БУДоходыСводПоВР.Результат * ЕСНДоходыБУДоходы.РезультатБУ КОНЕЦ КАК БазаСтрах,
	|	ВЫБОР КОГДА НЕ(ЕСНДоходыБУДоходы.ДоходППС = &Облагается) ИЛИ БУДоходыСводПоВР.Результат = 0 ТОГДА 0 ИНАЧЕ ЕСНДоходыБУДоходы.РезультатППС / БУДоходыСводПоВР.Результат * ЕСНДоходыБУДоходы.РезультатБУ КОНЕЦ КАК БазаППС
	|ИЗ
	|	("+ ЕСНДоходыБУДоходыТекст +") КАК ЕСНДоходыБУДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ БУДоходыСводПоВРТекст +") КАК БУДоходыСводПоВР
	|		ПО ЕСНДоходыБУДоходы.Сотрудник = БУДоходыСводПоВР.Сотрудник И ЕСНДоходыБУДоходы.ВидРасчета = БУДоходыСводПоВР.ВидРасчета И ЕСНДоходыБУДоходы.ПериодРегистрации = БУДоходыСводПоВР.ПериодРегистрации";

	//vvv
	КоэффициентыОтраженияЕСНРБПТекст = 
	"ВЫБРАТЬ
	|	ЕСНДоходыБУДоходы.Сотрудник.ФизЛицо КАК ФизЛицо,
	|	ЕСНДоходыБУДоходы.ПериодДействия,
	|	ЕСНДоходыБУДоходы.ПериодРегистрации,
	|	ЕСНДоходыБУДоходы.СчетДт,
	|	ЕСНДоходыБУДоходы.СубконтоДт1,
	|	ЕСНДоходыБУДоходы.СубконтоДт2,
	|	ЕСНДоходыБУДоходы.СубконтоДт3,	
	//vvv
	|	ЕСНДоходыБУДоходы.СубконтоДт4,
	|	ЕСНДоходыБУДоходы.СчетДтНалогов,
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов1,
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов2,
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов3,	
	|	ЕСНДоходыБУДоходы.СубконтоДтНалогов4,
	//
	|	ЕСНДоходыБУДоходы.СчетДтНУ,
	|	ЕСНДоходыБУДоходы.СубконтоДтНУ1,
	|	ЕСНДоходыБУДоходы.СубконтоДтНУ2,
	|	ЕСНДоходыБУДоходы.СубконтоДтНУ3,	
	|	ВЫБОР КОГДА НЕ(ЕСНДоходыБУДоходы.КодДоходаЕСН.ВходитВБазуФСЗН) ИЛИ БУДоходыСводПоВР.Результат = 0 ТОГДА 0 ИНАЧЕ ЕСНДоходыБУДоходы.РезультатФСЗН / БУДоходыСводПоВР.Результат * ЕСНДоходыБУДоходы.РезультатБУ КОНЕЦ КАК БазаФСЗН,
	|	ВЫБОР КОГДА НЕ(ЕСНДоходыБУДоходы.КодДоходаЕСН.ВходитВБазуСтрах) ИЛИ БУДоходыСводПоВР.Результат = 0 ТОГДА 0 ИНАЧЕ ЕСНДоходыБУДоходы.РезультатСтрах / БУДоходыСводПоВР.Результат * ЕСНДоходыБУДоходы.РезультатБУ КОНЕЦ КАК БазаСтрах,
	|	ВЫБОР КОГДА НЕ(ЕСНДоходыБУДоходы.ДоходППС = &Облагается) ИЛИ БУДоходыСводПоВР.Результат = 0 ТОГДА 0 ИНАЧЕ ЕСНДоходыБУДоходы.РезультатППС / БУДоходыСводПоВР.Результат * ЕСНДоходыБУДоходы.РезультатБУ КОНЕЦ КАК БазаППС
	|ИЗ
	|	("+ ЕСНДоходыБУДоходыРБПТекст +") КАК ЕСНДоходыБУДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ БУДоходыСводПоВРРБПТекст +") КАК БУДоходыСводПоВР
	|		ПО ЕСНДоходыБУДоходы.Сотрудник = БУДоходыСводПоВР.Сотрудник И ЕСНДоходыБУДоходы.ВидРасчета = БУДоходыСводПоВР.ВидРасчета И ЕСНДоходыБУДоходы.ПериодРегистрации = БУДоходыСводПоВР.ПериодРегистрации И ЕСНДоходыБУДоходы.ПериодДействия = БУДоходыСводПоВР.ПериодДействия";
	//
	
	// ЕСНИсчисленный
	//	Поля:
	//		ФСЗН
	//		Страх
	//		ЕдиныйПлатеж
	//		ПенсионныйФонд
	// Описание:
	// просуммированный исчисленный ЕСН
	//

	ЕСНИсчисленныйТекст = 
	"ВЫБРАТЬ
	|	Исчисленный.ФизЛицо,
	|	Исчисленный.ПериодВзаиморасчетов,
	|	СУММА(Исчисленный.ФСЗН) КАК ФСЗН,
	|	СУММА(Исчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
	|	СУММА(Исчисленный.ППС) КАК ППС,
	|	СУММА(Исчисленный.Страх) КАК Страх
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
	//vvv
	|		ЕСНИсчисленный.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	//
	|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
	|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
	|		СУММА(ЕСНИсчисленный.ППС) КАК ППС,
	|		СУММА(ЕСНИсчисленный.ОбязательноеСтрахование) КАК Страх
	|	ИЗ
	|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	|	ГДЕ
	|		ЕСНИсчисленный.Период >= &парамНачалоПериода
	|		И ЕСНИсчисленный.Период < &парамКонецПериода
	|		И ЕСНИсчисленный.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЕСНИсчисленный.ФизЛицо,
	|		ЕСНИсчисленный.ПериодВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БелгосстрахИсчисленный.Сотрудник.Физлицо,
	//vvv
	|		БелгосстрахИсчисленный.ПериодВзаиморасчетов,
	//
	|		NULL,
	|		NULL,
	|		NULL,
	|		СУММА(БелгосстрахИсчисленный.Белгосстрах)
	|	ИЗ
	|		РегистрНакопления.БелгосстрахИсчисленный КАК БелгосстрахИсчисленный
	|	ГДЕ
	|		БелгосстрахИсчисленный.Период >= &парамНачалоПериода
	|		И БелгосстрахИсчисленный.Период <= &парамКонецПериода
	|		И БелгосстрахИсчисленный.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	//vvv
	|		БелгосстрахИсчисленный.ПериодВзаиморасчетов,
	//
	|		БелгосстрахИсчисленный.Сотрудник.Физлицо) КАК Исчисленный
	|
	|СГРУППИРОВАТЬ ПО
	//vvv
	|	Исчисленный.ПериодВзаиморасчетов,
	//
	|	Исчисленный.ФизЛицо";


	ОтраженоЕСНИсчисленногоТекст = 
	"ВЫБРАТЬ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3,
	//vvv
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт4,
	//
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДтНУ,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДтНУ1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДтНУ2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДтНУ3,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт1,
	|	СУММА(-(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма)) КАК Сумма,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКтНУ,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКтНУ1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКтНУ2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКтНУ3
	|ИЗ
	|	Документ.ОтражениеЗарплатыВРеглУчете.ОтражениеВУчете КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
	|
	|ГДЕ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации >= &парамНачалоПериода И
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.ПериодРегистрации < &парамНачалоПериода И
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Организация = &парамОрганизация И
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт В ИЕРАРХИИ(&парамСписокСчетовКт) И
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт1 = &парамСубконтоКт1 И
	|	(ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3,
	//vvv
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт4,
	//
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКт1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДтНУ,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДтНУ1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДтНУ2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДтНУ3,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКтНУ,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКтНУ1,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКтНУ2,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоКтНУ3";	
	
	Запрос = Новый Запрос(ОтраженоЕСНИсчисленногоТекст);
	
	//Выберем счета из регисьра сведений СтавкиОтчисленийСФОТиЗП
	
	СписокСчетовУчетаЕСН = Новый СписокЗначений;
	СписокСчетовУчетаЕСН.Добавить(РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)).СчетБУ);

	СписокСчетовУчетаЕСН.Добавить(РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж)).СчетБУ);

	СписокСчетовУчетаЕСН.Добавить(РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)).СчетБУ);

	СписокСчетовУчетаЕСН.Добавить(РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).СчетБУ);
	
	Запрос.УстановитьПараметр("парамСписокСчетовКт", СписокСчетовУчетаЕСН);
	//vvv
	//Запрос.УстановитьПараметр("парамСубконтоКт1", Перечисления.ВидыПлатежейВГосБюджет.Налог);
	Запрос.УстановитьПараметр("парамСубконтоКт1", Перечисления.ВидыПлатежейВФонды.ПенсФонд1Проц);
	//
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамНачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("Облагается", Перечисления.ДоходыФСС_НС.Облагается);
	
	ОтраженоРанееВНалоговомПериоде = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаИсточник Из ОтраженоРанееВНалоговомПериоде Цикл
		СтрокаПриемник = ПромежуточнаяТаблица.Добавить();
		Для каждого Колонка Из ОтраженоРанееВНалоговомПериоде.Колонки Цикл
			СтрокаПриемник[Колонка.Имя] = СтрокаИсточник[Колонка.Имя];	
		КонецЦикла; 
	КонецЦикла; 
	
	Запрос = Новый Запрос(КоэффициентыОтраженияЕСНТекст);
	//Запрос = Новый Запрос(БУДоходыСводПоВРТекст);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("РасчетФСЗНотБПМ", РасчетФСЗНотБПМ);
	Запрос.УстановитьПараметр("парамБПМ", РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,
								Новый Структура("Видпараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.БПМ)).Размер);
	Запрос.УстановитьПараметр("парамНачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериод", НачалоМесяца(ПериодРегистрации));

	Запрос.УстановитьПараметр("Счет97", ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
 	Запрос.УстановитьПараметр("СчетН97", ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов);
	//vvv
	//Запрос.УстановитьПараметр("РБПНаОплатуТруда", Справочники.РасходыБудущихПериодов.РБПНаОплатуТруда);
	Запрос.УстановитьПараметр("РБПНаОплатуТруда", Перечисления.ЭлементыЗатрат.ОплатаТруда);
	//
	Запрос.УстановитьПараметр("ОтпускБудПериода", Перечисления.ВидыНачисленийОплатыТрудаПоСт255НК.ОплатаОтпускаБуд);
	Запрос.УстановитьПараметр("Облагается", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамРасчетОтпуска",Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням);
	Запрос.УстановитьПараметр("парамУчетОтпусковДляФСЗНвМесяцеНачисления",глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].УчетОтпусковДляФСЗНвМесяцеНачисления);

	

	ОтражениеВБУТаблица = Запрос.Выполнить().Выгрузить();
	
	//vvv
	Запрос = Новый Запрос(КоэффициентыОтраженияЕСНРБПТекст);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("РасчетФСЗНотБПМ", РасчетФСЗНотБПМ);
	Запрос.УстановитьПараметр("парамБПМ", РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,
								Новый Структура("Видпараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.БПМ)).Размер);
	Запрос.УстановитьПараметр("парамНачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериод", НачалоМесяца(ПериодРегистрации));

	Запрос.УстановитьПараметр("Счет97", ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
 	Запрос.УстановитьПараметр("СчетН97", ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов);
	Запрос.УстановитьПараметр("РБПНаОплатуТруда", Перечисления.ЭлементыЗатрат.ОплатаТруда);
	Запрос.УстановитьПараметр("ОтпускБудПериода", Перечисления.ВидыНачисленийОплатыТрудаПоСт255НК.ОплатаОтпускаБуд);
	Запрос.УстановитьПараметр("Облагается", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамРасчетОтпуска",Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням);
	Запрос.УстановитьПараметр("парамУчетОтпусковДляФСЗНвМесяцеНачисления",глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].УчетОтпусковДляФСЗНвМесяцеНачисления);
	Запрос.УстановитьПараметр("МассивПериодовРегистрации",ПериодыРегистрацииПредыдущихПериодов);
	Запрос.УстановитьПараметр("МассивФизЛиц",МассивФизЛиц);
	
	ОтражениеВБУРБПТаблица = Запрос.Выполнить().Выгрузить();	
	//
	Запрос = Новый Запрос(ЕСНИсчисленныйТекст);

	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("парамМуж", Перечисления.ПолФизическихЛиц.Мужской);

	// для заполнения данных по ЕСН нужно получить максимальные ставки ЕСН
	// и передать их в качестве параметров в запрос ЕСНИсчисленный
	Запрос.УстановитьПараметр("СтавкаФСЗН", РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)).Размер);
	Запрос.УстановитьПараметр("СтавкаЕдиныйПлатеж", РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж)).Размер);
	Запрос.УстановитьПараметр("СтавкаПенсионныйФонд", РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)).Размер);
	Запрос.УстановитьПараметр("СтавкаСтрах", РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).Ставка);
											
	СтатьяЗатратФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)).СтатьяЗатрат;
	СтатьяЗатратСтрах = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).СтатьяЗатрат;
	СтатьяЗатратППС = РегистрыСведений.ТарифыВзносовНаППС.ПолучитьПоследнее(ПериодРегистрации).СтатьяЗатрат;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отбор = Новый Структура("ФизЛицо");
	//vvv
	Отбор = Новый Структура("ФизЛицо,ПериодДействия");
	//

	Пока Выборка.Следующий() Цикл

		//vvv
		//СубконтоКредита = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СубконтоКредита = Перечисления.ВидыПлатежейВФонды.Соцстрах;
		//
		
		Отбор.ФизЛицо = Выборка.ФизЛицо;
		//vvv
		Отбор.ПериодДействия = Выборка.ПериодВзаиморасчетов;
		//
		СтрокиОтраженияПоФизЛицу = ОтражениеВБУТаблица.НайтиСтроки(Отбор);
		
		// Страх
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаСтрах");
		РезультатыСтрах = ОбщегоНазначения.РаспределитьПропорционально(Выборка.Страх, Коэффициенты);

		// ФОМС
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаФСЗН");
		//vvv
		//РезультатыФСЗН = ОбщегоНазначения.РаспределитьПропорционально(Выборка.ФСЗН, Коэффициенты,0);   
		РезультатыФСЗН = ОбщегоНазначения.РаспределитьПропорционально(Выборка.ФСЗН, Коэффициенты,?(ПериодРегистрации<ОбщегоНазначения.ПолучитьДатуДеноминации(),0,2));
		//
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаФСЗН");
		РезультатыПФ = ОбщегоНазначения.РаспределитьПропорционально(Выборка.ПенсионныйФонд, Коэффициенты);

		// ПФР
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаППС");
		РезультатыППС = ОбщегоНазначения.РаспределитьПропорционально(Выборка.ППС, Коэффициенты);
        
		Индекс = 0;
		Для Каждого СтрокаОтражения Из СтрокиОтраженияПоФизЛицу Цикл

			//vvv
			ПараметрыПолученияСубконто[ТипСтатьиЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиКалькуляции].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиПрибыли].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСчет].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипЭлементыЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			//
			Если РезультатыФСЗН <> Неопределено Тогда
				Строка = ПромежуточнаяТаблица.Добавить();
				Строка.СчетДт			= СтрокаОтражения.СчетДт;
				//vvv
				Строка.СчетДт			= ПолучитьСубконто(СтрокаОтражения.СчетДт,ПараметрыПолученияСубконто);
				Строка.ФизЛицо			= Выборка.ФизЛицо;
				Если Строка.СчетДт=ПланыСчетов.Хозрасчетный.РезервыПредстоящихРасходов Тогда
					Строка.СчетДт			= СтрокаОтражения.СчетДтНалогов;
					Если ЗначениеЗаполнено(СтатьяЗатратФСЗН) Тогда 
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт1		= СтатьяЗатратФСЗН;
						Иначе
							Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов1,ПараметрыПолученияСубконто);
						КонецЕсли;
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт2		= СтатьяЗатратФСЗН;
						Иначе
							Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов2,ПараметрыПолученияСубконто);
						КонецЕсли;
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт3		= СтатьяЗатратФСЗН;
						Иначе
							Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов3,ПараметрыПолученияСубконто);
						КонецЕсли;					
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт4		= СтатьяЗатратФСЗН;
						Иначе
							Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов4,ПараметрыПолученияСубконто);
						КонецЕсли;										
						
					Иначе
						Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов1,ПараметрыПолученияСубконто);
						Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов2,ПараметрыПолученияСубконто);
						Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов3,ПараметрыПолученияСубконто);				
						Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов4,ПараметрыПолученияСубконто);				
					КонецЕсли;
				Иначе
				//	
				Если ЗначениеЗаполнено(СтатьяЗатратФСЗН) Тогда 
					Если ТипЗнч(СтрокаОтражения.СубконтоДт1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт1		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДт1		= СтрокаОтражения.СубконтоДт1;
						//vvv
						Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт2		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДт2		= СтрокаОтражения.СубконтоДт2;
						//vvv
						Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт3		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДт3		= СтрокаОтражения.СубконтоДт3;
						//vvv
						Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);
						//
					КонецЕсли;					
					//vvv
					Если ТипЗнч(СтрокаОтражения.СубконтоДт4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт4		= СтатьяЗатратФСЗН;
					Иначе						
						Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);						
					КонецЕсли;
					//
					
					Строка.СчетДтНУ			= СтрокаОтражения.СчетДтНУ;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ1		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДтНУ1		=СтрокаОтражения.СубконтоДтНУ1;
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ2		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДтНУ2		= СтрокаОтражения.СубконтоДтНУ2;
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ3		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДтНУ3		= СтрокаОтражения.СубконтоДтНУ3;
					КонецЕсли;
						
				Иначе
					Строка.СубконтоДт1		= СтрокаОтражения.СубконтоДт1;
					Строка.СубконтоДт2		= СтрокаОтражения.СубконтоДт2;
					Строка.СубконтоДт3		= СтрокаОтражения.СубконтоДт3;				
					//vvv
					Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
					Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
					Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);					
					Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);					
					//
					
					Строка.СчетДтНУ			= СтрокаОтражения.СчетДтНУ;
					Строка.СубконтоДтНУ1	= СтрокаОтражения.СубконтоДтНУ1;
					Строка.СубконтоДтНУ2	= СтрокаОтражения.СубконтоДтНУ2;
					Строка.СубконтоДтНУ3	= СтрокаОтражения.СубконтоДтНУ3;
				КонецЕсли;
				//vvv
				КонецЕсли;
				
				Строка.СчетКт = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("ВидОтчисления",
																							Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)).СчетБУ;
				Строка.СубконтоКт1 = СубконтоКредита;
				Строка.СчетКтНУ	= РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("ВидОтчисления",
																							Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)).СчетНУ;
				
				Строка.Сумма = РезультатыФСЗН[Индекс];
				//vvv
				Строка.ПериодРБПНалогов = Выборка.ПериодВзаиморасчетов;
				//
			КонецЕсли;
			
			//vvv
			ПараметрыПолученияСубконто[ТипСтатьиЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипСтатьиКалькуляции].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипСтатьиПрибыли].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипСчет].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипЭлементыЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			//
			Если РезультатыСтрах <> Неопределено Тогда
				Строка = ПромежуточнаяТаблица.Добавить();
				Строка.СчетДт			= СтрокаОтражения.СчетДт;
				//vvv
				Строка.СчетДт			= ПолучитьСубконто(СтрокаОтражения.СчетДт,ПараметрыПолученияСубконто);
				Строка.ФизЛицо			= Выборка.ФизЛицо;
				Если Строка.СчетДт=ПланыСчетов.Хозрасчетный.РезервыПредстоящихРасходов Тогда
					Строка.СчетДт			= СтрокаОтражения.СчетДтНалогов;
					Если ЗначениеЗаполнено(СтатьяЗатратСтрах) Тогда 
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт1		= СтатьяЗатратСтрах;
						Иначе
							Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов1,ПараметрыПолученияСубконто);
						КонецЕсли;
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт2		= СтатьяЗатратСтрах;
						Иначе
							Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов2,ПараметрыПолученияСубконто);
						КонецЕсли;
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт3		= СтатьяЗатратСтрах;
						Иначе
							Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов3,ПараметрыПолученияСубконто);
						КонецЕсли;
						Если ТипЗнч(СтрокаОтражения.СубконтоДтНалогов4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
							Строка.СубконтоДт4		= СтатьяЗатратСтрах;
						Иначе
							Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДтНалогов4,ПараметрыПолученияСубконто);
						КонецЕсли;									
							
					Иначе
						Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
						Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
						Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);				
						Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);									
					КонецЕсли;
				Иначе
				//
				Если ЗначениеЗаполнено(СтатьяЗатратСтрах) Тогда 
					Если ТипЗнч(СтрокаОтражения.СубконтоДт1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт1		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДт1		= СтрокаОтражения.СубконтоДт1;
						//vvv
						Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт2		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДт2		= СтрокаОтражения.СубконтоДт2;
						//vvv
						Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт3		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДт3		= СтрокаОтражения.СубконтоДт3;
						//vvv
						Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					//vvv
					Если ТипЗнч(СтрокаОтражения.СубконтоДт4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт4		= СтатьяЗатратСтрах;
					Иначе						
						Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);						
					КонецЕсли;
					//
										
					Строка.СчетДтНУ			=СтрокаОтражения.СчетДтНУ;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ1		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДтНУ1		= СтрокаОтражения.СубконтоДтНУ1;
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ2		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДтНУ2		= СтрокаОтражения.СубконтоДтНУ2;
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ3		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДтНУ3		= СтрокаОтражения.СубконтоДтНУ3;
					КонецЕсли;
						
				Иначе
					Строка.СубконтоДт1		= СтрокаОтражения.СубконтоДт1;
					Строка.СубконтоДт2		= СтрокаОтражения.СубконтоДт2;
					Строка.СубконтоДт3		= СтрокаОтражения.СубконтоДт3;				
					//vvv
					Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
					Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
					Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);
					Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);
					//
					
					Строка.СчетДтНУ			= СтрокаОтражения.СчетДтНУ;
					Строка.СубконтоДтНУ1	= СтрокаОтражения.СубконтоДтНУ1;
					Строка.СубконтоДтНУ2	= СтрокаОтражения.СубконтоДтНУ2;
					Строка.СубконтоДтНУ3	= СтрокаОтражения.СубконтоДтНУ3;
				КонецЕсли;
				//vvv
				КонецЕсли;
				//								
				// ОбязательноеСтрахование
				КоррСчет				=  РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).СчетБУ;
											
				Строка.СчетКт			=  КоррСчет;
											
				Субконто    = Новый Массив(3);
				Для тт=0 по 2 цикл
					Субконто[тт] = Неопределено;
				КонецЦикла;
				
				Для тт=0 по КоррСчет.ВидыСубконто.Количество()-1 Цикл
					Если НЕ Коррсчет.ВидыСубконто[тт].ВидСубконто = Неопределено тогда
						Если Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет")) Тогда
							Субконто[тт] = Перечисления.ВидыПлатежейВГосБюджет.Налог;

						ИначеЕсли Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
							Субконто[тт] = Организация;

						ИначеЕсли Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
							Субконто[тт] =РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).Контрагент;

						ИначеЕсли Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
							Субконто[тт] = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).Договор;

						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
				
				Строка.СубконтоКт1		= Субконто[0];
				Строка.СубконтоКт2		= Субконто[1];
				Строка.СубконтоКт3		= Субконто[2];
				
				Строка.СчетКтНУ			=  РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).СчетНУ;

				Строка.Сумма			= РезультатыСтрах[Индекс];
				//vvv
				Строка.ПериодРБПНалогов = Выборка.ПериодВзаиморасчетов;
				//
			КонецЕсли;
			
			//vvv
			ПараметрыПолученияСубконто[ТипСтатьиЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиКалькуляции].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиПрибыли].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСчет].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипЭлементыЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			//
			Если РезультатыППС <> Неопределено Тогда
				Строка = ПромежуточнаяТаблица.Добавить();
				Строка.СчетДт			= СтрокаОтражения.СчетДт;
				//vvv
				Строка.СчетДт			= ПолучитьСубконто(СтрокаОтражения.СчетДт,ПараметрыПолученияСубконто);
				Строка.ФизЛицо			= Выборка.ФизЛицо;
				//
				Если ЗначениеЗаполнено(СтатьяЗатратППС) Тогда 
					Если ТипЗнч(СтрокаОтражения.СубконтоДт1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт1		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДт1		= СтрокаОтражения.СубконтоДт1;
						//vvv
						Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт2		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДт2		= СтрокаОтражения.СубконтоДт2;
						//vvv
						Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт3		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДт3		= СтрокаОтражения.СубконтоДт3;
						//vvv
						Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					//vvv
					Если ТипЗнч(СтрокаОтражения.СубконтоДт4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт4		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДт4		= СтрокаОтражения.СубконтоДт4;
						//vvv
						Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);
						//
					КонецЕсли;
					//
										
					Строка.СчетДтНУ			= СтрокаОтражения.СчетДтНУ;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ1		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДтНУ1		= СтрокаОтражения.СубконтоДтНУ1;
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ2		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДтНУ2		= СтрокаОтражения.СубконтоДтНУ2;
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДтНУ1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДтНУ3		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДтНУ3		= СтрокаОтражения.СубконтоДтНУ3;
					КонецЕсли;
						
				Иначе
					Строка.СубконтоДт1		= СтрокаОтражения.СубконтоДт1;
					Строка.СубконтоДт2		= СтрокаОтражения.СубконтоДт2;
					Строка.СубконтоДт3		= СтрокаОтражения.СубконтоДт3;				
					//vvv
					Строка.СубконтоДт1		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт1,ПараметрыПолученияСубконто);
					Строка.СубконтоДт2		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт2,ПараметрыПолученияСубконто);
					Строка.СубконтоДт3		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт3,ПараметрыПолученияСубконто);
					Строка.СубконтоДт4		= ПолучитьСубконто(СтрокаОтражения.СубконтоДт4,ПараметрыПолученияСубконто);
					//
					
					Строка.СчетДтНУ			= СтрокаОтражения.СчетДтНУ;
					Строка.СубконтоДтНУ1	= СтрокаОтражения.СубконтоДтНУ1;
					Строка.СубконтоДтНУ2	= СтрокаОтражения.СубконтоДтНУ2;
					Строка.СубконтоДтНУ3	= СтрокаОтражения.СубконтоДтНУ3;
				КонецЕсли;
								
				// ЕдиныйПлатеж
				Строка.СчетКт			=  РегистрыСведений.ТарифыВзносовНаППС.ПолучитьПоследнее(ПериодРегистрации).СчетБУ;

				Строка.СубконтоКт1		= СубконтоКредита;
				Строка.СчетКтНУ			=  РегистрыСведений.ТарифыВзносовНаППС.ПолучитьПоследнее(ПериодРегистрации).СчетНУ;

				Строка.Сумма			= РезультатыППС[Индекс];
				//vvv
				Строка.ПериодРБПНалогов = Выборка.ПериодВзаиморасчетов;
				//
			КонецЕсли;
			Индекс = Индекс + 1;

		КонецЦикла;
	КонецЦикла;
	
	
	//vvv
	ЗапросРБП=Новый Запрос;
	СписокСчетовДляРБП=Новый СписокЗначений;
	СписокСчетовДляРБП.Добавить(ПланыСчетов.Хозрасчетный.ФСС);
	СписокСчетовДляРБП.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДобровольномуСтрахованиюРаботников);
	СписокСчетовДляРБП.Добавить(ПланыСчетов.Хозрасчетный.ПФР_страх);
	
	ЗапросРБП.УстановитьПараметр("Счет97", ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
	ЗапросРБП.УстановитьПараметр("ПериодыРегистрации", ПериодыРегистрацииПредыдущихПериодов);
	ЗапросРБП.УстановитьПараметр("парамПериод", НачалоМесяца(ПериодРегистрации));
	ЗапросРБП.УстановитьПараметр("МассивФизЛиц", МассивФизлиц);
	ЗапросРБП.УстановитьПараметр("СписокСчетов", СписокСчетовДляРБП);
	ЗапросРБП.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	ЗапросРБП.УстановитьПараметр("СчетФСЗН", ПланыСчетов.Хозрасчетный.ФСС);
	ЗапросРБП.УстановитьПараметр("СчетБГС", ПланыСчетов.Хозрасчетный.РасчетыПоДобровольномуСтрахованиюРаботников);
	ЗапросРБП.УстановитьПараметр("СчетППС", ПланыСчетов.Хозрасчетный.ПФР_страх);
	ЗапросРБП.УстановитьПараметр("ДатаДеноминации", ОбщегоНазначения.ПолучитьДатуДеноминации());
	
	ЗапросРБП.Текст =
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияВУчете.СчетКт = &СчетФСЗН
	|				ТОГДА ДвиженияВУчете.Сумма / ВЫБОР КОГДА ДвиженияВУчете.Ссылка.ПериодРегистрации <&ДатаДеноминации ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФСЗН,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияВУчете.СчетКт = &СчетБГС
	|				ТОГДА ДвиженияВУчете.Сумма / ВЫБОР КОГДА ДвиженияВУчете.Ссылка.ПериодРегистрации <&ДатаДеноминации ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Страх,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияВУчете.СчетКт = &СчетППС
	|				ТОГДА ДвиженияВУчете.Сумма / ВЫБОР КОГДА ДвиженияВУчете.Ссылка.ПериодРегистрации <&ДатаДеноминации ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ППС,
	|	ДвиженияВУчете.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	ДвиженияВУчете.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	Документ.ОтражениеЗарплатыВРеглУчете.ОтражениеВУчете КАК ДвиженияВУчете
	|ГДЕ
	|	ДвиженияВУчете.Ссылка.ПериодРегистрации В(&ПериодыРегистрации)
	|	И ДвиженияВУчете.СчетДт = &Счет97
	|	И ДвиженияВУчете.СчетКт В(&СписокСчетов)
	|	И ДвиженияВУчете.Ссылка.Организация = &парамОбособленноеПодразделение
	|	И ДвиженияВУчете.Ссылка.Проведен
	|	И (НАЧАЛОПЕРИОДА(ДвиженияВУчете.ПериодРБПНалогов,МЕСЯЦ)=&парамПериод ИЛИ ДвиженияВУчете.ПериодРБПНалогов=ДАТАВРЕМЯ(1,1,1,0,0,0))
	|	И ДвиженияВУчете.ФизЛицо В(&МассивФизлиц)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияВУчете.Ссылка.ПериодРегистрации,
	|	ДвиженияВУчете.ФизЛицо";

	ВыборкаРБП=ЗапросРБП.Выполнить().Выбрать();
	
	Отбор = Новый Структура("ПериодДействия,ФизЛицо");
	ОтборПоПериодуДействия = Новый Структура("ФизЛицо, ПериодРегистрации, ПериодДействия");
	ОтборПоПериодуДействия.ПериодДействия = ПериодРегистрации;

	ТаблицаРБП=ПромежуточнаяТаблица.Скопировать();
	ТаблицаРБП.Очистить();
	
	Пока ВыборкаРБП.Следующий() Цикл

		СубконтоКредита = Перечисления.ВидыПлатежейВФонды.Соцстрах;
		
		ОтборПоПериодуДействия.ФизЛицо=ВыборкаРБП.ФизЛицо;
		ОтборПоПериодуДействия.ПериодРегистрации = ВыборкаРБП.ПериодРегистрации;
		СтрокиОтраженияПоФизЛицу = ОтражениеВБУРБПТаблица.НайтиСтроки(ОтборПоПериодуДействия);
		
		// БГС
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаСтрах");
		РезультатыСтрах = ОбщегоНазначения.РаспределитьПропорционально(ВыборкаРБП.Страх, Коэффициенты);

		// ФСЗН
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаФСЗН");
		//vvv
		//РезультатыФСЗН = ОбщегоНазначения.РаспределитьПропорционально(ВыборкаРБП.ФСЗН, Коэффициенты,0);   
		РезультатыФСЗН = ОбщегоНазначения.РаспределитьПропорционально(ВыборкаРБП.ФСЗН, Коэффициенты,?(ПериодРегистрации<ОбщегоНазначения.ПолучитьДатуДеноминации(),0,2));   
		//

		// ППС
		Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(СтрокиОтраженияПоФизЛицу,"БазаППС");
		РезультатыППС = ОбщегоНазначения.РаспределитьПропорционально(ВыборкаРБП.ППС, Коэффициенты);
		
		Индекс = 0;
		Для Каждого СтрокаОтражения Из СтрокиОтраженияПоФизЛицу Цикл

			ПараметрыПолученияСубконто[ТипСтатьиЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиКалькуляции].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиПрибыли].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСчет].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			
			Если РезультатыФСЗН <> Неопределено Тогда
				Строка = ПромежуточнаяТаблица.Добавить();
				Строка.СчетДт			= ПолучитьСубконто(СтрокаОтражения.СчетДтНалогов,ПараметрыПолученияСубконто);
				Строка.ФизЛицо          = ВыборкаРБП.ФизЛицо;
				Если ЗначениеЗаполнено(СтатьяЗатратФСЗН) Тогда 
					Если ТипЗнч(СтрокаОтражения.СубконтоДт1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт1		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДт1		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов1),СтрокаОтражения.СубконтоДтНалогов1,СтрокаОтражения.СубконтоДт1),ПараметрыПолученияСубконто);					
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт2		= СтатьяЗатратФСЗН;
					Иначе						
						Строка.СубконтоДт2		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов2),СтрокаОтражения.СубконтоДтНалогов2,СтрокаОтражения.СубконтоДт2),ПараметрыПолученияСубконто);						
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт3		= СтатьяЗатратФСЗН;
					Иначе
						Строка.СубконтоДт3		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов3),СтрокаОтражения.СубконтоДтНалогов3,СтрокаОтражения.СубконтоДт3),ПараметрыПолученияСубконто);					
					КонецЕсли;					
	
					Если ТипЗнч(СтрокаОтражения.СубконтоДт4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт4		= СтатьяЗатратФСЗН;
					Иначе						
						Строка.СубконтоДт4		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов4),СтрокаОтражения.СубконтоДтНалогов4,СтрокаОтражения.СубконтоДт4),ПараметрыПолученияСубконто);						
					КонецЕсли;					
						
				Иначе					
					Строка.СубконтоДт1		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов1),СтрокаОтражения.СубконтоДтНалогов1,СтрокаОтражения.СубконтоДт1),ПараметрыПолученияСубконто);
					Строка.СубконтоДт2		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов2),СтрокаОтражения.СубконтоДтНалогов2,СтрокаОтражения.СубконтоДт2),ПараметрыПолученияСубконто);
					Строка.СубконтоДт3		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов3),СтрокаОтражения.СубконтоДтНалогов3,СтрокаОтражения.СубконтоДт3),ПараметрыПолученияСубконто);					
					Строка.СубконтоДт4		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов4),СтрокаОтражения.СубконтоДтНалогов4,СтрокаОтражения.СубконтоДт4),ПараметрыПолученияСубконто);					
				КонецЕсли;				
				
				Строка.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
				Строка.СубконтоКт1 = Перечисления.ЭлементыЗатрат.Соцстрах;				
				Строка.Сумма = РезультатыФСЗН[Индекс];
				
			КонецЕсли;
			
			ПараметрыПолученияСубконто[ТипСтатьиЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипСтатьиКалькуляции].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипСтатьиПрибыли].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			ПараметрыПолученияСубконто[ТипСчет].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			
			Если РезультатыСтрах <> Неопределено Тогда
				Строка = ПромежуточнаяТаблица.Добавить();
				Строка.СчетДт			= ПолучитьСубконто(СтрокаОтражения.СчетДтНалогов,ПараметрыПолученияСубконто);
			    Строка.ФизЛицо          = ВыборкаРБП.ФизЛицо;
				Если ЗначениеЗаполнено(СтатьяЗатратСтрах) Тогда 
					Если ТипЗнч(СтрокаОтражения.СубконтоДт1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт1		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДт1		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов1),СтрокаОтражения.СубконтоДтНалогов1,СтрокаОтражения.СубконтоДт1),ПараметрыПолученияСубконто);						
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт2		= СтатьяЗатратСтрах;
					Иначе						
						Строка.СубконтоДт2		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов2),СтрокаОтражения.СубконтоДтНалогов2,СтрокаОтражения.СубконтоДт2),ПараметрыПолученияСубконто);						
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт3		= СтатьяЗатратСтрах;
					Иначе
						Строка.СубконтоДт3		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов3),СтрокаОтражения.СубконтоДтНалогов3,СтрокаОтражения.СубконтоДт3),ПараметрыПолученияСубконто);						
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт4		= СтатьяЗатратСтрах;
					Иначе						
						Строка.СубконтоДт4		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов4),СтрокаОтражения.СубконтоДтНалогов4,СтрокаОтражения.СубконтоДт4),ПараметрыПолученияСубконто);						
					КонецЕсли;							
					
				Иначе
					Строка.СубконтоДт1		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов1),СтрокаОтражения.СубконтоДтНалогов1,СтрокаОтражения.СубконтоДт1),ПараметрыПолученияСубконто);
					Строка.СубконтоДт2		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов2),СтрокаОтражения.СубконтоДтНалогов2,СтрокаОтражения.СубконтоДт2),ПараметрыПолученияСубконто);
					Строка.СубконтоДт3		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов3),СтрокаОтражения.СубконтоДтНалогов3,СтрокаОтражения.СубконтоДт3),ПараметрыПолученияСубконто);
					Строка.СубконтоДт4		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов4),СтрокаОтражения.СубконтоДтНалогов4,СтрокаОтражения.СубконтоДт4),ПараметрыПолученияСубконто);					
				КонецЕсли;
				
				КоррСчет				=  РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации, 
											Новый Структура("Организация", Организация)).СчетБУ;
											
				Строка.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
				Строка.СубконтоКт1 = Перечисления.ЭлементыЗатрат.Страхование;													

				Строка.Сумма			= РезультатыСтрах[Индекс];
			КонецЕсли;
						
			ПараметрыПолученияСубконто[ТипСтатьиЗатрат].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиКалькуляции].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСтатьиПрибыли].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипНоменклатурныеГруппы].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			ПараметрыПолученияСубконто[ТипСчет].ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			
			Если РезультатыППС <> Неопределено Тогда
				Строка = ПромежуточнаяТаблица.Добавить();
				Строка.СчетДт			= ПолучитьСубконто(СтрокаОтражения.СчетДтНалогов,ПараметрыПолученияСубконто);;
				Строка.ФизЛицо          = ВыборкаРБП.ФизЛицо;
				Если ЗначениеЗаполнено(СтатьяЗатратППС) Тогда 
					Если ТипЗнч(СтрокаОтражения.СубконтоДт1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт1		= СтатьяЗатратППС;
					Иначе						
						Строка.СубконтоДт1		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов1),СтрокаОтражения.СубконтоДтНалогов1,СтрокаОтражения.СубконтоДт1),ПараметрыПолученияСубконто);						
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт2		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДт2		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов2),СтрокаОтражения.СубконтоДтНалогов2,СтрокаОтражения.СубконтоДт2),ПараметрыПолученияСубконто);						
					КонецЕсли;
					Если ТипЗнч(СтрокаОтражения.СубконтоДт3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт3		= СтатьяЗатратППС;
					Иначе						
						Строка.СубконтоДт3		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов3),СтрокаОтражения.СубконтоДтНалогов3,СтрокаОтражения.СубконтоДт3),ПараметрыПолученияСубконто);						
					КонецЕсли;					
					Если ТипЗнч(СтрокаОтражения.СубконтоДт4) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Строка.СубконтоДт4		= СтатьяЗатратППС;
					Иначе
						Строка.СубконтоДт4		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов4),СтрокаОтражения.СубконтоДтНалогов4,СтрокаОтражения.СубконтоДт4),ПараметрыПолученияСубконто);						
					КонецЕсли;														
						
				Иначе
					Строка.СубконтоДт1		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов1),СтрокаОтражения.СубконтоДтНалогов1,СтрокаОтражения.СубконтоДт1),ПараметрыПолученияСубконто);
					Строка.СубконтоДт2		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов2),СтрокаОтражения.СубконтоДтНалогов2,СтрокаОтражения.СубконтоДт2),ПараметрыПолученияСубконто);
					Строка.СубконтоДт3		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов3),СтрокаОтражения.СубконтоДтНалогов3,СтрокаОтражения.СубконтоДт3),ПараметрыПолученияСубконто);
					Строка.СубконтоДт4		= ПолучитьСубконто(?(ЗначениеЗаполнено(СтрокаОтражения.СубконтоДтНалогов4),СтрокаОтражения.СубконтоДтНалогов4,СтрокаОтражения.СубконтоДт4),ПараметрыПолученияСубконто);													
				КонецЕсли;
								
				Строка.СчетКт			=  ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
				Строка.СубконтоКт1		= Перечисления.ЭлементыЗатрат.Соцстрах;
				Строка.Сумма			= РезультатыППС[Индекс];
			КонецЕсли;
			Индекс = Индекс + 1;

		КонецЦикла;
	КонецЦикла;
	//
	
	ЕСНИсчисленныйТекст = 
	"ВЫБРАТЬ
	|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
	|	СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд
	|ИЗ
	|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	|	
	|ГДЕ
	|	ЕСНИсчисленный.Период >= &парамНачалоПериода И
	|	ЕСНИсчисленный.Период < &парамКонецПериода И
	|	ЕСНИсчисленный.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	
	|СГРУППИРОВАТЬ ПО
	|	ЕСНИсчисленный.ФизЛицо";

	Запрос = Новый Запрос(ЕСНИсчисленныйТекст);

	Запрос.УстановитьПараметр("парамНачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);

    СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
	
	СчетКредита = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
									Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)).СчетБУ;
	//vvv								
	//СубконтоКредита = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	СубконтоКредита = Перечисления.ВидыПлатежейВФонды.ПенсФонд1Проц;
	//
	ВыборкаПФ = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПФ.Следующий() Цикл
		
		Строка = ПромежуточнаяТаблица.Добавить();
		Строка.СчетДт 		= СчетДебета;
		//vvv
		Строка.Физлицо 	= ВыборкаПФ.Физлицо;
		//
		Строка.СубконтоДт1 	= ВыборкаПФ.Физлицо;
		
		Субконто    = Новый Массив(3);
		Для тт=0 по 2 цикл
			Субконто[тт] = Неопределено;
		КонецЦикла;
				
		Для тт=0 по СчетКредита.ВидыСубконто.Количество()-1 Цикл
			Если НЕ СчетКредита.ВидыСубконто[тт].ВидСубконто = Неопределено тогда
				Если СчетКредита.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет")) Тогда
					Субконто[тт] = Перечисления.ВидыПлатежейВГосБюджет.Налог;
                //vvv
				ИначеЕсли СчетКредита.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("ПеречислениеСсылка.ВидыПлатежейВФонды")) Тогда
					Субконто[тт] = Перечисления.ВидыПлатежейВФонды.ПенсФонд1Проц;
				//
				ИначеЕсли СчетКредита.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
					Субконто[тт] = Организация;
				ИначеЕсли СчетКредита.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ФизическиеЛица")) Тогда
					Субконто[тт] = ВыборкаПФ.Физлицо;
		  		КонецЕсли;
			КонецЕсли;
				
		КонецЦикла;
		
		Строка.СчетКт 			= СчетКредита;
		Строка.СубконтоКт1		= Субконто[0];
		Строка.СубконтоКт2		= Субконто[1];
		Строка.СубконтоКт3		= Субконто[2];
 		Строка.Сумма			= ВыборкаПФ.ПенсионныйФонд;
	
	КонецЦикла;
	// вычеркнем обнулившиеся суммы
	//vvv комментируем, добавляем физлицо
	//ПромежуточнаяТаблица.Свернуть("СчетДт,СчетКт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоДт4,СубконтоКт1,СубконтоКт2,СубконтоКт3,СубконтоКт4,СчетДтНУ,СчетКтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3", "Сумма");
	ПромежуточнаяТаблица.Свернуть("СчетДт,СчетКт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоДт4,СубконтоКт1,СубконтоКт2,СубконтоКт3,СубконтоКт4,СчетДтНУ,СчетКтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3,ФизЛицо,ПериодРБПНалогов", "Сумма");
	//
	НулевыеСтроки = ПромежуточнаяТаблица.НайтиСтроки(Новый Структура("Сумма",0));
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		ПромежуточнаяТаблица.Удалить(СтрокаТаблицы)
	КонецЦикла;

	//////////////////////////////////////////////////////////////////////////////////////////////////
	// отражение начислений

	// БУНачисления
	//	Поля:
	//		СчетДт
	//		СубконтоДт1
	//		СубконтоДт2
	//		СубконтоДт3
	//		СчетКт
	//		СубконтоКт1
	//		СубконтоКт2
	//		СубконтоКт3
	//		СчетДтНУ,
	//		Субконто255НК,
	//		Результат
	// Объединение:
	// 

	БУНачисленияТекст = 
	"ВЫБРАТЬ
	|	БУНачисления.СчетДт,
	|	ВЫБОР КОГДА БУНачисления.СчетДт = &Счет97 ТОГДА &РБПНаОплатуТруда ИНАЧЕ БУНачисления.СубконтоДт1 КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА БУНачисления.СчетДт = &Счет97 ТОГДА БУНачисления.Физлицо ИНАЧЕ БУНачисления.СубконтоДт2 КОНЕЦ КАК СубконтоДт2,
	|	БУНачисления.СубконтоДт3,
	//vvv
	|	БУНачисления.СубконтоДт4,
	|	БУНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	//
	|	БУНачисления.СчетКт,
	|	БУНачисления.СубконтоКт1,
	|	БУНачисления.СубконтоКт2,
	|	БУНачисления.СубконтоКт3,
	//vvv
	|	БУНачисления.СубконтоКт4,
	//
	|	БУНачисления.СчетДтНУ,
	|	БУНачисления.СубконтоДтНУ1,
	|	БУНачисления.СубконтоДтНУ2,
	|	БУНачисления.СубконтоДтНУ3,
	|	БУНачисления.СчетКтНУ,
	|	БУНачисления.СубконтоКтНУ1,
	|	ВЫБОР КОГДА БУНачисления.СчетДт = &Счет97 ТОГДА &ОтпускБудПериода ИНАЧЕ БУНачисления.СубконтоКтНУ2 КОНЕЦ КАК СубконтоКтНУ2,
	|	БУНачисления.СубконтоКтНУ3,
	|	СУММА(БУНачисления.Результат) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР КОГДА НЕ(БУОсновныеНачисления.СчетДт В ИЕРАРХИИ (&СчетаИсключения)) И БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации ТОГДА &Счет97 ИНАЧЕ БУОсновныеНачисления.СчетДт КОНЕЦ КАК СчетДт,
	|		БУОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
	|		БУОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
	|		БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
	//vvv
	|		БУОсновныеНачисления.СубконтоДт4 КАК СубконтоДт4,
	//
	|		БУОсновныеНачисления.СчетКт КАК СчетКт,
	|		БУОсновныеНачисления.СубконтоКт1 КАК СубконтоКт1,
	|		БУОсновныеНачисления.СубконтоКт2 КАК СубконтоКт2,
	|		БУОсновныеНачисления.СубконтоКт3 КАК СубконтоКт3,
	//vvv
	|		БУОсновныеНачисления.СубконтоКт4 КАК СубконтоКт4,
	//
	|		ВЫБОР КОГДА НЕ(БУОсновныеНачисления.СчетДт В ИЕРАРХИИ (&СчетаИсключения)) И БУОсновныеНачисления.ПериодДействия > БУОсновныеНачисления.ПериодРегистрации ТОГДА &СчетН97 ИНАЧЕ БУОсновныеНачисления.СчетДтНУ КОНЕЦ КАК СчетДтНУ,
	|		БУОсновныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
	|		БУОсновныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
	|		БУОсновныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
	|		БУОсновныеНачисления.СчетКтНУ КАК СчетКтНУ,
	|		БУОсновныеНачисления.СубконтоКтНУ1 КАК СубконтоКтНУ1,
	|		БУОсновныеНачисления.СубконтоКтНУ2 КАК СубконтоКтНУ2,
	|		БУОсновныеНачисления.СубконтоКтНУ3 КАК СубконтоКтНУ3,
	|		БУОсновныеНачисления.Сотрудник.ФизЛицо КАК Физлицо,
	|		БУОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		БУОсновныеНачисления.Результат КАК Результат
	|	ИЗ
	|		РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				БУНачисленияСрез.Сотрудник.ФизЛицо КАК ФизЛицо,
	|				БУНачисленияСрез.Сотрудник КАК Сотрудник,
	|				РаботникиОрганизации.Должность КАК Должность
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизации.Период) КАК ПериодСреза,
	|					БУНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|					БУНачисления.Сотрудник КАК Сотрудник
	|				ИЗ
	|					РегистрРасчета.БУОсновныеНачисления КАК БУНачисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|						ПО БУНачисления.ПериодДействияНачало >= РаботникиОрганизации.Период И БУНачисления.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)
	|				
	|				ГДЕ
	|					БУНачисления.ПериодРегистрации = &парамПериод И
	|					БУНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|				
	|				СГРУППИРОВАТЬ ПО
	|					БУНачисления.Сотрудник.ФизЛицо,
	|					БУНачисления.Сотрудник) КАК БУНачисленияСрез
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|					ПО БУНачисленияСрез.ПериодСреза = РаботникиОрганизации.Период И БУНачисленияСрез.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)) КАК Должности
	|			ПО БУОсновныеНачисления.Сотрудник = Должности.Сотрудник
	|	
	|	ГДЕ
	|		БУОсновныеНачисления.ПериодРегистрации = &парамПериод И
	|		БУОсновныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	//vvv комментируем, для доп. начислений тоже будем учитывать РБП
	//|		БУДополнительныеНачисления.СчетДт,
	|		ВЫБОР КОГДА НЕ(БУДополнительныеНачисления.СчетДт В ИЕРАРХИИ (&СчетаИсключения)) И НАЧАЛОПЕРИОДА(БУДополнительныеНачисления.ПериодДействияДоп,МЕСЯЦ) > НАЧАЛОПЕРИОДА(БУДополнительныеНачисления.ПериодРегистрации,МЕСЯЦ) ТОГДА &Счет97 ИНАЧЕ БУДополнительныеНачисления.СчетДт КОНЕЦ,
	//
	|		БУДополнительныеНачисления.СубконтоДт1,
	|		БУДополнительныеНачисления.СубконтоДт2,
	|		БУДополнительныеНачисления.СубконтоДт3,
	//vvv
	|		БУДополнительныеНачисления.СубконтоДт4,
	//
	|		БУДополнительныеНачисления.СчетКт,
	|		БУДополнительныеНачисления.СубконтоКт1,
	|		БУДополнительныеНачисления.СубконтоКт2,
	|		БУДополнительныеНачисления.СубконтоКт3,
	//vvv
	|		БУДополнительныеНачисления.СубконтоКт4,
	//
	|		БУДополнительныеНачисления.СчетДтНУ,
	|		БУДополнительныеНачисления.СубконтоДтНУ1,
	|		БУДополнительныеНачисления.СубконтоДтНУ2,
	|		БУДополнительныеНачисления.СубконтоДтНУ3,
	|		БУДополнительныеНачисления.СчетКтНУ,
	|		БУДополнительныеНачисления.СубконтоКтНУ1,
	|		БУДополнительныеНачисления.СубконтоКтНУ2,
	|		БУДополнительныеНачисления.СубконтоКтНУ3,
	|		БУДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.Результат
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				БУНачисленияСрез.Сотрудник.ФизЛицо КАК ФизЛицо,
	|				БУНачисленияСрез.Сотрудник КАК Сотрудник,
	|				РаботникиОрганизации.Должность КАК Должность
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизации.Период) КАК ПериодСреза,
	|					БУНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|					БУНачисления.Сотрудник КАК Сотрудник
	|				ИЗ
	|					РегистрРасчета.БУДополнительныеНачисления КАК БУНачисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|						ПО БУНачисления.ПериодРегистрации >= РаботникиОрганизации.Период И БУНачисления.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)
	|				
	|				ГДЕ
	|					БУНачисления.ПериодРегистрации = &парамПериод И
	|					БУНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|				
	|				СГРУППИРОВАТЬ ПО
	|					БУНачисления.Сотрудник.ФизЛицо,
	|					БУНачисления.Сотрудник) КАК БУНачисленияСрез
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|					ПО БУНачисленияСрез.ПериодСреза = РаботникиОрганизации.Период И БУНачисленияСрез.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)) КАК Должности
	|			ПО БУДополнительныеНачисления.Сотрудник = Должности.Сотрудник
	|	
	|	ГДЕ
	|		БУДополнительныеНачисления.ПериодРегистрации = &парамПериод И
	|		БУДополнительныеНачисления.ВидРасчета.ВидПремии <> &парамВРезерв И
	|		БУДополнительныеНачисления.ВидРасчета.ВидПремии <> &парамИзРезерва И
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	//vvv комментиурем, см. причину выше
	//|		БУДополнительныеНачисления.СчетДт,
	|		ВЫБОР КОГДА НЕ(БУДополнительныеНачисления.СчетДт В ИЕРАРХИИ (&СчетаИсключения)) И БУДополнительныеНачисления.ПериодДействияДоп > БУДополнительныеНачисления.ПериодРегистрации ТОГДА &Счет97 ИНАЧЕ БУДополнительныеНачисления.СчетДт КОНЕЦ,
	//
	|		БУДополнительныеНачисления.СубконтоДт1,
	|		БУДополнительныеНачисления.СубконтоДт2,
	|		БУДополнительныеНачисления.СубконтоДт3,
	//vvv
	|		БУДополнительныеНачисления.СубконтоДт4,
	//
	|		&парамСчетРезерваБУ,
	|		&парамСубконтоРезерваБУ1,
	|		&парамСубконтоРезерваБУ2,
	|		&парамСубконтоРезерваБУ3,
	//vvv
	|		NULL,
	//
	|		БУДополнительныеНачисления.СчетДтНУ,
	|		БУДополнительныеНачисления.СубконтоДтНУ1,
	|		БУДополнительныеНачисления.СубконтоДтНУ2,
	|		БУДополнительныеНачисления.СубконтоДтНУ3,
	|		&парамСчетРезерваНУ,
	|		&парамСубконтоРезерваНУ1,
	|		&парамСубконтоРезерваНУ2,
	|		&парамСубконтоРезерваНУ3,
	|		БУДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.Результат
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				БУНачисленияСрез.Сотрудник.ФизЛицо КАК ФизЛицо,
	|				БУНачисленияСрез.Сотрудник КАК Сотрудник,
	|				РаботникиОрганизации.Должность КАК Должность
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизации.Период) КАК ПериодСреза,
	|					БУНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|					БУНачисления.Сотрудник КАК Сотрудник
	|				ИЗ
	|					РегистрРасчета.БУДополнительныеНачисления КАК БУНачисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|						ПО БУНачисления.ПериодРегистрации >= РаботникиОрганизации.Период И БУНачисления.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)
	|				
	|				ГДЕ
	|					БУНачисления.ПериодРегистрации = &парамПериод И
	|					БУНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|				
	|				СГРУППИРОВАТЬ ПО
	|					БУНачисления.Сотрудник.ФизЛицо,
	|					БУНачисления.Сотрудник) КАК БУНачисленияСрез
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|					ПО БУНачисленияСрез.ПериодСреза = РаботникиОрганизации.Период И БУНачисленияСрез.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)) КАК Должности
	|			ПО БУДополнительныеНачисления.Сотрудник = Должности.Сотрудник
	|	
	|	ГДЕ
	|		БУДополнительныеНачисления.ПериодРегистрации = &парамПериод И
	|		БУДополнительныеНачисления.ВидРасчета.ВидПремии = &парамВРезерв И
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&парамСчетРезерваБУ,
	|		&парамСубконтоРезерваБУ1,
	|		&парамСубконтоРезерваБУ2,
	|		&парамСубконтоРезерваБУ3,
	|		БУДополнительныеНачисления.СчетКт,
	|		БУДополнительныеНачисления.СубконтоКт1,
	|		БУДополнительныеНачисления.СубконтоКт2,
	|		БУДополнительныеНачисления.СубконтоКт3,
	//vvv
	|		БУДополнительныеНачисления.СубконтоКт4,
	//
	|		&парамСчетРезерваНУ,
	|		&парамСубконтоРезерваНУ1,
	|		&парамСубконтоРезерваНУ2,
	|		&парамСубконтоРезерваНУ3,
	//vvv
	|		NULL,
	//
	|		БУДополнительныеНачисления.СчетКтНУ,
	|		БУДополнительныеНачисления.СубконтоКтНУ1,
	|		БУДополнительныеНачисления.СубконтоКтНУ2,
	|		БУДополнительныеНачисления.СубконтоКтНУ3,
	|		БУДополнительныеНачисления.Сотрудник.ФизЛицо,
	|		БУДополнительныеНачисления.Сотрудник,
	|		БУДополнительныеНачисления.Результат
	|	ИЗ
	|		РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				БУНачисленияСрез.Сотрудник.ФизЛицо КАК ФизЛицо,
	|				БУНачисленияСрез.Сотрудник КАК Сотрудник,
	|				РаботникиОрганизации.Должность КАК Должность
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизации.Период) КАК ПериодСреза,
	|					БУНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|					БУНачисления.Сотрудник КАК Сотрудник
	|				ИЗ
	|					РегистрРасчета.БУДополнительныеНачисления КАК БУНачисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|						ПО БУНачисления.ПериодРегистрации >= РаботникиОрганизации.Период И БУНачисления.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)
	|				
	|				ГДЕ
	|					БУНачисления.ПериодРегистрации = &парамПериод И
	|					БУНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|				
	|				СГРУППИРОВАТЬ ПО
	|					БУНачисления.Сотрудник.ФизЛицо,
	|					БУНачисления.Сотрудник) КАК БУНачисленияСрез
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|					ПО БУНачисленияСрез.ПериодСреза = РаботникиОрганизации.Период И БУНачисленияСрез.Сотрудник = РаботникиОрганизации.Сотрудник И (РаботникиОрганизации.Организация = &ГоловнаяОрганизация)) КАК Должности
	|			ПО БУДополнительныеНачисления.Сотрудник = Должности.Сотрудник
	|	
	|	ГДЕ
	|		БУДополнительныеНачисления.ПериодРегистрации = &парамПериод И
	|		БУДополнительныеНачисления.ВидРасчета.ВидПремии = &парамИзРезерва И
	|		БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК БУНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	БУНачисления.СчетДт,
	|	БУНачисления.СубконтоДт1,
	|	БУНачисления.СубконтоДт2,
	|	БУНачисления.СубконтоДт3,
	//vvv
	|	БУНачисления.СубконтоДт4,
	//
	|	БУНачисления.СчетКт,
	|	БУНачисления.СубконтоКт1,
	|	БУНачисления.СубконтоКт2,
	|	БУНачисления.СубконтоКт3,
	//vvv
	|	БУНачисления.СубконтоКт4,
	//
	|	БУНачисления.СчетДтНУ,
	|	БУНачисления.СубконтоДтНУ1,
	|	БУНачисления.СубконтоДтНУ2,
	|	БУНачисления.СубконтоДтНУ3,
	|	БУНачисления.Сотрудник.Физлицо,
	|	БУНачисления.Сотрудник,
	|	БУНачисления.СубконтоКтНУ1,
	|	ВЫБОР КОГДА БУНачисления.СчетДт = &Счет97 ТОГДА &ОтпускБудПериода ИНАЧЕ БУНачисления.СубконтоКтНУ2 КОНЕЦ,
	|	БУНачисления.СубконтоКтНУ3,
	|	ВЫБОР КОГДА БУНачисления.СчетДт = &Счет97 ТОГДА &РБПНаОплатуТруда ИНАЧЕ БУНачисления.СубконтоДт1 КОНЕЦ,
	|	ВЫБОР КОГДА БУНачисления.СчетДт = &Счет97 ТОГДА БУНачисления.Физлицо ИНАЧЕ БУНачисления.СубконтоДт2 КОНЕЦ,
	|	БУНачисления.СчетКтНУ";

	Запрос = Новый Запрос(БУНачисленияТекст);

	
	СчетаИсключения = Новый Массив();
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РезервыПредстоящихРасходов);
	
	СчетаИсключенияНУ = Новый Массив();
	СчетаИсключенияНУ.Добавить(ПланыСчетов.Налоговый.ПустаяСсылка());
	СчетаИсключенияНУ.Добавить(ПланыСчетов.Налоговый.РасчетыПоСоциальномуСтрахованию);
	
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Ссылка.Организация));
	Если УчетнаяПолитика = Неопределено тогда
		Сообщить("Не определена учетная политика по персоналу");
		//vvv
		ЗаписьЖурналаРегистрации("ОтражениеВУчете.АвтозаполнениеПроводок",УровеньЖурналаРегистрации.Информация,Метаданные.Документы.ОтражениеЗарплатыВРеглУчете,Ссылка,"Окончание автозаполнения проводок "+Строка(ТекущаяДата())+".Затраченное время "+СервисныеПроцедурыИФункции.РазностьВремени(ТекущаяДата(),НачалоАвтозаполненияПроводок));
		//
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("парамСчетРезерваБУ", УчетнаяПолитика.СчетУчетаРезерваБУ);
	Запрос.УстановитьПараметр("парамСубконтоРезерваБУ1", УчетнаяПолитика.СубконтоРезерваБУ1);
	Запрос.УстановитьПараметр("парамСубконтоРезерваБУ2", УчетнаяПолитика.СубконтоРезерваБУ2);
	Запрос.УстановитьПараметр("парамСубконтоРезерваБУ3", УчетнаяПолитика.СубконтоРезерваБУ3);
	Запрос.УстановитьПараметр("парамСчетРезерваНУ", УчетнаяПолитика.СчетУчетаРезерваНУ);
	Запрос.УстановитьПараметр("парамСубконтоРезерваНУ1", УчетнаяПолитика.СубконтоРезерваНУ1);
	Запрос.УстановитьПараметр("парамСубконтоРезерваНУ2", УчетнаяПолитика.СубконтоРезерваНУ2);
	Запрос.УстановитьПараметр("парамСубконтоРезерваНУ3", УчетнаяПолитика.СубконтоРезерваНУ3);
	
		
	Запрос.УстановитьПараметр("парамВРезерв", Перечисления.ВидыПремии.ПремияВРезерв);
	Запрос.УстановитьПараметр("парамИзРезерва", Перечисления.ВидыПремии.ПремияИзРезерва);
	Запрос.УстановитьПараметр("парамПериод", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Запрос.УстановитьПараметр("СчетаИсключенияНУ", СчетаИсключенияНУ);

	Запрос.УстановитьПараметр("парамПустойСчетНУ", ПланыСчетов.Налоговый.ПустаяСсылка());
	Запрос.УстановитьПараметр("Счет97", ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
	Запрос.УстановитьПараметр("СчетН97", ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов);
	Запрос.УстановитьПараметр("СчетН70", ПланыСчетов.Налоговый.РасчетыСПерсоналомПоОплатеТруда);
	//vvv
	//Запрос.УстановитьПараметр("РБПНаОплатуТруда", Справочники.РасходыБудущихПериодов.РБПНаОплатуТруда);
	Запрос.УстановитьПараметр("РБПНаОплатуТруда", Перечисления.ЭлементыЗатрат.ОплатаТруда);
	//
	Запрос.УстановитьПараметр("ОтпускБудПериода", Перечисления.ВидыНачисленийОплатыТрудаПоСт255НК.ОплатаОтпускаБуд);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Строка = ОтражениеВУчете.Добавить();
		Строка.СчетДт 			= Выборка.СчетДт;
		Строка.СубконтоДт1 		= Выборка.СубконтоДт1;
		Строка.СубконтоДт2 		= Выборка.СубконтоДт2;
		Строка.СубконтоДт3	 	= Выборка.СубконтоДт3;
		//vvv
		Строка.СубконтоДт4	 	= Выборка.СубконтоДт4;
		Строка.ФизЛицо		 	= Выборка.ФизЛицо;
		//
		Строка.СчетКт 			= Выборка.СчетКт;
		Строка.СубконтоКт1 		= Выборка.СубконтоКт1;
		Строка.СубконтоКт2 		= Выборка.СубконтоКт2;
		Строка.СубконтоКт3	 	= Выборка.СубконтоКт3;
		//
		Строка.СубконтоКт4	 	= Выборка.СубконтоКт4;
		//
		Строка.СчетДтНУ			= Выборка.СчетДтНУ;
		Строка.СубконтоДтНУ1 	= Выборка.СубконтоДтНУ1;
		Строка.СубконтоДтНУ2 	= Выборка.СубконтоДтНУ2;
		Строка.СубконтоДтНУ3 	= Выборка.СубконтоДтНУ3;		
		Строка.СчетКтНУ			= Выборка.СчетКтНУ;
		Строка.СубконтоКтНУ1 	= Выборка.СубконтоКтНУ1;
		Строка.СубконтоКтНУ2 	= Выборка.СубконтоКтНУ2;
		Строка.СубконтоКтНУ3 	= Выборка.СубконтоКтНУ3;		
		Строка.Сумма			= Выборка.Результат;

	КонецЦикла;

	//vvv спишем рбп
	ТекстПредыдущихПериодов =
	"ВЫБРАТЬ
	|	БУОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	БУОсновныеНачисления.СчетДт КАК СчетДт,
	|	БУОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|	БУОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
	|	БУОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
	|	БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
	|	БУОсновныеНачисления.СубконтоДт4 КАК СубконтоДт4,
	|	БУОсновныеНачисления.СчетДтНУ КАК СчетДтНУ,
	|	БУОсновныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
	|	БУОсновныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
	|	БУОсновныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
	|	&Счет97 КАК СчетКт,
	|	&РБПНаОплатуТруда КАК СубконтоКт1,
	|	NULL КАК СубконтоКт2,
	|	NULL КАК СубконтоКт3,
	|	&СчетН97 КАК СчетКтНУ,
	|	&ОтпускБудПериода КАК СубконтоКтНУ1,
	|	NULL КАК СубконтоКтНУ2,
	|	NULL КАК СубконтоКтНУ3,
	|	БУОсновныеНачисления.Результат / ВЫБОР КОГДА БУОсновныеНачисления.ПериодРегистрации <&ДатаДеноминации ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ КАК СУММА
	|ИЗ
	|	РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
	|ГДЕ
	|	БУОсновныеНачисления.ПериодДействия = &парамПериод
	|	И БУОсновныеНачисления.ПериодРегистрации < &парамПериод
	|	И НЕ БУОсновныеНачисления.СчетДт В ИЕРАРХИИ (&СчетаИсключения)
	|	И БУОсновныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БУДополнительныеНачисления.ПериодРегистрации,
	|	БУДополнительныеНачисления.СчетДт,
	|	БУДополнительныеНачисления.Сотрудник.Физлицо,
	|	БУДополнительныеНачисления.СубконтоДт1,
	|	БУДополнительныеНачисления.СубконтоДт2,
	|	БУДополнительныеНачисления.СубконтоДт3,
	|	БУДополнительныеНачисления.СубконтоДт4,
	|	БУДополнительныеНачисления.СчетДтНУ,
	|	БУДополнительныеНачисления.СубконтоДтНУ1,
	|	БУДополнительныеНачисления.СубконтоДтНУ2,
	|	БУДополнительныеНачисления.СубконтоДтНУ3,
	|	&Счет97,
	|	&РБПНаОплатуТруда,
	|	NULL,
	|	NULL,
	|	&СчетН97,
	|	&ОтпускБудПериода,
	|	NULL,
	|	NULL,
	|	БУДополнительныеНачисления.Результат / ВЫБОР КОГДА БУДополнительныеНачисления.ПериодРегистрации <&ДатаДеноминации ТОГДА 10000 ИНАЧЕ 1 КОНЕЦ
	|ИЗ
	|	РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
	|ГДЕ
	|	БУДополнительныеНачисления.ПериодДействияДоп = &парамПериод
	|	И БУДополнительныеНачисления.ПериодРегистрации < &парамПериод
	|	И НЕ БУДополнительныеНачисления.СчетДт В ИЕРАРХИИ (&СчетаИсключения)
	|	И БУДополнительныеНачисления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРегистрации";
	
	Запрос = Новый Запрос(ТекстПредыдущихПериодов);
	Запрос.УстановитьПараметр("парамПериод", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Запрос.УстановитьПараметр("Облагается", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("Счет97", ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
	Запрос.УстановитьПараметр("СчетН97", ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов);
	//vvv
	//Запрос.УстановитьПараметр("РБПНаОплатуТруда", Справочники.РасходыБудущихПериодов.РБПНаОплатуТруда);
	Запрос.УстановитьПараметр("РБПНаОплатуТруда", Перечисления.ЭлементыЗатрат.ОплатаТруда);
	Запрос.УстановитьПараметр("ДатаДеноминации", ОбщегоНазначения.ПолучитьДатуДеноминации());
	//
	Запрос.УстановитьПараметр("ОтпускБудПериода", Перечисления.ВидыНачисленийОплатыТрудаПоСт255НК.ОплатаОтпускаБуд);
  
	ВыборкаПоРБП=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПоРБП.Следующий() Цикл
		Строка = ОтражениеВУчете.Добавить();
		Строка.СчетДт 			= ВыборкаПоРБП.СчетДт;
		Строка.ФизЛицо 			= ВыборкаПоРБП.ФизЛицо;
		Строка.СубконтоДт1	 	= ВыборкаПоРБП.СубконтоДт1;
		Строка.СубконтоДт2	 	= ВыборкаПоРБП.СубконтоДт2;
		Строка.СубконтоДт3	 	= ВыборкаПоРБП.СубконтоДт3;
		Строка.СубконтоДт4	 	= ВыборкаПоРБП.СубконтоДт4;
		Строка.СчетКт 			= ВыборкаПоРБП.СчетКт;
		Строка.СубконтоКт1	 	= ВыборкаПоРБП.СубконтоКт1;
		Строка.СубконтоКт2	 	= ВыборкаПоРБП.СубконтоКт2;
		Строка.СубконтоКт3	 	= ВыборкаПоРБП.СубконтоКт3;
		Строка.СчетДтНУ			= ВыборкаПоРБП.СчетДтНУ;
		Строка.СубконтоДтНУ1 	= ВыборкаПоРБП.СубконтоДтНУ1;
		Строка.СубконтоДтНУ2 	= ВыборкаПоРБП.СубконтоДтНУ2;
		Строка.СубконтоДтНУ3 	= ВыборкаПоРБП.СубконтоДтНУ3;		
		Строка.СчетКтНУ			= ВыборкаПоРБП.СчетКтНУ;
		Строка.СубконтоКтНУ1 	= ВыборкаПоРБП.СубконтоКтНУ1;
		Строка.СубконтоКтНУ2 	= ВыборкаПоРБП.СубконтоКтНУ2;
		Строка.СубконтоКтНУ3 	= ВыборкаПоРБП.СубконтоКтНУ3;
		Строка.Сумма			= ВыборкаПоРБП.Сумма;
	КонецЦикла;
	//конец по рбп
	// отражение начислений
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	// начало отражения удержаний
	// 

	// БазаСреднегоЗаработка
	//	Поля:
	//		Регистратор
	//		НомерСтроки
	//		СчетДтРазрез
	//		СчетКтРазрез
	//		СубконтоДт1Разрез
	//		СубконтоДт2Разрез
	//		СубконтоДт3Разрез
	//		СубконтоКт1Разрез
	//		СубконтоКт2Разрез
	//		СубконтоКт3Разрез
	//		РезультатБаза
	//

	
	
	// СведенияОбУдержанияхСрез
	//	Поля:
	//		ФизЛицо
	//		ВидРасчета
	//		Период
	// Описание:
 	// вспомогательная таблица для дполучения среза последних значений в регистре УдержанияРаботниковОрганизации
	//

	СведенияОбУдержанияхСрезТекст = 
	"ВЫБРАТЬ
	|	УдержанияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
	|	УдержанияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
	|	МАКСИМУМ(ПлановыеУдержанияРаботниковОрганизаций.Период) КАК Период
	|ПОМЕСТИТЬ ВТСведенияОбУдержаниях
	|ИЗ
	|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
	|		ПО УдержанияРаботниковОрганизации.ФизЛицо = ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо
	|			И УдержанияРаботниковОрганизации.ВидРасчета = ПлановыеУдержанияРаботниковОрганизаций.ВидРасчета
	|ГДЕ
	//vvv
	//|	УдержанияРаботниковОрганизации.Организация = &парамОрганизация
	|	УдержанияРаботниковОрганизации.ОбособленноеПодразделение = &парамОрганизация
	//
	|	И УдержанияРаботниковОрганизации.ПериодРегистрации = &парамПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	УдержанияРаботниковОрганизации.ФизЛицо,
	|	УдержанияРаботниковОрганизации.ВидРасчета";

    //vvv
	СведенияОбОтраженииУдержанийТекст = 
	"ВЫБРАТЬ
	|	УдержанияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
	|	УдержанияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
	|	УдержанияРаботниковОрганизации.ДокументОснование КАК ДокументОснование,
	|	МАКСИМУМ(РеглУчетПлановыхУдержанийРаботниковОрганизаций.Период) КАК Период
	|ПОМЕСТИТЬ ВТСведенияОбОтраженииУдержаний
	|ИЗ
	|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхУдержанийРаботниковОрганизаций КАК РеглУчетПлановыхУдержанийРаботниковОрганизаций
	|		ПО УдержанияРаботниковОрганизации.ФизЛицо = РеглУчетПлановыхУдержанийРаботниковОрганизаций.Сотрудник.ФизЛицо
	|			И УдержанияРаботниковОрганизации.ВидРасчета = РеглУчетПлановыхУдержанийРаботниковОрганизаций.ВидРасчета
	|ГДЕ
	|	УдержанияРаботниковОрганизации.ОбособленноеПодразделение = &парамОрганизация
	|	И УдержанияРаботниковОрганизации.ПериодРегистрации = &парамПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	УдержанияРаботниковОрганизации.ФизЛицо,
	|	УдержанияРаботниковОрганизации.ВидРасчета,
	|	УдержанияРаботниковОрганизации.ДокументОснование";
	
	//
	// ДанныеУчета
	//	Поля:
	//		Регистратор
	//		НомерСтроки
	//		ФизЛицо
	//		ДокументОснование
	//		СчетДт
	//		СчетКт
	//		СубконтоДт1
	//		СубконтоДт2
	//		СубконтоДт3
	//		СубконтоКт1
	//		СубконтоКт2
	//		СубконтоКт3
	//		ВидРасчета
	//		Результат
	// Описание:
	// таблица строится по регистру расчета удержаний с присоединением данных о бухучете
	//
	ДанныеУчетаТекст = 
	"ВЫБРАТЬ
 	|	УдержанияРаботниковОрганизации.Регистратор КАК Регистратор,
 	|	УдержанияРаботниковОрганизации.НомерСтроки КАК НомерСтроки,
 	|	УдержанияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
 	|	УдержанияРаботниковОрганизации.ДокументОснование КАК ДокументОснование,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетДт КОНЕЦ КАК СчетДт,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКт КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетКт КОНЕЦ КАК СчетКт,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1 КОНЕЦ КАК СубконтоДт1,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2 КОНЕЦ КАК СубконтоДт2,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3 КОНЕЦ КАК СубконтоДт3,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт1 КОНЕЦ КАК СубконтоКт1,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт2 КОНЕЦ КАК СубконтоКт2,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт3 КОНЕЦ КАК СубконтоКт3,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетДтНУ КОНЕЦ КАК СчетДтНУ,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКтНУ КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетКтНУ КОНЕЦ КАК СчетКтНУ,	
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1 КОНЕЦ КАК СубконтоДтНУ1,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2 КОНЕЦ КАК СубконтоДтНУ2,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3 КОНЕЦ КАК СубконтоДтНУ3,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ1 КОНЕЦ КАК СубконтоКтНУ1,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ2 КОНЕЦ КАК СубконтоКтНУ2,
	 //|	ВЫБОР КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ3 КОНЕЦ КАК СубконтоКтНУ3,	
	 //vvv
	|	УдержанияРаботниковОрганизации.Получатель КАК Получатель,  
	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СчетДт КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетДт КОНЕЦ КАК СчетДт,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СчетКт КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКт КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКт КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетКт КОНЕЦ КАК СчетКт,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДт1 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1 КОНЕЦ КАК СубконтоДт1,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДт2 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2 КОНЕЦ КАК СубконтоДт2,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДт3 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3 КОНЕЦ КАК СубконтоДт3,
	//vvv
	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДт4 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4 КОНЕЦ КАК СубконтоДт4,
	//
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКт1 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт1 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт1 КОНЕЦ КАК СубконтоКт1,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКт2 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт2 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт2 КОНЕЦ КАК СубконтоКт2,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКт3 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт3 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт3 КОНЕЦ КАК СубконтоКт3,
	//vvv
	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКт4 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт4 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт4 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт4 КОНЕЦ КАК СубконтоКт4,
	//
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СчетДтНУ КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетДтНУ КОНЕЦ КАК СчетДтНУ,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СчетКтНУ КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКтНУ КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКтНУ КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СчетКтНУ КОНЕЦ КАК СчетКтНУ,	
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1 КОНЕЦ КАК СубконтоДтНУ1,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2 КОНЕЦ КАК СубконтоДтНУ2,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3 КОНЕЦ КАК СубконтоДтНУ3,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ1 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ1 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ1 КОНЕЦ КАК СубконтоКтНУ1,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ2 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ2 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ2 КОНЕЦ КАК СубконтоКтНУ2,
 	|	ВЫБОР КОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3 КОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА РеглУчетПлановыхУдержанийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ3 КОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ3 КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ ТОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ3 КОНЕЦ КАК СубконтоКтНУ3,	
	//
 	|	УдержанияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
 	|	УдержанияРаботниковОрганизации.Результат КАК Результат
	|ИЗ
 	|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСведенияОбУдержаниях КАК СведенияОбУдержанияхСрез
	|			ПО СведенияОбУдержанияхСрез.ФизЛицо = ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо И СведенияОбУдержанияхСрез.ВидРасчета = ПлановыеУдержанияРаботниковОрганизаций.ВидРасчета И СведенияОбУдержанияхСрез.Период = ПлановыеУдержанияРаботниковОрганизаций.Период
 	|		ПО ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо = УдержанияРаботниковОрганизации.ФизЛицо И ПлановыеУдержанияРаботниковОрганизаций.ВидРасчета = УдержанияРаботниковОрганизации.ВидРасчета И ПлановыеУдержанияРаботниковОрганизаций.ДокументОснование = УдержанияРаботниковОрганизации.ДокументОснование
	//vvv
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхУдержанийРаботниковОрганизаций КАК РеглУчетПлановыхУдержанийРаботниковОрганизаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСведенияОбОтраженииУдержаний КАК СведенияОбОтраженииУдержанийСрез
	|			ПО СведенияОбОтраженииУдержанийСрез.ФизЛицо = РеглУчетПлановыхУдержанийРаботниковОрганизаций.Сотрудник.ФизЛицо И СведенияОбОтраженииУдержанийСрез.ВидРасчета = РеглУчетПлановыхУдержанийРаботниковОрганизаций.ВидРасчета И СведенияОбОтраженииУдержанийСрез.Период = РеглУчетПлановыхУдержанийРаботниковОрганизаций.Период И (СведенияОбОтраженииУдержанийСрез.ДокументОснование = РеглУчетПлановыхУдержанийРаботниковОрганизаций.ДокументОснование ИЛИ РеглУчетПлановыхУдержанийРаботниковОрганизаций.ДокументОснование=ЗНАЧЕНИЕ(Документ.ИсполнительныйЛист.ПустаяСсылка))	
	|		ПО УдержанияРаботниковОрганизации.ФизЛицо=РеглУчетПлановыхУдержанийРаботниковОрганизаций.Сотрудник.ФизЛицо
	|		И  РеглУчетПлановыхУдержанийРаботниковОрганизаций.ВидРасчета=УдержанияРаботниковОрганизации.ВидРасчета
	|		И (РеглУчетПлановыхУдержанийРаботниковОрганизаций.ДокументОснование=УдержанияРаботниковОрганизации.ДокументОснование ИЛИ РеглУчетПлановыхУдержанийРаботниковОрганизаций.ДокументОснование=ЗНАЧЕНИЕ(Документ.ИсполнительныйЛист.ПустаяСсылка))
	//
	|
	|ГДЕ
	//vvv
 	//|	УдержанияРаботниковОрганизации.Организация = &парамОрганизация И
	|	УдержанияРаботниковОрганизации.ОбособленноеПодразделение = &парамОрганизация И
	//
 	|	УдержанияРаботниковОрганизации.ПериодРегистрации = &парамПериодРегистрации  И
	|	(ПлановыеУдержанияРаботниковОрганизаций.СпособОтраженияВБухучете <> &парамНеОтражать ИЛИ УдержанияРаботниковОрганизации.ВидРасчета.СпособОтраженияВБухучете <> &парамНеОтражать)";



	// ОтражениеВБухучете
	//	Поля:
	//		Регистратор КАК Регистратор,
	//		НомерСтроки КАК НомерСтроки,
	//		ФизЛицо,
	//		СчетДт,
	//		СчетКт,
	//		СубконтоДт1,
	//		СубконтоДт2,
	//		СубконтоДт3,
	//		СубконтоКт1,
	//		СубконтоКт2,
	//		СубконтоКт3,
	//		ВидРасчета
	//		Результат
	//		НомерСубконтоРаботникиДт
 	//		НомерСубконтоРаботникиКт
	//		СчетДтРазрез
	//		СчетКтРазрез
	//		СубконтоДт1Разрез
	//		СубконтоДт2Разрез
	//		СубконтоДт3Разрез
	//		СубконтоКт1Разрез
	//		СубконтоКт2Разрез
	//		СубконтоКт3Разрез
	//		РезультатБаза
	//

	
	ОсновныеСотрудникиТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТОсновныеСотрудники
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|		РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо
	|	ИЗ
	|		ВТСведенияОбУдержаниях КАК СведенияОбУдержанияхСрез
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО СведенияОбУдержанияхСрез.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
	//vvv
	|				И (РаботникиОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
	//
	|				И (РаботникиОрганизаций.Период <= РаботникиОрганизаций.Период)
	|				И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизаций.Сотрудник.Физлицо) КАК СведенияОРаботникеСрез
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО (РаботникиОрганизаций.Сотрудник.Физлицо = СведенияОРаботникеСрез.ФизЛицо)
	//vvv
	|			И (РаботникиОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
	//
	|			И (РаботникиОрганизаций.Период = СведенияОРаботникеСрез.Период)
	|			И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))";
	
	
	
	ОтражениеВБухучетеТекст = 
	//vvv
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	//
	|	ДанныеУчета.Регистратор КАК Регистратор,
	|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
	|	ДанныеУчета.ФизЛицо КАК ФизЛицо,
	|	ДанныеУчета.СчетДт,
	|	ДанныеУчета.СчетКт,
	|	ДанныеУчета.СубконтоДт1,
	|	ДанныеУчета.СубконтоДт2,
	|	ДанныеУчета.СубконтоДт3,
	//vvv
	|	ДанныеУчета.СубконтоДт4,
	//
	|	ДанныеУчета.СубконтоКт1,
	|	ДанныеУчета.СубконтоКт2,
	|	ДанныеУчета.СубконтоКт3,
	//vvv
	|	ДанныеУчета.СубконтоКт4,
	//
	|	ДанныеУчета.СчетДтНУ,
	|	ДанныеУчета.СчетКтНУ,	
	|	ДанныеУчета.СубконтоДтНУ1,
	|	ДанныеУчета.СубконтоДтНУ2,
	|	ДанныеУчета.СубконтоДтНУ3,
	|	ДанныеУчета.СубконтоКтНУ1,
	|	ДанныеУчета.СубконтоКтНУ2,
	|	ДанныеУчета.СубконтоКтНУ3,	
	|	ДанныеУчета.ВидРасчета,
	|	ДанныеУчета.Результат,
	//vvv
	//|	ДанныеУчета.ДокументОснование.Получатель Как Контрагент,
	|	ВЫБОР КОГДА НЕ ДанныеУчета.ДокументОснование.Получатель ЕСТЬ NULL ТОГДА ДанныеУчета.ДокументОснование.Получатель ИНАЧЕ ДанныеУчета.Получатель КОНЕЦ Как Контрагент,
	//
	|	ДанныеУчета.ДокументОснование Как ИсполнительныйДокумент,
	|	ВЫБОР КОГДА (ВидыСубконтоРаботникиДт.НомерСтроки) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВидыСубконтоРаботникиДт.НомерСтроки КОНЕЦ КАК НомерСубконтоРаботникиДт,
 	|	ВЫБОР КОГДА (ВидыСубконтоРаботникиКт.НомерСтроки) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВидыСубконтоРаботникиКт.НомерСтроки КОНЕЦ КАК НомерСубконтоРаботникиКт,
	|	ВЫБОР КОГДА (ВидыСубконтоСотрудникиКт.НомерСтроки) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВидыСубконтоСотрудникиКт.НомерСтроки КОНЕЦ КАК НомерСубконтоСотрудникиКт,
	//vvv
	|	ЕСТЬNULL(ВидыСубконтоКонтрагентыКт.НомерСтроки, 0) КАК НомерСубконтоФизЛицоКакКонтрагентКт,
	|   ДанныеУчета.ФизЛицо.Контрагент КАК ФизЛицоКакКонтрагент,
	//
	|	ВЫБОР КОГДА ДанныеУчета.СчетКт = &СчетРасчетыПоИсполнительнымДокументамРаботников ТОГДА " + мНомерСубконтоКонтрагентыКт + " ИНАЧЕ 0 КОНЕЦ КАК НомерСубконтоКонтрагентыКт,
	|	ВЫБОР КОГДА ДанныеУчета.СчетКт = &СчетРасчетыПоИсполнительнымДокументамРаботников ТОГДА " + мНомерСубконтоИсполнДокументыКт + " ИНАЧЕ 0 КОНЕЦ КАК НомерСубконтоИсполнДокументыКт,
	|	ОсновныеСотрудники.Сотрудник
	|ИЗ
	|	("+ ДанныеУчетаТекст +") КАК ДанныеУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоРаботникиДт
	|		ПО (ДанныеУчета.СчетДт <> &парамПустойСчет) И ДанныеУчета.СчетДт = ВидыСубконтоРаботникиДт.Ссылка И (ВидыСубконтоРаботникиДт.ВидСубконто = &парамРаботники)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоРаботникиКт
	|		ПО (ДанныеУчета.СчетКт <> &парамПустойСчет) И ДанныеУчета.СчетКт = ВидыСубконтоРаботникиКт.Ссылка И (ВидыСубконтоРаботникиКт.ВидСубконто = &парамРаботники)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоСотрудникиКт
	|		ПО (ДанныеУчета.СчетКт <> &парамПустойСчет) И ДанныеУчета.СчетКт = ВидыСубконтоСотрудникиКт.Ссылка И (ВидыСубконтоСотрудникиКт.ВидСубконто = &парамСотрудники)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеСотрудники КАК ОсновныеСотрудники	
	|			ПО ДанныеУчета.ФизЛицо =  ОсновныеСотрудники.ФизЛицо
	//vvv
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоКонтрагентыКт
	|		ПО (ДанныеУчета.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
	|			И ДанныеУчета.СчетКт = ВидыСубконтоКонтрагентыКт.Ссылка
	|			И (ВидыСубконтоКонтрагентыКт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты))
	//
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеУчета.Регистратор,
	|	ДанныеУчета.НомерСтроки";


	Запрос = Новый Запрос();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";
	Запрос.УстановитьПараметр("парамИзмерения", Измерения);

	Разрезы = Новый Массив(18);
	Разрезы[0]	= "СчетДт";
	Разрезы[1]	= "СубконтоДт1";
	Разрезы[2]	= "СубконтоДт2";
	Разрезы[3]	= "СубконтоДт3";
	//vvv
	Разрезы[4]	= "СубконтоДт4";
	//
	Разрезы[5]	= "СчетКт";
	Разрезы[6]	= "СубконтоКт1";
	Разрезы[7]	= "СубконтоКт2";
	Разрезы[8]	= "СубконтоКт3";
	//vvv
	Разрезы[9]	= "СубконтоКт4";
	//
	Разрезы[10]	= "СчетДтНУ";
	Разрезы[11]	= "СубконтоДтНУ1";
	Разрезы[12]	= "СубконтоДтНУ2";
	Разрезы[13]	= "СубконтоДтНУ3";
	Разрезы[14]	= "СчетКтНУ";
	Разрезы[15]	= "СубконтоКтНУ1";
	Разрезы[16]	= "СубконтоКтНУ2";
	Разрезы[17]	= "СубконтоКтНУ3";	
	
	Запрос.УстановитьПараметр("парамРазрезыБУ", Разрезы);

	Запрос.УстановитьПараметр("парамПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
 	Запрос.УстановитьПараметр("парамРаботники", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации);
	Запрос.УстановитьПараметр("парамСотрудники", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций);

	Запрос.УстановитьПараметр("парамПоСреднемуЗаработку", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПустойСпособБУ", Справочники.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("СчетРасчетыПоИсполнительнымДокументамРаботников", ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников);
    Запрос.УстановитьПараметр("парамНеОтражать", Справочники.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете);

	СпособПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию;

	Запрос.Текст = СведенияОбУдержанияхСрезТекст;
	Запрос.Выполнить();
	
	//vvv
	Запрос.Текст = СведенияОбОтраженииУдержанийТекст;
	Запрос.Выполнить();
	//
	
	Запрос.Текст = ОсновныеСотрудникиТекст;
	Запрос.Выполнить();

	
	Запрос.Текст = ОтражениеВБухучетеТекст;
	РезультатДанныеУчета = Запрос.Выполнить();


	// пустая ссылка на счет - для проверок способов отражения в бухучете
	ПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	ПустойСчетНУ = ПланыСчетов.Налоговый.ПустаяСсылка();

	// основная выборка - по ней ведем обход и вводим записи движений
	ДанныеУчета = РезультатДанныеУчета.Выбрать();
	Если Не ДанныеУчета.Следующий() Тогда
		ПродолжатьОбработку = Ложь;
	Иначе
		ПродолжатьОбработку = Истина;
	КонецЕсли;

	// вспомогательная выборка - по ней ведем суммирование базовых результатов
	ДанныеУчетаВспомогательные = РезультатДанныеУчета.Выбрать();

	// структура поиска для позиционирования в ДанныеНалоговогоУчетаВспомогательные
	// при необходимости суммирования "базовых2 ресурсов
	СтруктураПоиска = Новый Структура("Регистратор,НомерСтроки");

	Пока ПродолжатьОбработку Цикл
		СтрокаДанных = СоздатьСтрокуПромежуточнойТаблицы(ДанныеУчета, ПромежуточнаяТаблица, ПустойСчет);

		// выполним автозаполнение субконто если это предусмотрено способом отражения в бухучете
		// при этом отработаем только записи, которые получены из запроса
		// если не пустой счет - заполним "автозаполняемые" субконто
		Если ДанныеУчета.СчетДт <> ПустойСчет Тогда
			Если ДанныеУчета.НомерСубконтоРаботникиДт <> 0 Тогда
				Субконто = ДанныеУчета[НомерДт + ДанныеУчета.НомерСубконтоРаботникиДт];
				Если не ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоДт" + ДанныеУчета.НомерСубконтоРаботникиДт] = ДанныеУчета.Физлицо;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ДанныеУчета.СчетКт <> ПустойСчет Тогда
 			Если ДанныеУчета.НомерСубконтоРаботникиКт <> 0 Тогда
 				Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоРаботникиКт];
				Если не ЗначениеЗаполнено(Субконто) Тогда
 					СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоРаботникиКт] = ДанныеУчета.Физлицо;
				КонецЕсли;
			КонецЕсли;
			Если ДанныеУчета.НомерСубконтоСотрудникиКт <> 0 Тогда
 				Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоСотрудникиКт];
				Если не ЗначениеЗаполнено(Субконто) Тогда
 					СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоСотрудникиКт] = ДанныеУчета.Сотрудник;
				КонецЕсли;
			КонецЕсли;
			Если ДанныеУчета.НомерСубконтоКонтрагентыКт <> 0 Тогда
				Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоКонтрагентыКт];
				Если не ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоКонтрагентыКт] = ДанныеУчета.Контрагент;
				КонецЕсли;
			КонецЕсли;
			Если ДанныеУчета.НомерСубконтоИсполнДокументыКт <> 0 Тогда
				Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоИсполнДокументыКт];
				Если не ЗначениеЗаполнено(Субконто) Тогда
					СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоИсполнДокументыКт] = ДанныеУчета.ИсполнительныйДокумент;
				КонецЕсли;
			КонецЕсли;
			//vvv
			Если ДанныеУчета.НомерСубконтоФизЛицоКакКонтрагентКт <> 0 Тогда
				Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоФизЛицоКакКонтрагентКт];
				Если (не ЗначениеЗаполнено(Субконто)) И (Не ЗначениеЗаполнено(СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоФизЛицоКакКонтрагентКт])) Тогда
					СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоФизЛицоКакКонтрагентКт] = ДанныеУчета.ФизЛицоКакКонтрагент;
				КонецЕсли;
			КонецЕсли;
			//
		КонецЕсли;

		// обработаем записи с точки зрения ЕНВД
		// если задана конкретная проводка и задан процент ЕНВД
		Если ДанныеУчета.СчетДт = ПустойСчет ИЛИ ДанныеУчета.СчетКт = ПустойСчет Тогда
			// вычисляем результат нормируя его на базу для строк базы относящихся 
			// к одной строке основного регистра

			// текущий ключ поиска 
			ТекущийРегистратор = ДанныеУчета.Регистратор;
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			// позиционируемся во вспомогательной выборке по запросу для суммирования "базовых" данных
			СтруктураПоиска.Регистратор = ТекущийРегистратор;
			СтруктураПоиска.НомерСтроки = ТекущийНомерСтроки;
			Если 	ДанныеУчетаВспомогательные.Регистратор <> ТекущийРегистратор ИЛИ 
					ДанныеУчетаВспомогательные.НомерСтроки <> ТекущийНомерСтроки Тогда
				// ищем следующую строку во спомогательной выборке если она не является искомой	
				ДанныеУчетаВспомогательные.НайтиСледующий(СтруктураПоиска);
			КонецЕсли;

			СуммаПоСтроке = 0;
			// суммируем базовые ресурсы по текущей строке набора записей
			Пока ДанныеУчетаВспомогательные.Регистратор = ТекущийРегистратор И ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
				Если ДанныеУчетаВспомогательные.РезультатБаза = NULL Тогда
					Успешно = Ложь;
				Иначе
					СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатБаза;
				КонецЕсли;
				Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;

			// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
			СуммарнаяДоля = 0;
			// полный результат
			ПолныйРезультат = ДанныеУчета.Результат;
			// обходим строки и вычисляем долю результата по базовым записям
			ПерваяИзГруппыСтрок = Истина;
			Пока ДанныеУчета.Регистратор = ТекущийРегистратор И ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
				// если это не первая из группы "базовых" строк по одной строке основного регистра
				// то создаем очередную строку движений
				Если Не ПерваяИзГруппыСтрок Тогда
					СтрокаДанных = СоздатьСтрокуПромежуточнойТаблицы(ДанныеУчета, ПромежуточнаяТаблица, ПустойСчет);
				Иначе
					ПерваяИзГруппыСтрок = Ложь;
				КонецЕсли;

				Если СуммаПоСтроке = 0 Тогда
					Доля = 0;
				Иначе
					Если ДанныеУчета.РезультатБаза = NULL Тогда
						Успешно = Ложь;
						Доля = 0;
					Иначе
						Доля = ПолныйРезультат * ДанныеУчета.РезультатБаза / СуммаПоСтроке;
					КонецЕсли;
				КонецЕсли;

				// если счет пустой - заполним счет данными базы
				Если ДанныеУчета.СчетДт = ПустойСчет Тогда
					Если ДанныеУчета.СчетДтРазрез = NULL Тогда
						Успешно = Ложь;
					Иначе
						СтрокаДанных.СчетДт 	 	= ДанныеУчета.СчетДтРазрез;
						СтрокаДанных.СубконтоДт1 	= ДанныеУчета.СубконтоДт1Разрез;
						СтрокаДанных.СубконтоДт2 	= ДанныеУчета.СубконтоДт2Разрез;
						СтрокаДанных.СубконтоДт3 	= ДанныеУчета.СубконтоДт3Разрез;						
						//vvv
						СтрокаДанных.СубконтоДт4 	= ДанныеУчета.СубконтоДт4Разрез;						
						//
					КонецЕсли;
				КонецЕсли;
				
				// если счет пустой - заполним счет данными базы
				Если ДанныеУчета.СчетДтНУ = ПустойСчетНУ Тогда
					Если ДанныеУчета.СчетДтНУРазрез = NULL Тогда
						Успешно = Ложь;
					Иначе								
						СтрокаДанных.СчетДтНУ 	 	= ДанныеУчета.СчетДтНУРазрез;
						СтрокаДанных.СубконтоДтНУ1 	= ДанныеУчета.СубконтоДтНУ1Разрез;
						СтрокаДанных.СубконтоДтНУ2 	= ДанныеУчета.СубконтоДтНУ2Разрез;
						СтрокаДанных.СубконтоДтНУ3 	= ДанныеУчета.СубконтоДтНУ3Разрез;
					КонецЕсли;
				КонецЕсли;
				
				// если счет пустой - заполним счет данными базы
				Если ДанныеУчета.СчетКт = ПустойСчет Тогда
					Если ДанныеУчета.СчетКтРазрез = NULL Тогда
						Успешно = Ложь;
					Иначе
						СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
						СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
						СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
						//vvv
						СтрокаДанных.СубконтоКт4 = ДанныеУчета.СубконтоКт4Разрез;
						//
					КонецЕсли;
				КонецЕсли;
				
				// если счет пустой - заполним счет данными базы
				Если ДанныеУчета.СчетКтНУ = ПустойСчетНУ Тогда
					Если ДанныеУчета.СчетКтНУРазрез = NULL Тогда
						Успешно = Ложь;
					Иначе
						СтрокаДанных.СчетКтНУ		= ДанныеУчета.СчетКтНУРазрез;
						СтрокаДанных.СубконтоКтНУ1	= ДанныеУчета.СубконтоКтНУ1Разрез;
						СтрокаДанных.СубконтоКтНУ2	= ДанныеУчета.СубконтоКтНУ2Разрез;
						СтрокаДанных.СубконтоКтНУ3	= ДанныеУчета.СубконтоКтНУ3Разрез;
					КонецЕсли;
				КонецЕсли;				

				СтрокаДанных.Сумма = Доля;
				СуммарнаяДоля = СуммарнаяДоля + Доля;
				Если Не ДанныеУчета.Следующий() Тогда
					ПродолжатьОбработку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// ошибки округления скаладываются на последнюю запись из группы базовых записей
			СтрокаДанных.Сумма = СтрокаДанных.Сумма + ПолныйРезультат - СуммарнаяДоля;
		Иначе
			Если Не ДанныеУчета.Следующий() Тогда
				ПродолжатьОбработку = Ложь;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	//vvv комментируем, добавляем физлицо
	//ПромежуточнаяТаблица.Свернуть("СчетДт,СчетКт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоДт4,СубконтоКт1,СубконтоКт2,СубконтоКт3,СубконтоКт4,СчетДтНУ,СчетКтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3", "Сумма");
	ПромежуточнаяТаблица.Свернуть("СчетДт,СчетКт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоДт4,СубконтоКт1,СубконтоКт2,СубконтоКт3,СубконтоКт4,СчетДтНУ,СчетКтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3,ФизЛицо,ПериодРБПНалогов", "Сумма");
	//
	
	Для Каждого СтрокаТаблицы Из ПромежуточнаяТаблица Цикл
		Строка = ОтражениеВУчете.Добавить();
		Строка.СчетДт 			= СтрокаТаблицы.СчетДт;
		Строка.СубконтоДт1	 	= СтрокаТаблицы.СубконтоДт1;
		Строка.СубконтоДт2	 	= СтрокаТаблицы.СубконтоДт2;
		Строка.СубконтоДт3	 	= СтрокаТаблицы.СубконтоДт3;
		//vvv
		Строка.СубконтоДт4	 	= СтрокаТаблицы.СубконтоДт4;
		Строка.ФизЛицо	 		= СтрокаТаблицы.ФизЛицо;
		Строка.ПериодРБПНалогов	= СтрокаТаблицы.ПериодРБПНалогов;
		//
		Строка.СчетКт 			= СтрокаТаблицы.СчетКт;
		Строка.СубконтоКт1	 	= СтрокаТаблицы.СубконтоКт1;
		Строка.СубконтоКт2	 	= СтрокаТаблицы.СубконтоКт2;
		Строка.СубконтоКт3	 	= СтрокаТаблицы.СубконтоКт3;
		//vvv
		Строка.СубконтоКт4	 	= СтрокаТаблицы.СубконтоКт4;
		//
		Строка.СчетДтНУ			= СтрокаТаблицы.СчетДтНУ;
		Строка.СубконтоДтНУ1 	= СтрокаТаблицы.СубконтоДтНУ1;
		Строка.СубконтоДтНУ2 	= СтрокаТаблицы.СубконтоДтНУ2;
		Строка.СубконтоДтНУ3 	= СтрокаТаблицы.СубконтоДтНУ3;		
		Строка.СчетКтНУ			= СтрокаТаблицы.СчетКтНУ;
		Строка.СубконтоКтНУ1 	= СтрокаТаблицы.СубконтоКтНУ1;
		Строка.СубконтоКтНУ2 	= СтрокаТаблицы.СубконтоКтНУ2;
		Строка.СубконтоКтНУ3 	= СтрокаТаблицы.СубконтоКтНУ3;
		Строка.Сумма			= СтрокаТаблицы.Сумма;
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	// отражение НДФЛ
	
	// НДФЛИсчисленный
	// Поля:
	//		Физлицо
	//		Налог
	// Описание:
	// Содержит НДФЛ исчимленный для заданной организации в заданном периоде регистрации
	
	НДФЛИсчисленныйТекст = 
	"ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.ФизЛицо,
	//vvv
	//|	НДФЛРасчетыСБюджетом.ФизЛицо.ИМНС КАК ИМНС,
	|	НДФЛРасчетыСБюджетом.ФизЛицо.РегистрацияВНалоговомОргане КАК ИМНС,
	//
	|	СУММА(ВЫБОР
	|			КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = &парамНачисление
	|				ТОГДА НДФЛРасчетыСБюджетом.Налог
	|			ИНАЧЕ -НДФЛРасчетыСБюджетом.Налог
	|		КОНЕЦ) КАК Налог
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	//vvv
	//|	(НДФЛРасчетыСБюджетом.Период >= &парамНачалоМесяца И НДФЛРасчетыСБюджетом.Период <= &парамКонецМесяца И НДФЛРасчетыСБюджетом.Организация = &парамОбособленноеПодразделение И (НЕ НДФЛРасчетыСБюджетом.Регистратор ССЫЛКА Документ.НДФЛиЕСНДоходыИНалоги) И НДФЛРасчетыСБюджетом.ВидСтроки = &парамНачисление ИЛИ НДФЛРасчетыСБюджетом.ВидСтроки = &парамПереданоНаВзыскание)
	|	(НДФЛРасчетыСБюджетом.Период >= &парамНачалоМесяца И НДФЛРасчетыСБюджетом.Период <= &парамКонецМесяца И НДФЛРасчетыСБюджетом.ОбособленноеПодразделение = &парамОбособленноеПодразделение И (НЕ НДФЛРасчетыСБюджетом.Регистратор ССЫЛКА Документ.НДФЛиЕСНДоходыИНалоги) И НДФЛРасчетыСБюджетом.ВидСтроки = &парамНачисление ИЛИ НДФЛРасчетыСБюджетом.ВидСтроки = &парамПереданоНаВзыскание)
	//
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛРасчетыСБюджетом.ФизЛицо";

	
	Запрос = Новый Запрос(НДФЛИсчисленныйТекст);
	
	Запрос.УстановитьПараметр("парамНачалоМесяца", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяца", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамНачисление", Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
	Запрос.УстановитьПараметр("парамПереданоНаВзыскание", Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ПереданоНаВзыскание);
	
 	Выборка = Запрос.Выполнить().Выбрать();
	
	СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
	СчетКредита = ?(ЗначениеЗаполнено(УчетнаяПолитика.СчетУчетаНДФЛБУ),УчетнаяПолитика.СчетУчетаНДФЛБУ,ПланыСчетов.Хозрасчетный.НДФЛ);
	СубконтоКредита = ?(ЗначениеЗаполнено(УчетнаяПолитика.СубконтоНДФЛБУ1),УчетнаяПолитика.СубконтоНДФЛБУ1,Перечисления.ВидыПлатежейВГосБюджет.Налог);
	
	Пока Выборка.Следующий() Цикл
		Строка = ОтражениеВУчете.Добавить();
		Строка.СчетДт 		= СчетДебета;
		Строка.СубконтоДт1 	= Выборка.Физлицо;
		Строка.СчетКт 		= СчетКредита;
		Строка.СубконтоКт1 	= СубконтоКредита;
		//vvv
		Строка.Физлицо 	= Выборка.Физлицо;
		//Если СчетКредита.ВидыСубконто[0].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные["Контрагенты"] Тогда
		//	СубконтоКредита = Выборка.ИМНС;						
		//КонецЕсли;
		//раскомментировать, когда в 7.7 появится новое субконто "Регистрация в налоговом органе"
		Если СчетКредита.ВидыСубконто[1].ВидСубконто=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные["РегистрацияВНалоговомОргане"] Тогда
			Строка.СубконтоКт2 = Выборка.ИМНС;						
		КонецЕсли;
		//
		Строка.Сумма		= Выборка.Налог;
	КонецЦикла;
	
	
	// конец отражения НДФЛ
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	// отражение погашения займов
	//
	
	ПогашениеЗаймовТекст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Погашение.ВидДвижения = &Расход
	|				ТОГДА Погашение.ОсновнойДолг
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОсновнойДолг,
	|	СУММА(ВЫБОР
	|			КОГДА Погашение.ВидДвижения = &Расход
	|				ТОГДА Погашение.Проценты
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПроцентыУдержано,
	|	СУММА(ВЫБОР
	|			КОГДА Погашение.ВидДвижения = &Расход
	|				ТОГДА 0
	|			ИНАЧЕ Погашение.Проценты
	|		КОНЕЦ) КАК ПроцентыНачислено,
	|	Погашение.ФизЛицо,
	|	Погашение.ДоговорЗайма.СчетУчетаПроцентовПоЗайму,
	|	Погашение.ДоговорЗайма.Субконто1,
	|	Погашение.ДоговорЗайма.Субконто2,
	|	Погашение.ДоговорЗайма.Субконто3
	|ИЗ
	|	РегистрНакопления.ПогашениеЗаймовРаботникамиОрганизаций КАК Погашение
	|ГДЕ
	|	Погашение.Период МЕЖДУ &парамНачалоМесяца И &парамКонецМесяца
	|	И Погашение.Организация = &парамОбособленноеПодразделение
	|	И Погашение.УдержаноИзЗарплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	Погашение.ФизЛицо,
	|	Погашение.ДоговорЗайма.СчетУчетаПроцентовПоЗайму,
	|	Погашение.ДоговорЗайма.Субконто1,
	|	Погашение.ДоговорЗайма.Субконто2,
	|	Погашение.ДоговорЗайма.Субконто3";

	Запрос = Новый Запрос(ПогашениеЗаймовТекст);
	
	Запрос.УстановитьПараметр("парамНачалоМесяца", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяца", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
	СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыПоПредоставленнымЗаймам;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОсновнойДолг <> 0 Тогда
			Строка = ОтражениеВУчете.Добавить();
			Строка.СчетДт 		= СчетДебета;
			Строка.СубконтоДт1 	= Выборка.Физлицо;
			//vvv
			Строка.Физлицо 		= Выборка.Физлицо;
			//
			Строка.СчетКт 		= СчетКредита;
			Строка.СубконтоКт1 	= Выборка.Физлицо;
			Строка.Сумма		= Выборка.ОсновнойДолг;
		КонецЕсли;
		
		Если Выборка.ПроцентыУдержано <> 0 Тогда
			Строка = ОтражениеВУчете.Добавить();
			Строка.СчетДт 		= СчетДебета;
			Строка.СубконтоДт1 	= Выборка.Физлицо;
			//vvv
			Строка.Физлицо 		= Выборка.Физлицо;
			//
			Строка.СчетКт 		= СчетКредита;
			Строка.СубконтоКт1 	= Выборка.Физлицо;
			Строка.Сумма		= Выборка.ПроцентыУдержано;
		КонецЕсли;
		
		Если Выборка.ПроцентыНачислено <> 0 Тогда
			Строка = ОтражениеВУчете.Добавить();
			Строка.СчетДт 		= СчетКредита;
			Строка.СубконтоДт1 	= Выборка.Физлицо;
			//vvv
			Строка.Физлицо 		= Выборка.Физлицо;
			//
			Строка.СчетКт 		= Выборка.ДоговорЗаймаСчетУчетаПроцентовПоЗайму;
			Строка.СубконтоКт1 	= Выборка.ДоговорЗаймаСубконто1;
			Строка.СубконтоКт2 	= Выборка.ДоговорЗаймаСубконто2;
			Строка.СубконтоКт3 	= Выборка.ДоговорЗаймаСубконто3;
			Строка.Сумма		= Выборка.ПроцентыНачислено;
		КонецЕсли;
		
	КонецЦикла;
	
	//
	// отражение погашения займов
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	// удалим временные наборы записей
 	Для Каждого Набор Из Движения Цикл
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУОсновныеНачисления") 
			или ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.БУДополнительныеНачисления") Тогда
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	
	//vvv
	ЗаписьЖурналаРегистрации("ОтражениеВУчете.АвтозаполнениеПроводок",УровеньЖурналаРегистрации.Информация,Метаданные.Документы.ОтражениеЗарплатыВРеглУчете,Ссылка,"Окончание автозаполнения проводок "+Строка(ТекущаяДата())+".Затраченное время "+СервисныеПроцедурыИФункции.РазностьВремени(ТекущаяДата(),НачалоАвтозаполненияПроводок));
	//
КонецПроцедуры  // АвтозаполнениеПроводок

// Получает значение субконто в том случае, если заданы правила его переопределения
//
// Параметры
//  Субконто - начальное значение субконто
//  ПараметрыПолученияСубконто - соответсвие, 
//                              ключ соответсвия - тип, 
//                              значение - параметры, которые помогают преобразовывать 
//                              субконто соотв. типа из одного значения в другое
//
// Возвращаемое значение:
//   Субконто
// Если для субконто некоторого типа не задаы параметры преобразования, то его 
// значение не изменяется
//
Функция ПолучитьСубконто(Субконто, ПараметрыПолученияСубконто)
	//vvv
	Если Не ЗначениеЗаполнено(Субконто) Тогда
		Возврат Субконто;
	КонецЕсли;
	Если ПараметрыПолученияСубконто = Неопределено Тогда
		Возврат Субконто;
	КонецЕсли;
	//
    Параметры = ПараметрыПолученияСубконто[ТипЗнч(Субконто)];
    Если Параметры = НеОпределено Тогда
        // для субконто этого типа не заданы парамтры переопределения
        Возврат Субконто;
    КонецЕсли;
    // для статьи затрат
    Если ТипЗнч(Субконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
        ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Справочники.СтатьиЗатрат.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
	//vvv
	ИначеЕсли ТипЗнч(Субконто) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Субконто) = Тип("СправочникСсылка.СтатьиКалькуляции") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Справочники.СтатьиКалькуляции.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Субконто) = Тип("СправочникСсылка.СтатьиПрибыли") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Справочники.СтатьиПрибыли.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Справочники.НоменклатурныеГруппы.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Субконто) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, ПланыСчетов.Хозрасчетный.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Субконто) = Тип("ПеречислениеСсылка.ЭлементыЗатрат") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
        ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
        КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
        Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
        Если Строки.Количество() = 0 Тогда
            КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Перечисления.ЭлементыЗатрат.ПустаяСсылка());
            Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
            Если Строки.Количество() = 0 Тогда
                Возврат Субконто;
            Иначе
                Возврат Строки[0].СтатьяЗатрат;
            КонецЕсли;
        Иначе
            Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;	
	//
    // для получения субконто другого типа - дописываем ИначеЕсли...
    Иначе
        Возврат Субконто;
    КонецЕсли;
    
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список начислений и последовательность обработки
// при получении данных
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьТаблицуНачислений()

	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""Основные"" КАК ВидНачисления,
	|	ВЫБОР
	|		КОГДА ОсновныеНачисления.ВидРасчета.КатегорияНачисления = ЗНАЧЕНИЕ(Справочник.КатегорииРасчетов.Первичное)
	|			ТОГДА ""00000""
	|		КОГДА ОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ)
	|			ТОГДА ОсновныеНачисления.ВидРасчета.КатегорияНачисления.Код
	|		КОГДА ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете <> ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
	|			ТОГДА ""00000""
	|		ИНАЧЕ ОсновныеНачисления.ВидРасчета.КатегорияНачисления.Код
	|	КОНЕЦ КАК ПорядокРасчета,
	|	ОсновныеНачисления.ВидРасчета
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|	ГДЕ
	|		ОсновныеНачисления.ПериодРегистрации = &ПериодРегистрации
	|		И ОсновныеНачисления.ОбособленноеПодразделение = &Организация) КАК ОсновныеНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Дополнительные"",
	|	ВЫБОР
	|		КОГДА ДополнительныеНачисления.ВидРасчета.КатегорияНачисления = ЗНАЧЕНИЕ(Справочник.КатегорииРасчетов.Первичное)
	|				ИЛИ ДополнительныеНачисления.ВидРасчета.СтратегияОтраженияВУчете <> ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
	|			ТОГДА ""00000""
	|		ИНАЧЕ ДополнительныеНачисления.ВидРасчета.КатегорияНачисления.Код
	|	КОНЕЦ,
	|	ДополнительныеНачисления.ВидРасчета
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
	|		И ДополнительныеНачисления.ОбособленноеПодразделение = &Организация) КАК ДополнительныеНачисления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРасчета";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", Организация); 
	
	ТаблицаНачислений = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблицаНачислений;

КонецФункции // ПолучитьТаблицуНачислений()

// автозаполнение субконто по данным строки 
Процедура АвтозаполнениеСубконто(ДанныеУчета, СтрокаДанных, ПустойСчет)
	// если не пустой счет - заполним "автозаполняемые" субконто
	Если ДанныеУчета.СчетДт <> ПустойСчет Тогда
		Если ДанныеУчета.НомерСубконтоРаботникиДт <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДт" + ДанныеУчета.НомерСубконтоРаботникиДт]) Тогда
				СтрокаДанных["СубконтоДт" + ДанныеУчета.НомерСубконтоРаботникиДт] = ДанныеУчета.Физлицо;
		КонецЕсли;
		Если ДанныеУчета.НомерСубконтоРаботникиДтНУ <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДтНУ" + ДанныеУчета.НомерСубконтоРаботникиДтНУ]) Тогда
				СтрокаДанных["СубконтоДтНУ" + ДанныеУчета.НомерСубконтоРаботникиДтНУ] = ДанныеУчета.Физлицо;
		КонецЕсли;
		Если ДанныеУчета.НомерСубконтоПодразделенияДт <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДт" + ДанныеУчета.НомерСубконтоПодразделенияДт]) Тогда
				СтрокаДанных["СубконтоДт" + ДанныеУчета.НомерСубконтоПодразделенияДт] = ДанныеУчета.ПодразделениеОрганизации;
		КонецЕсли;
		//vvv
		Если ДанныеУчета.НомерСубконтоАвтомобилиДт <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДт" + ДанныеУчета.НомерСубконтоАвтомобилиДт]) Тогда
				СтрокаДанных["СубконтоДт" + ДанныеУчета.НомерСубконтоАвтомобилиДт] = ДанныеУчета.Автомобиль;
		КонецЕсли;
		//
		//Если ДанныеУчета.НомерСубконтоПодразделенияДтНУ <> 0 
		//	и НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДтНУ" + ДанныеУчета.НомерСубконтоПодразделенияДтНУ]) Тогда
		//		СтрокаДанных["СубконтоДтНУ" + ДанныеУчета.НомерСубконтоПодразделенияДтНУ] = ДанныеУчета.ПодразделениеОрганизации;
		//КонецЕсли;
	КонецЕсли;
	//vvv
	Если ДанныеУчета.СчетДтНалогов <> ПустойСчет Тогда
		Если ДанныеУчета.НомерСубконтоПодразделенияДтНалогов <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДтНалогов" + ДанныеУчета.НомерСубконтоПодразделенияДтНалогов]) Тогда
				СтрокаДанных["СубконтоДтНалогов" + ДанныеУчета.НомерСубконтоПодразделенияДтНалогов] = ДанныеУчета.ПодразделениеОрганизации;
		КонецЕсли;
		Если ДанныеУчета.НомерСубконтоАвтомобилиДтНалогов <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДтНалогов" + ДанныеУчета.НомерСубконтоАвтомобилиДтНалогов]) Тогда
				СтрокаДанных["СубконтоДтНалогов" + ДанныеУчета.НомерСубконтоАвтомобилиДтНалогов] = ДанныеУчета.Автомобиль;
		КонецЕсли;	
	КонецЕсли;
	Если ДанныеУчета.СчетДтСотрудника <> ПустойСчет Тогда
		Если ДанныеУчета.НомерСубконтоПодразделенияДтСотрудника <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДтСотрудника" + ДанныеУчета.НомерСубконтоПодразделенияДтСотрудника]) Тогда
				СтрокаДанных["СубконтоДтСотрудника" + ДанныеУчета.НомерСубконтоПодразделенияДтСотрудника] = ДанныеУчета.ПодразделениеОрганизации;
		КонецЕсли;
		Если ДанныеУчета.НомерСубконтоАвтомобилиДтСотрудника <> 0 
			И НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоДтСотрудника" + ДанныеУчета.НомерСубконтоАвтомобилиДтСотрудника]) Тогда
				СтрокаДанных["СубконтоДтСотрудника" + ДанныеУчета.НомерСубконтоАвтомобилиДтСотрудника] = ДанныеУчета.Автомобиль;
		КонецЕсли;	
	КонецЕсли;
	//
	Если ДанныеУчета.СчетКт <> ПустойСчет Тогда
 		Если ДанныеУчета.НомерСубконтоРаботникиКт <> 0 
			и НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоКт" + ДанныеУчета.НомерСубконтоРаботникиКт]) Тогда
 				СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоРаботникиКт] = ДанныеУчета.Физлицо;
		КонецЕсли;
	  Если ДанныеУчета.НомерСубконтоРаботникиКтНУ <> 0 
	    	и НЕ ЗначениеЗаполнено(ДанныеУчета["СубконтоКтНУ" + ДанныеУчета.НомерСубконтоРаботникиКтНУ]) Тогда
	    		СтрокаДанных["СубконтоКтНУ" + ДанныеУчета.НомерСубконтоРаботникиКтНУ] = ДанныеУчета.Физлицо;
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  // АвтозаполнениеСубконто

// Выделяет коэффициенты отражения из массива переданных строк отражения
//
// Параметры
//  МассивСтрокОтражения - массив строк таблицы значений
//  ИмяКолонки - строка - имя колонки таблицы значений, содержащей 
//                 коэффициенты отражения
//
// Возвращаемое значение:
//   массив чисел - коэффициентов отражения
//
Функция ВыделитьКоэффициентыОтраженияИзМассиваСтрок(МассивСтрокОтражения,ИмяКолонки)
	
	Коэффициенты = Новый Массив;
	
	Для каждого СтрокаОтражения Из МассивСтрокОтражения Цикл
		Коэффициенты.Добавить(СтрокаОтражения[ИмяКолонки]);
	КонецЦикла; 
	
	Возврат Коэффициенты
КонецФункции // ВыделитьКоэффициентыОтраженияИзМассиваСтрок()

// получение  данных для бухучета
// Параметры:
//  СписокНачислений - список начислений, которве необходимо обработать
//  ЭтоОсновныеНачисления - булево, если Истина, то получаем данные по основным начислениям иначе - по доп.
//
// Возвращаемое значение:
//  Результат запроса
// 
Функция ПолучитьДанныеУчета(СписокНачислений, ЭтоОсновныеНачисления, ЭтоПервичныеНачисления)

	Запрос = Новый Запрос;

	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";

	Запрос.УстановитьПараметр("парамИзмерения", Измерения);
	
	Запрос.УстановитьПараметр("парамСписокНачислений", СписокНачислений);
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("парамЕстьЕНВД", мЕНВД);
	
	Разрезы = Новый Массив(18);
	Разрезы[0] = "СчетДт";
	Разрезы[1] = "СубконтоДт1";
	Разрезы[2] = "СубконтоДт2";
	Разрезы[3] = "СубконтоДт3";
	//vvv
	Разрезы[4] = "СубконтоДт4";
	//
	Разрезы[5] = "СчетКт";
	Разрезы[6] = "СубконтоКт1";
	Разрезы[7] = "СубконтоКт2";
	Разрезы[8] = "СубконтоКт3";
	//vvv
	Разрезы[9] = "СубконтоКт4";
	//
	Разрезы[10] = "СчетДтНУ";
	Разрезы[11] = "СубконтоДтНУ1";
	Разрезы[12] = "СубконтоДтНУ2";
	Разрезы[13] = "СубконтоДтНУ3";
	Разрезы[14] = "СчетКтНУ";
	Разрезы[15] = "СубконтоКтНУ1";
	Разрезы[16] = "СубконтоКтНУ2";
	Разрезы[17] = "СубконтоКтНУ3";
	
	Запрос.УстановитьПараметр("парамРазрезыБУ", Разрезы);
   	Запрос.УстановитьПараметр("парамПустойСпособБУ", Справочники.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПустойСчетНУ", ПланыСчетов.Налоговый.ПустаяСсылка());
 	Запрос.УстановитьПараметр("парамРаботники", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации);
 	Запрос.УстановитьПараметр("ВидНачисленийОплатыТрудаПоСтатье255НК", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидНачисленийОплатыТрудаПоСтатье255НК);
	Запрос.УстановитьПараметр("парамПодразделения", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения);
  	Запрос.УстановитьПараметр("парамСтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);

	СпособПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию;
	
	Запрос.УстановитьПараметр("парамСпособПоУмолчанию", СпособПоУмолчанию);
	Запрос.УстановитьПараметр("парамСпособНеОтражать", Справочники.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСчетДт", СпособПоУмолчанию.СчетДт);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСчетКт", СпособПоУмолчанию.СчетКт);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт1", СпособПоУмолчанию.СубконтоДт1);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт2", СпособПоУмолчанию.СубконтоДт2);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт3", СпособПоУмолчанию.СубконтоДт3);
	//vvv
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт4", СпособПоУмолчанию.СубконтоДт4);
	//
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКт1", СпособПоУмолчанию.СубконтоКт1);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКт2", СпособПоУмолчанию.СубконтоКт2);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКт3", СпособПоУмолчанию.СубконтоКт3);
	//vvv
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКт4", СпособПоУмолчанию.СубконтоКт4);
	//
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСчетНУ", СпособПоУмолчанию.СчетДтНУ);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСчетКтНУ", СпособПоУмолчанию.СчетКтНУ);	
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДтНУ1", СпособПоУмолчанию.СубконтоДтНУ1);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДтНУ2", СпособПоУмолчанию.СубконтоДтНУ2);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДтНУ3", СпособПоУмолчанию.СубконтоДтНУ3);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКтНУ1", СпособПоУмолчанию.СубконтоКтНУ1);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКтНУ2", СпособПоУмолчанию.СубконтоКтНУ2);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоКтНУ3", СпособПоУмолчанию.СубконтоКтНУ3);	
	Запрос.УстановитьПараметр("парамКатегорияПервичная", Справочники.КатегорииРасчетов.Первичное);

	МассивПоСреднемуЗаработку = Новый Массив;
	МассивПоСреднемуЗаработку.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку);
	МассивПоСреднемуЗаработку.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням);
	МассивПоСреднемуЗаработку.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке);
	МассивПоСреднемуЗаработку.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	МассивПоСреднемуЗаработку.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка);
	Запрос.УстановитьПараметр("парамПоСреднемуЗаработку", МассивПоСреднемуЗаработку);

	МассивСдельныйЗаработок = Новый Массив;
	МассивСдельныйЗаработок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	МассивСдельныйЗаработок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СдельныйПриработок);
	МассивСдельныйЗаработок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СделкаПоЧасовойТарифнойСтавке);
	Запрос.УстановитьПараметр("парамСдельныйЗаработок", МассивСдельныйЗаработок);
	Запрос.УстановитьПараметр("СпособРасчетаПоСреднемуЗаработкуФСС", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	
	МассивПричиныНетрудоспособности = Новый Массив;
	МассивПричиныНетрудоспособности.Добавить(Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
	МассивПричиныНетрудоспособности.Добавить(Перечисления.ПричиныНетрудоспособности.ПособиеБезЗаболевания);
	МассивПричиныНетрудоспособности.Добавить(Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание);
	МассивПричиныНетрудоспособности.Добавить(Перечисления.ПричиныНетрудоспособности.ПоУходу);
	МассивПричиныНетрудоспособности.Добавить(Перечисления.ПричиныНетрудоспособности.ЛиквидаторамЧАЭС);
	МассивПричиныНетрудоспособности.Добавить(Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве);
	Запрос.УстановитьПараметр("ПричиныНетрудоспособности", МассивПричиныНетрудоспособности);

	Запрос.УстановитьПараметр("ПоДням", Перечисления.ВидыУчетаВремени.ПоДням);
	Запрос.УстановитьПараметр("ПоЗаработку", ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку);
	Запрос.УстановитьПараметр("ПоЗаработкуБЛ", ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ);
	Запрос.УстановитьПараметр("ПоПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоПремиям);
	Запрос.УстановитьПараметр("ПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
	
	Запрос.УстановитьПараметр("ДатаЗакона202ФЗ", '20050101');
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	НачатьТранзакцию();
	
	Если ЭтоОсновныеНачисления Тогда
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ ОТРАЖЕНИЯ В УЧЕТЕ БАЗОВЫХ НАЧИСЛЕНИЙ
		// таблица ВТ_База
		
		Если Не ЭтоПервичныеНачисления Тогда
			
			//соберем базу для зависимых начислений
			БазаТекст = 
			"ВЫБРАТЬ
			|	База.Регистратор КАК Регистратор,
			|	База.НомерСтроки КАК НомерСтроки,
			|	База.СчетДтРазрез,
			|	База.СубконтоДт1Разрез,
			|	База.СубконтоДт2Разрез,
			|	База.СубконтоДт3Разрез,
			//vvv
			|	База.СубконтоДт4Разрез,
			//
			|	База.СчетКтРазрез,
			|	База.СубконтоКт1Разрез,
			|	База.СубконтоКт2Разрез,
			|	База.СубконтоКт3Разрез,
			//vvv
			|	База.СубконтоКт4Разрез,
			//
			|	База.СчетДтНУРазрез,
			|	База.СубконтоДтНУ1Разрез,
			|	База.СубконтоДтНУ2Разрез,
			|	База.СубконтоДтНУ3Разрез,
			|	База.СчетКтНУРазрез,
			|	База.СубконтоКтНУ1Разрез,
			|	База.СубконтоКтНУ2Разрез,
			|	База.СубконтоКтНУ3Разрез,
			|	СУММА(База.РезультатБаза) КАК РезультатБаза
			|ПОМЕСТИТЬ ВТ_База
			|ИЗ
			|	(ВЫБРАТЬ
			|		БазаБУОсновныеНачисления.Регистратор КАК Регистратор,
			|		БазаБУОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|		БазаБУОсновныеНачисления.СчетДтРазрез КАК СчетДтРазрез,
			|		БазаБУОсновныеНачисления.СубконтоДт1Разрез КАК СубконтоДт1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДт2Разрез КАК СубконтоДт2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДт3Разрез КАК СубконтоДт3Разрез,
			//vvv
			|		БазаБУОсновныеНачисления.СубконтоДт4Разрез КАК СубконтоДт4Разрез,
			//
			|		БазаБУОсновныеНачисления.СчетКтРазрез КАК СчетКтРазрез,
			|		БазаБУОсновныеНачисления.СубконтоКт1Разрез КАК СубконтоКт1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКт2Разрез КАК СубконтоКт2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКт3Разрез КАК СубконтоКт3Разрез,
			//vvv
			|		БазаБУОсновныеНачисления.СубконтоКт4Разрез КАК СубконтоКт4Разрез,
			//
			|		БазаБУОсновныеНачисления.СчетДтНУРазрез КАК СчетДтНУРазрез,
			|		БазаБУОсновныеНачисления.СубконтоДтНУ1Разрез КАК СубконтоДтНУ1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДтНУ2Разрез КАК СубконтоДтНУ2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДтНУ3Разрез КАК СубконтоДтНУ3Разрез,
			|		БазаБУОсновныеНачисления.СчетКтНУРазрез КАК СчетКтНУРазрез,
			|		БазаБУОсновныеНачисления.СубконтоКтНУ1Разрез КАК СубконтоКтНУ1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКтНУ2Разрез КАК СубконтоКтНУ2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКтНУ3Разрез КАК СубконтоКтНУ3Разрез,
			|		БазаБУОсновныеНачисления.РезультатБаза КАК РезультатБаза
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.БазаБУОсновныеНачисления(
			|				&парамИзмерения,
			|				&парамИзмерения,
			|				&парамРазрезыБУ,
			|				ОбособленноеПодразделение = &парамОрганизация
			|					И (НЕ Сторно)
			|					И ПериодРегистрации = &парамПериодРегистрации
			|					И ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
			|					И (НЕ ВидРасчета.СпособРасчета В (&парамПоСреднемуЗаработку))
			|					И ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
			|					И ВидРасчета В (&парамСписокНачислений)) КАК БазаБУОсновныеНачисления
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		БазаБУДополнительныеНачисления.Регистратор,
			|		БазаБУДополнительныеНачисления.НомерСтроки,
			|		БазаБУДополнительныеНачисления.СчетДтРазрез,
			|		БазаБУДополнительныеНачисления.СубконтоДт1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДт2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДт3Разрез,
			//vvv
			|		БазаБУДополнительныеНачисления.СубконтоДт4Разрез,
			//
			|		БазаБУДополнительныеНачисления.СчетКтРазрез,
			|		БазаБУДополнительныеНачисления.СубконтоКт1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКт2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКт3Разрез,
			//vvv
			|		БазаБУДополнительныеНачисления.СубконтоКт4Разрез,
			//
			|		БазаБУДополнительныеНачисления.СчетДтНУРазрез,
			|		БазаБУДополнительныеНачисления.СубконтоДтНУ1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДтНУ2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДтНУ3Разрез,
			|		БазаБУДополнительныеНачисления.СчетКтНУРазрез,
			|		БазаБУДополнительныеНачисления.СубконтоКтНУ1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКтНУ2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКтНУ3Разрез,
			|		БазаБУДополнительныеНачисления.РезультатБаза
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.БазаБУДополнительныеНачисления(
			|				&парамИзмерения,
			|				&парамИзмерения,
			|				&парамРазрезыБУ,
			|				ОбособленноеПодразделение = &парамОрганизация
			|					И (НЕ Сторно)
			|					И ПериодРегистрации = &парамПериодРегистрации
			|					И ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
			|					И (НЕ ВидРасчета.СпособРасчета В (&парамПоСреднемуЗаработку))
			|					И ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
			|					И ВидРасчета В (&парамСписокНачислений)) КАК БазаБУДополнительныеНачисления) КАК База
			|
			|СГРУППИРОВАТЬ ПО
			|	База.Регистратор,
			|	База.СчетДтНУРазрез,
			|	База.СчетКтРазрез,
			|	База.СубконтоКт1Разрез,
			|	База.СубконтоДт3Разрез,
			|	База.СубконтоДт2Разрез,
			|	База.СубконтоДт1Разрез,
			|	База.СчетДтРазрез,
			|	База.СубконтоКт2Разрез,
			|	База.СубконтоКт3Разрез,
			//vvv
			|	База.СубконтоКт4Разрез,
			|	База.СубконтоДт4Разрез,
			//
			|	База.СубконтоДтНУ1Разрез,
			|	База.СубконтоДтНУ2Разрез,
			|	База.СубконтоДтНУ3Разрез,
			|	База.СчетКтНУРазрез,
			|	База.СубконтоКтНУ1Разрез,
			|	База.СубконтоКтНУ2Разрез,
			|	База.СубконтоКтНУ3Разрез,
			|	База.НомерСтроки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
			
			
		Иначе	
			
			// для первичных начислений не собираем базу	
			БазаТекст = 
			"ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Регистратор,
			|	0 КАК НомерСтроки,
			|	НЕОПРЕДЕЛЕНО КАК СчетДтРазрез,
			|	НЕОПРЕДЕЛЕНО КАК СчетКтРазрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3Разрез,
			//vvv
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт4Разрез,
			//
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3Разрез,
			//vvv
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт4Разрез,
			//
			|	НЕОПРЕДЕЛЕНО КАК СчетДтНУРазрез,
			|	НЕОПРЕДЕЛЕНО КАК СчетКтНУРазрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ1Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ1Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2Разрез,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3Разрез,
			|	0 КАК РезультатБаза
			|ПОМЕСТИТЬ ВТ_База";
			
		КонецЕсли;	
		Запрос.Текст = БазаТекст;
		//временная таблица - ВТ_База
		Запрос.Выполнить();

		// ПОЛУЧИЛИ ОТРАЖЕНИЕ В УЧЕТЕ БАЗОВЫХ НАЧИСЛЕНИЙ
		///////////////////////////////////////////////////////////////////////////////////
	
	    ///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ПЛАНОВЫХ НАЧИСЛЕНИЙ
		// таблица ВТ_УчетПлановыхНачислений
		
		УчетПлановыхНачисленийТекст =
		 "ВЫБРАТЬ
		 |	ОсновныеНачисления.Регистратор КАК Регистратор,
		 |	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		 |	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		 |	ОсновныеНачисления.ДатаНачалаСобытия,
		 |	ОсновныеНачисления.ВидРасчета
		 |ПОМЕСТИТЬ ВТ_ОсновыеНачисленияДляПлановый
		 |ИЗ
		 |	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		 |ГДЕ
		 |	ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		 |	И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		 |	И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		 |	И ОсновныеНачисления.Результат <> 0
		 |	И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)
		 |	И (НЕ ОсновныеНачисления.Сторно)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ОсновныеНачисления.Регистратор КАК Регистратор,
		 |	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		 |	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		 |	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		 |	МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		 |ПОМЕСТИТЬ ВТ_СведенияОНачислениях
		 |ИЗ
		 |	ВТ_ОсновыеНачисленияДляПлановый КАК ОсновныеНачисления
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		 |		ПО ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		 |			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ДатаНачалаСобытия)
		 |			И ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ОсновныеНачисления.Регистратор,
		 |	ОсновныеНачисления.НомерСтроки,
		 |	ОсновныеНачисления.Сотрудник,
		 |	ОсновныеНачисления.ВидРасчета
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
		 |	СведенияОНачисленияхСрез.Регистратор КАК Регистратор,
		 |	СведенияОНачисленияхСрез.НомерСтроки КАК НомерСтроки
		 |ПОМЕСТИТЬ ВТ_УчетПлановыхНачислений
		 |ИЗ
		 |	РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОНачислениях КАК СведенияОНачисленияхСрез
		 |		ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		 |			И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		 |			И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	Регистратор,
		 |	НомерСтроки";
		Запрос.Текст = УчетПлановыхНачисленийТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ПЛАНОВЫХ НАЧИСЛЕНИЙ
		///////////////////////////////////////////////////////////////////////////////////
		
		
		ОсновныеНачисленияТекст =
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ДатаНачалаСобытия,
		|	ОсновныеНачисления.ПодразделениеОрганизации,
		|	ОсновныеНачисления.ОбособленноеПодразделение
		|ПОМЕСТИТЬ ВТ_ОсновыеНачисления
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|	И ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия)
		|	И ОсновныеНачисления.Результат <> 0
		|	И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|	И (НЕ ОсновныеНачисления.Сторно)";
		Запрос.Текст = ОсновныеНачисленияТекст;
		Запрос.Выполнить();
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА РАБОТНИКОВ
		// таблица ВТ_УчетОсновногоЗаработка

		УчетОсновногоЗаработкаТекст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(УчетЗарВРеглУчете.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СведенияОРаботниках
		|ИЗ
		|	ВТ_ОсновыеНачисления КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете КАК УчетЗарВРеглУчете
		|		ПО ОсновныеНачисления.Сотрудник = УчетЗарВРеглУчете.Сотрудник
		|			И (УчетЗарВРеглУчете.Период <= ОсновныеНачисления.ДатаНачалаСобытия)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисления.Регистратор,
		|	ОсновныеНачисления.НомерСтроки,
		|	ОсновныеНачисления.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
		|	СведенияОРаботникахСрез.Регистратор КАК Регистратор,
		|	СведенияОРаботникахСрез.НомерСтроки КАК НомерСтроки,
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя КАК СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя
		|ПОМЕСТИТЬ ВТ_УчетОсновногоЗаработка
		|ИЗ
		|	РегистрСведений.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете КАК УчетЗарВРеглУчете
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОРаботниках КАК СведенияОРаботникахСрез
		|		ПО (СведенияОРаботникахСрез.Сотрудник = УчетЗарВРеглУчете.Сотрудник)
		|			И (СведенияОРаботникахСрез.Период = УчетЗарВРеглУчете.Период)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
		Запрос.Текст = УчетОсновногоЗаработкаТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА РАБОТНИКОВ
		///////////////////////////////////////////////////////////////////////////////////
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ПОДРАЗДЕЛЕНИЯ
		// таблица ВТ_УчетОсновногоЗаработкаПодразделения
		
		УчетОсновногоЗаработкаПодразделенияТекст =
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	МАКСИМУМ(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СведенияОПодразделениях
		|ИЗ
		|	ВТ_ОсновыеНачисления КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО ОсновныеНачисления.ПодразделениеОрганизации = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.ПодразделениеОрганизации
		|			И (УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Период <= ОсновныеНачисления.ДатаНачалаСобытия)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисления.ПодразделениеОрганизации,
		|	ОсновныеНачисления.Регистратор,
		|	ОсновныеНачисления.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодразделениеОрганизации,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОПодразделенияхСрез.Регистратор КАК Регистратор,
		|	СведенияОПодразделенияхСрез.НомерСтроки КАК НомерСтроки,
		|	УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
		|	УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя КАК СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя
		|ПОМЕСТИТЬ ВТ_УчетОсновногоЗаработкаПодразделения
		|ИЗ
		|	ВТ_СведенияОПодразделениях КАК СведенияОПодразделенияхСрез
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО СведенияОПодразделенияхСрез.ПодразделениеОрганизации = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.ПодразделениеОрганизации
		|			И СведенияОПодразделенияхСрез.Период = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки";		
		Запрос.Текст = УчетОсновногоЗаработкаПодразделенияТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ПОДРАЗДЕЛЕНИЯ
		///////////////////////////////////////////////////////////////////////////////////
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ОРГАНИЗАЦИИ
		// таблица ВТ_УчетОсновногоЗаработкаОрганизации
		
		УчетОсновногоЗаработкаОрганизацииТекст =
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	МАКСИМУМ(УчетОсновногоЗаработкаОрганизации.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СведенияПоОрганизации
		|ИЗ
		|	ВТ_ОсновыеНачисления КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
		|		ПО ОсновныеНачисления.ОбособленноеПодразделение = УчетОсновногоЗаработкаОрганизации.Организация
		|			И (УчетОсновногоЗаработкаОрганизации.Период <= ОсновныеНачисления.ДатаНачалаСобытия)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисления.ОбособленноеПодразделение,
		|	ОсновныеНачисления.Регистратор,
		|	ОсновныеНачисления.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбособленноеПодразделение,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияПоОрганизации.Регистратор КАК Регистратор,
		|	СведенияПоОрганизации.НомерСтроки КАК НомерСтроки,
		|	УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
		|	УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя КАК СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя
		|ПОМЕСТИТЬ ВТ_УчетОсновногоЗаработкаОрганизации
		|ИЗ
		|	ВТ_СведенияПоОрганизации КАК СведенияПоОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
		|		ПО СведенияПоОрганизации.ОбособленноеПодразделение = УчетОсновногоЗаработкаОрганизации.Организация
		|			И СведенияПоОрганизации.Период = УчетОсновногоЗаработкаОрганизации.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки";		
		Запрос.Текст = УчетОсновногоЗаработкаОрганизацииТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ОРГАНИЗАЦИИ
		///////////////////////////////////////////////////////////////////////////////////
		
		///////////////////////////////////////////////////////////////////////////////////
		//получим отражение в учете сторно записей
		
		ОсновныеНачисленияСторноТекст =
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисления.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВТ_ОсновныеНачисленияСторно
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|	И ОсновныеНачисления.Результат <> 0
		|	И ОсновныеНачисления.Сторно";

		Запрос.Текст = ОсновныеНачисленияСторноТекст;
		//временная таблица - ВТ_ОсновныеНачисленияСторно
		Результат = Запрос.Выполнить().Выгрузить();
		КоличествоСторноЗаписей = Результат[0].Количество;
		
		
		Если КоличествоСторноЗаписей <> 0 Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОсновныеНачисленияСторно.Сотрудник КАК Сотрудник,
			|	ОсновныеНачисленияСторно.ВидРасчета КАК ВидРасчета,
			|	ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации
			|ПОМЕСТИТЬ ВТ_СторноСотрудники
			|ИЗ
			|	ВТ_ОсновныеНачисленияСторно КАК ОсновныеНачисленияСторно
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
			|		ПО ОсновныеНачисленияСторно.СторнируемыйДокумент = ОсновныеНачисления.Регистратор
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник,
			|	ПериодРегистрации,
			|	ВидРасчета";
			
			//временная таблица - ВТ_СторноСотрудники
			Запрос.Выполнить();

			
			ОтражениеВУчетеСторноТекст = 
			"ВЫБРАТЬ
			|	ОсновныеНачисления.Регистратор КАК Регистратор,
			|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|	БУОсновныеНачисления.СчетДт,
			|	БУОсновныеНачисления.СубконтоДт1,
			|	БУОсновныеНачисления.СубконтоДт2,
			|	БУОсновныеНачисления.СубконтоДт3,
			//vvv
			|	БУОсновныеНачисления.СубконтоДт4,
			//
			|	БУОсновныеНачисления.СчетКт,
			|	БУОсновныеНачисления.СубконтоКт1,
			|	БУОсновныеНачисления.СубконтоКт2,
			|	БУОсновныеНачисления.СубконтоКт3,
			//vvv
			|	БУОсновныеНачисления.СубконтоКт4,
			//
			|	БУОсновныеНачисления.СчетДтНУ,
			|	БУОсновныеНачисления.СубконтоДтНУ1,
			|	БУОсновныеНачисления.СубконтоДтНУ2,
			|	БУОсновныеНачисления.СубконтоДтНУ3,
			|	БУОсновныеНачисления.СчетКтНУ,
			|	БУОсновныеНачисления.СубконтоКтНУ1,
			|	БУОсновныеНачисления.СубконтоКтНУ2,
			|	БУОсновныеНачисления.СубконтоКтНУ3,
			|	БУОсновныеНачисления.ОтражениеВУСН,
			|	БУОсновныеНачисления.Результат,
			|	БУОсновныеНачисления.ПериодДействияНачало,
			|	БУОсновныеНачисления.ПериодДействияКонец
			|ПОМЕСТИТЬ ВТ_ОтражениеВУчетеСторно
			|ИЗ
			|	ВТ_ОсновныеНачисленияСторно КАК ОсновныеНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			БУОсновныеНачисления.ВидРасчета КАК ВидРасчета,
			|			БУОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
			|			БУОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
			|			БУОсновныеНачисления.Сотрудник КАК Сотрудник,
			|			БУОсновныеНачисления.Результат КАК Результат,
			|			БУОсновныеНачисления.СчетДт КАК СчетДт,
			|			БУОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
			|			БУОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
			|			БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
			//vvv
			|			БУОсновныеНачисления.СубконтоДт4 КАК СубконтоДт4,
			//
			|			БУОсновныеНачисления.СчетКт КАК СчетКт,
			|			БУОсновныеНачисления.СубконтоКт1 КАК СубконтоКт1,
			|			БУОсновныеНачисления.СубконтоКт2 КАК СубконтоКт2,
			|			БУОсновныеНачисления.СубконтоКт3 КАК СубконтоКт3,
			//vvv
			|			БУОсновныеНачисления.СубконтоКт4 КАК СубконтоКт4,
			//
			|			БУОсновныеНачисления.СчетДтНУ КАК СчетДтНУ,
			|			БУОсновныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
			|			БУОсновныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
			|			БУОсновныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
			|			БУОсновныеНачисления.СчетКтНУ КАК СчетКтНУ,
			|			БУОсновныеНачисления.СубконтоКтНУ1 КАК СубконтоКтНУ1,
			|			БУОсновныеНачисления.СубконтоКтНУ2 КАК СубконтоКтНУ2,
			|			БУОсновныеНачисления.СубконтоКтНУ3 КАК СубконтоКтНУ3,
			|			БУОсновныеНачисления.ОтражениеВУСН КАК ОтражениеВУСН,
			|			БУОсновныеНачисления.ДокументОснование КАК ДокументОснование
			|		ИЗ
			|			РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
			|		ГДЕ
			|			(БУОсновныеНачисления.ПериодРегистрации, БУОсновныеНачисления.Сотрудник, БУОсновныеНачисления.ВидРасчета) В
			|					(ВЫБРАТЬ
			|						ОсновныеНачисления.ПериодРегистрации,
			|						ОсновныеНачисления.Сотрудник,
			|						ОсновныеНачисления.ВидРасчета
			|					ИЗ
			|						ВТ_СторноСотрудники КАК ОсновныеНачисления)
			|			И (НЕ БУОсновныеНачисления.Сторно)) КАК БУОсновныеНачисления
			|		ПО ОсновныеНачисления.ВидРасчета = БУОсновныеНачисления.ВидРасчета
			|			И ОсновныеНачисления.Сотрудник = БУОсновныеНачисления.Сотрудник
			|			И ОсновныеНачисления.СторнируемыйДокумент = БУОсновныеНачисления.ДокументОснование
			|			И (БУОсновныеНачисления.ПериодДействияНачало МЕЖДУ ОсновныеНачисления.ПериодДействияНачало И ОсновныеНачисления.ПериодДействияКонец
			|				ИЛИ ОсновныеНачисления.ПериодДействияНачало МЕЖДУ БУОсновныеНачисления.ПериодДействияНачало И БУОсновныеНачисления.ПериодДействияКонец)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
			
		Иначе
			
			ОтражениеВУчетеСторноТекст = 
			"ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Регистратор,
			|	НЕОПРЕДЕЛЕНО КАК НомерСтроки,
			|	НЕОПРЕДЕЛЕНО КАК СчетДт,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			//vvv
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт4,
			//
			|	НЕОПРЕДЕЛЕНО КАК СчетКт,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			//vvv
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт4,
			//
			|	НЕОПРЕДЕЛЕНО КАК СчетДтНУ,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
			|	НЕОПРЕДЕЛЕНО КАК СчетКтНУ,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
			|	НЕОПРЕДЕЛЕНО КАК ОтражениеВУСН,
			|	НЕОПРЕДЕЛЕНО КАК ПериодДействияНачало,
			|	НЕОПРЕДЕЛЕНО КАК ПериодДействияКонец,
			|	0 КАК Результат
			|ПОМЕСТИТЬ ВТ_ОтражениеВУчетеСторно";
			
		КонецЕсли;
		
		Запрос.Текст = ОтражениеВУчетеСторноТекст;
		//временная таблица - ВТ_ОтражениеВУчетеСторно
		Запрос.Выполнить();
		
		//получили отражение в учете сторно записей
		///////////////////////////////////////////////////////////////////////////////////
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДт
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДт
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетКт
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетКт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКт
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетКт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетКт
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СчетКт
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетКт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетКт
		|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт1
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт3
		|	КОНЕЦ КАК СубконтоДт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт4
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт4
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт4
		|	КОНЕЦ КАК СубконтоДт4,
		//
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт1
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт1
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт1
		|	КОНЕЦ КАК СубконтоКт1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт2
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт2
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт2
		|	КОНЕЦ КАК СубконтоКт2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт3
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт3
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт3
		|	КОНЕЦ КАК СубконтоКт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт4
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт4
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт4
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт4
		|	КОНЕЦ КАК СубконтоКт4,
		//
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДтНУ
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетДтНУ
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетНУ
		|	КОНЕЦ КАК СчетДтНУ,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетКтНУ
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетКтНУ
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетКтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетКтНУ
		|	КОНЕЦ КАК СчетКтНУ,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДтНУ1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ1
		|	КОНЕЦ КАК СубконтоДтНУ1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДтНУ2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ2
		|	КОНЕЦ КАК СубконтоДтНУ2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДтНУ3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ3
		|	КОНЕЦ КАК СубконтоДтНУ3,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКтНУ1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ1
		|	КОНЕЦ КАК СубконтоКтНУ1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКтНУ2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ2
		|	КОНЕЦ КАК СубконтоКтНУ2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКтНУ3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ3
		|	КОНЕЦ КАК СубконтоКтНУ3,
		|	Распределение.ДоляСпособаОтражения КАК ДоляСпособаОтражения,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ОсновныеНачисления.Результат КАК Результат,
		|	ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|	ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ОсновныеНачисления.Сторно КАК Сторно,
		|	ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ОсновныеНачисления.ВидРасчета.ВидНачисленияПоСт255НК КАК ВидНачисленияПоСт255НК,
		|	ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете КАК СтратегияОтраженияВУчете,
		|	ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ОтражениеВУчетеСторно.Результат КАК РезультатСторно,
		|	ОтражениеВУчетеСторно.ПериодДействияНачало КАК ПериодДействияНачалоСторно,
		|	ОтражениеВУчетеСторно.ПериодДействияКонец КАК ПериодДействияКонецСторно,
		|	ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
		|	ОсновныеНачисления.Сотрудник.Наименование КАК СотрудникНаименование
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетПлановыхНачислений КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|		ПО ОсновныеНачисления.Регистратор = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = РеглУчетПлановыхНачисленийРаботниковОрганизаций.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработка КАК УчетЗарВРеглУчете
		|		ПО ОсновныеНачисления.Регистратор = УчетЗарВРеглУчете.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетЗарВРеглУчете.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаПодразделения КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО ОсновныеНачисления.Регистратор = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
		|		ПО ОсновныеНачисления.Регистратор = УчетОсновногоЗаработкаОрганизации.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетОсновногоЗаработкаОрганизации.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК Распределение
		|		ПО ОсновныеНачисления.Сотрудник = Распределение.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ДатаНачалаСобытия, МЕСЯЦ) = Распределение.ПериодРегистрации)
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		//vvv
		|			И ОсновныеНачисления.ПериодДействияНачало = Распределение.ПериодДействияНачало
		//
		|			И (ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ОсновныеНачисления.Сторно))
		//vvv
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеВидовРасчетаРаботниковОрганизаций КАК РаспределениеВидовРасчета
		|		ПО ОсновныеНачисления.Сотрудник = РаспределениеВидовРасчета.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ДатаНачалаСобытия, МЕСЯЦ) = РаспределениеВидовРасчета.ПериодРегистрации)
		|			И (ОсновныеНачисления.ВидРасчета = РаспределениеВидовРасчета.ВидРасчета)
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ПериодДействияНачало,ДЕНЬ) = НАЧАЛОПЕРИОДА(РаспределениеВидовРасчета.ПериодДействияНачало,ДЕНЬ))
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ПериодДействияКонец,ДЕНЬ) = НАЧАЛОПЕРИОДА(РаспределениеВидовРасчета.ПериодДействияКонец,ДЕНЬ))
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		|			И (ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ОсновныеНачисления.Сторно))
		//
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
		|		ПО ОсновныеНачисления.Сотрудник = БУОсновныеНачисления.Сотрудник
		|			И ОсновныеНачисления.ВидРасчета = БУОсновныеНачисления.ВидРасчета
		|			И (БУОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
		|			И (БУОсновныеНачисления.ПериодДействияНачало >= ОсновныеНачисления.ПериодДействияНачало)
		|			И (БУОсновныеНачисления.ПериодДействияКонец <= ОсновныеНачисления.ПериодДействияКонец)
		|			И (БУОсновныеНачисления.ДокументОснование = ОсновныеНачисления.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеВУчетеСторно КАК ОтражениеВУчетеСторно
		|		ПО ОсновныеНачисления.Регистратор = ОтражениеВУчетеСторно.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = ОтражениеВУчетеСторно.НомерСтроки
		|ГДЕ
		|	ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|	И ОсновныеНачисления.Результат <> 0
		|	И ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете
		|			КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете
		|			КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА Распределение.СпособОтраженияВБухучете
		//vvv
		|			КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете
		//
		|			КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете
		|			ИНАЧЕ &парамСпособПоУмолчанию
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете)
		|	И БУОсновныеНачисления.Сотрудник ЕСТЬ NULL 
		|	И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)";
		
		Запрос.Текст = ТекстЗапроса;
		//vvv комментируем, что это вообще за запрос?
		//Запрос.Выполнить();
		
		//переопределение основного отражения
		ТекстЗапроса=
		"ВЫБРАТЬ
		|	ПереопределениеОтраженияВидовРасчета.ВидРасчета,
		|	ПереопределениеОтраженияВидовРасчета.СпособОтраженияВБухучете
		|ПОМЕСТИТЬ ВТ_Переопределение
		|ИЗ
		|	РегистрСведений.ПереопределениеОтраженияВидовРасчета КАК ПереопределениеОтраженияВидовРасчета
		|ГДЕ
		|	ПереопределениеОтраженияВидовРасчета.Организация = &парамОрганизация
		|	И ПереопределениеОтраженияВидовРасчета.ВидРасчета.ВозможноПереопределение";
		
		Запрос.Текст=ТекстЗапроса;
		Запрос.Выполнить();
		
		ТекстЗапроса=
		"ВЫБРАТЬ
		|	УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчетеСрезПоследних.Сотрудник,
		|	УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчетеСрезПоследних.СпособОтраженияВБухучете
		|ПОМЕСТИТЬ ВТ_ОтражениеСотрудников
		|ИЗ
		|	РегистрСведений.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СрезПоследних(&парамПериодРегистрации, Организация = &парамГоловнаяОрганизация) КАК УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчетеСрезПоследних";
		
		Запрос.Текст=ТекстЗапроса;
		Запрос.Выполнить();
		//
		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДт
		//vvv
		|		КОГДА ОсновныеНачисления.ИзРезерва
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПредстоящихРасходов)
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДт
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетКт
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетКт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКт
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СчетКт
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетКт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетКт
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СчетКт
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетКт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетКт
		|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт1
		//vvv
		|		КОГДА ОсновныеНачисления.ИзРезерва
		|			ТОГДА ОсновныеНачисления.Резерв
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт1
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт2
		//vvv
		|		КОГДА ОсновныеНачисления.ИзРезерва ТОГДА 
		|			ВЫБОР
		|				КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|				КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|				КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|				КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|				КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|				КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|				КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка) ТОГДА
		|					ВЫБОР
		|						КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|						КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|						КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|						КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|					КОНЕЦ
		|			ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|		КОНЕЦ
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт3
		|	КОНЕЦ КАК СубконтоДт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт4		
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт4
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт4
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт4
		|	КОНЕЦ КАК СубконтоДт4,
		//
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт1
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоКт1
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт1
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт1
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт1
		|	КОНЕЦ КАК СубконтоКт1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт2
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоКт2
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт2
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт2
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт2
		|	КОНЕЦ КАК СубконтоКт2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт3
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоКт3
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт3
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт3
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт3
		|	КОНЕЦ КАК СубконтоКт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт4
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт4
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоКт4
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт4
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт4
		//
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт4
		|	КОНЕЦ КАК СубконтоКт4,
		//
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДтНУ
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетДтНУ
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетНУ
		|	КОНЕЦ КАК СчетДтНУ,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетКтНУ
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетКтНУ
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетКтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетКтНУ
		|	КОНЕЦ КАК СчетКтНУ,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДтНУ1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ1
		|	КОНЕЦ КАК СубконтоДтНУ1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДтНУ2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ2
		|	КОНЕЦ КАК СубконтоДтНУ2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДтНУ3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ3
		|	КОНЕЦ КАК СубконтоДтНУ3,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКтНУ1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ1
		|	КОНЕЦ КАК СубконтоКтНУ1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКтНУ2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ2
		|	КОНЕЦ КАК СубконтоКтНУ2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоКтНУ3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ3
		|	КОНЕЦ КАК СубконтоКтНУ3,
		|	Распределение.ДоляСпособаОтражения КАК ДоляСпособаОтражения,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//vvv
		|	ВЫБОР КОГДА ОсновныеНачисления.Автомобиль=ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка) ТОГДА ВодителиОрганизаций.Автомобиль ИНАЧЕ  ОсновныеНачисления.Автомобиль КОНЕЦ КАК Автомобиль,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СчетДт КАК СчетДтСотрудника,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДтСотрудника1,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДтСотрудника2,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДтСотрудника3,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт4 КАК СубконтоДтСотрудника4,
		//
		|	ОсновныеНачисления.Результат КАК Результат,
		|	ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|	ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ОсновныеНачисления.Сторно КАК Сторно,
		|	ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ОсновныеНачисления.ВидРасчета.ВидНачисленияПоСт255НК КАК ВидНачисленияПоСт255НК,
		|	ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете КАК СтратегияОтраженияВУчете,
		|	ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ОтражениеВУчетеСторно.Результат КАК РезультатСторно,
		|	ОтражениеВУчетеСторно.ПериодДействияНачало КАК ПериодДействияНачалоСторно,
		|	ОтражениеВУчетеСторно.ПериодДействияКонец КАК ПериодДействияКонецСторно,
		|	ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
		|	ОсновныеНачисления.Сотрудник.Наименование КАК СотрудникНаименование,
		//vvv ///////////////////////////
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДт
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДт
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетДт
		|	КОНЕЦ КАК СчетДтНалогов,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт1
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт1
		|	КОНЕЦ КАК СубконтоДтНалогов1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт2
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|	КОНЕЦ КАК СубконтоДтНалогов2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт3
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт3
		|	КОНЕЦ КАК СубконтоДтНалогов3,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт4		
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт4
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт4
		|	КОНЕЦ КАК СубконтоДтНалогов4
		////////////////////////////////
		|ПОМЕСТИТЬ ДанныеУчета
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетПлановыхНачислений КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|		ПО ОсновныеНачисления.Регистратор = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = РеглУчетПлановыхНачисленийРаботниковОрганизаций.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработка КАК УчетЗарВРеглУчете
		|		ПО ОсновныеНачисления.Регистратор = УчетЗарВРеглУчете.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетЗарВРеглУчете.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаПодразделения КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО ОсновныеНачисления.Регистратор = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
		|		ПО ОсновныеНачисления.Регистратор = УчетОсновногоЗаработкаОрганизации.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетОсновногоЗаработкаОрганизации.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК Распределение
		|		ПО ОсновныеНачисления.Сотрудник = Распределение.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ДатаНачалаСобытия, МЕСЯЦ) = Распределение.ПериодРегистрации)
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		//vvv
		|			И ОсновныеНачисления.ПериодДействияНачало = Распределение.ПериодДействияНачало
		//
		|			И (ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ОсновныеНачисления.Сторно))
		//vvv
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеВидовРасчетаРаботниковОрганизаций КАК РаспределениеВидовРасчета
		|		ПО ОсновныеНачисления.Сотрудник = РаспределениеВидовРасчета.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ДатаНачалаСобытия, МЕСЯЦ) = РаспределениеВидовРасчета.ПериодРегистрации)
		|			И (ОсновныеНачисления.ВидРасчета = РаспределениеВидовРасчета.ВидРасчета)
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ПериодДействияНачало,ДЕНЬ) = НАЧАЛОПЕРИОДА(РаспределениеВидовРасчета.ПериодДействияНачало,ДЕНЬ))
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ПериодДействияКонец,ДЕНЬ) = НАЧАЛОПЕРИОДА(РаспределениеВидовРасчета.ПериодДействияКонец,ДЕНЬ))
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		|			И (ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Переопределение КАК Переопределение
		|			ПО ОсновныеНачисления.ВидРасчета = Переопределение.ВидРасчета
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеСотрудников КАК ОтражениеСотрудников
		|		ПО ОсновныеНачисления.Сотрудник = ОтражениеСотрудников.Сотрудник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (
		|			ВЫБРАТЬ
		|				ВодителиСрез.Сотрудник,
		|				ВодителиСрез.ПериодДействияНачало,
		//|				ВодителиОрганизаций.Автомобиль
		|				ВЫБОР КОГДА ВодителиОрганизаций.ПериодЗавершения<>ДАТАВРЕМЯ(1,1,1) И ВодителиОрганизаций.ПериодЗавершения<=ВодителиСрез.ПериодДействияНачало
		|					ТОГДА ВодителиОрганизаций.АвтомобильЗавершения
		|					ИНАЧЕ ВодителиОрганизаций.Автомобиль
		|				КОНЕЦ КАК Автомобиль 
		|			ИЗ 
		|				(ВЫБРАТЬ 
		|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|					ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|					МАКСИМУМ(ВодителиОрганизаций.Период) КАК ПериодСреза 
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВодителиОрганизаций КАК ВодителиОрганизаций 
		|						ПО ОсновныеНачисления.Сотрудник=ВодителиОрганизаций.Сотрудник
		|						И ВодителиОрганизаций.Период<=ОсновныеНачисления.ПериодДействияНачало
		|				ГДЕ
		|					ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|					И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|					И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|					И ОсновныеНачисления.Результат <> 0
		|					И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|				СГРУППИРОВАТЬ ПО
		|					ОсновныеНачисления.Сотрудник,
		|					ОсновныеНачисления.ПериодДействияНачало) КАК ВодителиСрез
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВодителиОрганизаций КАК ВодителиОрганизаций 
		|					ПО ВодителиСрез.Сотрудник=ВодителиОрганизаций.Сотрудник
		|					И ВодителиОрганизаций.Период=ВодителиСрез.ПериодСреза) КАК ВодителиОрганизаций
		|						ПО ОсновныеНачисления.СОтрудник=ВодителиОрганизаций.Сотрудник
		|						И ОсновныеНачисления.ПериодДействияНачало=ВодителиОрганизаций.ПериодДействияНачало
		//
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
		|		ПО ОсновныеНачисления.Сотрудник = БУОсновныеНачисления.Сотрудник
		|			И ОсновныеНачисления.ВидРасчета = БУОсновныеНачисления.ВидРасчета
		|			И (БУОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
		|			И (БУОсновныеНачисления.ПериодДействияНачало >= ОсновныеНачисления.ПериодДействияНачало)
		|			И (БУОсновныеНачисления.ПериодДействияКонец <= ОсновныеНачисления.ПериодДействияКонец)
		|			И (БУОсновныеНачисления.ДокументОснование = ОсновныеНачисления.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеВУчетеСторно КАК ОтражениеВУчетеСторно
		|		ПО ОсновныеНачисления.Регистратор = ОтражениеВУчетеСторно.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = ОтражениеВУчетеСторно.НомерСтроки
		|ГДЕ
		|	ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|	И ОсновныеНачисления.Результат <> 0
		|	И ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете
		|			КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете
		|			КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА Распределение.СпособОтраженияВБухучете
		//vvv
		|			КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете
		//
		|			КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете
		|			ИНАЧЕ &парамСпособПоУмолчанию
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете)
		|	И БУОсновныеНачисления.Сотрудник ЕСТЬ NULL 
		|	И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|
		//vvv объединяем
		| ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДт
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДт
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПредстоящихРасходов) КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт1
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт1
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт2
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт3
		//vvv
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		//vvv
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт3
		|	КОНЕЦ КАК СубконтоДт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт4		
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА Переопределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Переопределение.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоДт4
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт4
		|	КОНЕЦ КАК СубконтоДт4,
		//
		|	ОсновныеНачисления.Резерв КАК СубконтоКт1,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт1
		|					КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		|					КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт3
		|					КОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.СпособОтраженияВБухучете.СубконтоДт4
		|				КОНЕЦ
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		|					КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		|					КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		|					КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		|				КОНЕЦ
		|		КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|					КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|					КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|					КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|				КОНЕЦ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт1
		|					КОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт2
		|					КОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт3
		|					КОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт4
		|				КОНЕЦ
		//vvv
		|		КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт1
		|					КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт2
		|					КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт3
		|					КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете.СубконтоКт4
		|				КОНЕЦ
		//
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|					КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|					КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|					КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|				КОНЕЦ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|					КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|					КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|					КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|				КОНЕЦ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА
		|				ВЫБОР
		|					КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт1 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|					КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт2 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|					КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт3 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|					КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт4 ССЫЛКА Справочник.СтатьиЗатрат ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|				КОНЕЦ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт2
		|	КОНЕЦ КАК СубконтоКт2,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	Распределение.ДоляСпособаОтражения КАК ДоляСпособаОтражения,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//vvv
		|	ВЫБОР КОГДА ОсновныеНачисления.Автомобиль=ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка) ТОГДА ВодителиОрганизаций.Автомобиль ИНАЧЕ  ОсновныеНачисления.Автомобиль КОНЕЦ КАК Автомобиль,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СчетДт КАК СчетДтСотрудника,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДтСотрудника1,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДтСотрудника2,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДтСотрудника3,
		|	ОтражениеСотрудников.СпособОтраженияВБухучете.СубконтоДт4 КАК СубконтоДт4Сотрудника4,
		//
		|	ОсновныеНачисления.СуммаРезерва КАК Результат,
		|	ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|	ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ОсновныеНачисления.Сторно КАК Сторно,
		|	ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ОсновныеНачисления.ВидРасчета.ВидНачисленияПоСт255НК КАК ВидНачисленияПоСт255НК,
		|	ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете КАК СтратегияОтраженияВУчете,
		|	ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ОтражениеВУчетеСторно.Результат КАК РезультатСторно,
		|	ОтражениеВУчетеСторно.ПериодДействияНачало КАК ПериодДействияНачалоСторно,
		|	ОтражениеВУчетеСторно.ПериодДействияКонец КАК ПериодДействияКонецСторно,
		|	ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
		|	ОсновныеНачисления.Сотрудник.Наименование КАК СотрудникНаименование,
		//////////////////////
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		/////////////////////
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетПлановыхНачислений КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|		ПО ОсновныеНачисления.Регистратор = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = РеглУчетПлановыхНачисленийРаботниковОрганизаций.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработка КАК УчетЗарВРеглУчете
		|		ПО ОсновныеНачисления.Регистратор = УчетЗарВРеглУчете.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетЗарВРеглУчете.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаПодразделения КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО ОсновныеНачисления.Регистратор = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
		|		ПО ОсновныеНачисления.Регистратор = УчетОсновногоЗаработкаОрганизации.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = УчетОсновногоЗаработкаОрганизации.НомерСтроки
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК Распределение
		|		ПО ОсновныеНачисления.Сотрудник = Распределение.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ДатаНачалаСобытия, МЕСЯЦ) = Распределение.ПериодРегистрации)
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		//vvv
		|			И ОсновныеНачисления.ПериодДействияНачало = Распределение.ПериодДействияНачало
		//
		|			И (ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ОсновныеНачисления.Сторно))
		//vvv
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеВидовРасчетаРаботниковОрганизаций КАК РаспределениеВидовРасчета
		|		ПО ОсновныеНачисления.Сотрудник = РаспределениеВидовРасчета.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ДатаНачалаСобытия, МЕСЯЦ) = РаспределениеВидовРасчета.ПериодРегистрации)
		|			И (ОсновныеНачисления.ВидРасчета = РаспределениеВидовРасчета.ВидРасчета)
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ПериодДействияНачало,ДЕНЬ) = НАЧАЛОПЕРИОДА(РаспределениеВидовРасчета.ПериодДействияНачало,ДЕНЬ))
		|			И (НАЧАЛОПЕРИОДА(ОсновныеНачисления.ПериодДействияКонец,ДЕНЬ) = НАЧАЛОПЕРИОДА(РаспределениеВидовРасчета.ПериодДействияКонец,ДЕНЬ))
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		|			И (ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ОсновныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Переопределение КАК Переопределение
		|		ПО ОсновныеНачисления.ВидРасчета = Переопределение.ВидРасчета
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеСотрудников КАК ОтражениеСотрудников
		|		ПО ОсновныеНачисления.Сотрудник = ОтражениеСотрудников.Сотрудник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (
		|			ВЫБРАТЬ
		|				ВодителиСрез.Сотрудник,
		|				ВодителиСрез.ПериодДействияНачало,
		//|				ВодителиОрганизаций.Автомобиль
		|				ВЫБОР КОГДА ВодителиОрганизаций.ПериодЗавершения<>ДАТАВРЕМЯ(1,1,1) И ВодителиОрганизаций.ПериодЗавершения<=ВодителиСрез.ПериодДействияНачало
		|					ТОГДА ВодителиОрганизаций.АвтомобильЗавершения
		|					ИНАЧЕ ВодителиОрганизаций.Автомобиль
		|				КОНЕЦ КАК Автомобиль
		|			ИЗ 
		|				(ВЫБРАТЬ 
		|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|					ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|					МАКСИМУМ(ВодителиОрганизаций.Период) КАК ПериодСреза 
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВодителиОрганизаций КАК ВодителиОрганизаций 
		|						ПО ОсновныеНачисления.Сотрудник=ВодителиОрганизаций.Сотрудник
		|						И ВодителиОрганизаций.Период<=ОсновныеНачисления.ПериодДействияНачало
		|				ГДЕ
		|					ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|					И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|					И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|					И ОсновныеНачисления.СуммаРезерва <> 0
		|					И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|				СГРУППИРОВАТЬ ПО
		|					ОсновныеНачисления.Сотрудник,
		|					ОсновныеНачисления.ПериодДействияНачало) КАК ВодителиСрез
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВодителиОрганизаций КАК ВодителиОрганизаций 
		|					ПО ВодителиСрез.Сотрудник=ВодителиОрганизаций.Сотрудник
		|					И ВодителиОрганизаций.Период=ВодителиСрез.ПериодСреза) КАК ВодителиОрганизаций
		|						ПО ОсновныеНачисления.СОтрудник=ВодителиОрганизаций.Сотрудник
		|						И ОсновныеНачисления.ПериодДействияНачало=ВодителиОрганизаций.ПериодДействияНачало
		//
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
		|		ПО ОсновныеНачисления.Сотрудник = БУОсновныеНачисления.Сотрудник
		|			И ОсновныеНачисления.ВидРасчета = БУОсновныеНачисления.ВидРасчета
		|			И (БУОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
		|			И (БУОсновныеНачисления.ПериодДействияНачало >= ОсновныеНачисления.ПериодДействияНачало)
		|			И (БУОсновныеНачисления.ПериодДействияКонец <= ОсновныеНачисления.ПериодДействияКонец)
		|			И (БУОсновныеНачисления.ДокументОснование = ОсновныеНачисления.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеВУчетеСторно КАК ОтражениеВУчетеСторно
		|		ПО ОсновныеНачисления.Регистратор = ОтражениеВУчетеСторно.Регистратор
		|			И ОсновныеНачисления.НомерСтроки = ОтражениеВУчетеСторно.НомерСтроки
		|ГДЕ
		|	ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
		|	И ОсновныеНачисления.СуммаРезерва <> 0
		|	И ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете
		|			КОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА ОсновныеНачисления.ВидРасчета.СпособОтраженияВБухучете
		|			КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА Распределение.СпособОтраженияВБухучете
		//vvv
		|			КОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РаспределениеВидовРасчета.СпособОтраженияВБухучете
		//
		|			КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете
		|			ИНАЧЕ &парамСпособПоУмолчанию
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете)
		|	И БУОсновныеНачисления.Сотрудник ЕСТЬ NULL 
		|	И ОсновныеНачисления.ВидРасчета В(&парамСписокНачислений)
		//
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки
		|;
		|
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&парамГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ДанныеУчета.Регистратор КАК Регистратор,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.СотрудникНаименование КАК СотрудникНаименование,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.СчетДт КАК СчетДт,
		|	ДанныеУчета.СубконтоДт1,
		|	ДанныеУчета.СубконтоДт2,
		|	ДанныеУчета.СубконтоДт3,
		//vvv
		|	ДанныеУчета.СубконтоДт4,
		//
		|	ДанныеУчета.СчетКт,
		|	ДанныеУчета.СубконтоКт1,
		|	ДанныеУчета.СубконтоКт2,
		|	ДанныеУчета.СубконтоКт3,
		//vvv
		|	ДанныеУчета.СубконтоКт4,
		///////////////////
		|	ДанныеУчета.СчетДтНалогов,
		|	ДанныеУчета.СубконтоДтНалогов1,
		|	ДанныеУчета.СубконтоДтНалогов2,
		|	ДанныеУчета.СубконтоДтНалогов3,
		|	ДанныеУчета.СубконтоДтНалогов4,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтНалогов.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтНалогов,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтСотрудника.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтСотрудника,
		//
		|	ДанныеУчета.СчетДтНУ,
		|	ДанныеУчета.СчетКтНУ,
		|	ДанныеУчета.СубконтоДтНУ1,
		|	ДанныеУчета.СубконтоДтНУ2,
		|	ДанныеУчета.СубконтоДтНУ3,
		|	ДанныеУчета.СубконтоКтНУ1,
		|	ДанныеУчета.СубконтоКтНУ2,
		|	ДанныеУчета.СубконтоКтНУ3,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.ВидНачисленияПоСт255НК,
		|	ДанныеУчета.СтратегияОтраженияВУчете,
		|	ДанныеУчета.ПодразделениеОрганизации,
		//vvv
		|	ДанныеУчета.Автомобиль,
		|	ДанныеУчета.СчетДтСотрудника,
		|	ДанныеУчета.СубконтоДтСотрудника1,
		|	ДанныеУчета.СубконтоДтСотрудника2,
		|	ДанныеУчета.СубконтоДтСотрудника3,
		|	ДанныеУчета.СубконтоДтСотрудника4,
		|	ДанныеУчета.ВидРасчета.ОтчисленияОтносятсяНаЗатратыСотрудника КАК ОтчисленияОтносятсяНаЗатратыСотрудника,
		//
		|	ДанныеУчета.Результат,
		|	ДанныеУчета.ПериодДействияНачало,
		|	ДанныеУчета.ПериодДействияКонец,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
		|	ДанныеУчета.ДатаНачалаСобытия,
		|	ЕСТЬNULL(ВидыСубконтоРаботникиДт.НомерСтроки, 0) КАК НомерСубконтоРаботникиДт,
		|	ЕСТЬNULL(ВидыСубконтоРаботникиКт.НомерСтроки, 0) КАК НомерСубконтоРаботникиКт,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДт.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДт,
		//vvv
		|	ЕСТЬNULL(ВидыСубконтоАвтомобилиДт.НомерСтроки, 0) КАК НомерСубконтоАвтомобилиДт,
		|	ЕСТЬNULL(ВидыСубконтоАвтомобилиДтСотрудника.НомерСтроки, 0) КАК НомерСубконтоАвтомобилиДтСотрудника,
		|	ЕСТЬNULL(ВидыСубконтоАвтомобилиДтНалогов.НомерСтроки, 0) КАК НомерСубконтоАвтомобилиДтНалогов,
		//
		|	ЕСТЬNULL(ВидыСубконтоРаботникиДтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиДтНУ,
		|	ЕСТЬNULL(ВидыСубконтоРаботникиКтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиКтНУ,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтНУ.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтНУ,
		|	ЕСТЬNULL(ВидыСубконтоСтатьиЗатратДт.НомерСтроки, 0) КАК НомерСубконтоСтатьиЗатратДт,
		|	ЕСТЬNULL(ВидыСубконтоСтатьиЗатратДтНУ.НомерСтроки, 0) КАК НомерСубконтоСтатьиЗатратДтНУ,
		|	ЕСТЬNULL(СубконтоСт255НК.НомерСтроки, 0) КАК НомерСубконтоСт255НК,
		|	ЕСТЬNULL(База.СчетДтРазрез, 0) КАК СчетДтРазрез,
		|	ЕСТЬNULL(База.СчетКтРазрез, 0) КАК СчетКтРазрез,
		|	ЕСТЬNULL(База.СубконтоДт1Разрез, 0) КАК СубконтоДт1Разрез,
		|	ЕСТЬNULL(База.СубконтоДт2Разрез, 0) КАК СубконтоДт2Разрез,
		|	ЕСТЬNULL(База.СубконтоДт3Разрез, 0) КАК СубконтоДт3Разрез,
		//vvv
		|	ЕСТЬNULL(База.СубконтоДт4Разрез, 0) КАК СубконтоДт4Разрез,
		//
		|	ЕСТЬNULL(База.СубконтоКт1Разрез, 0) КАК СубконтоКт1Разрез,
		|	ЕСТЬNULL(База.СубконтоКт2Разрез, 0) КАК СубконтоКт2Разрез,
		|	ЕСТЬNULL(База.СубконтоКт3Разрез, 0) КАК СубконтоКт3Разрез,
		//vvv
		|	ЕСТЬNULL(База.СубконтоКт4Разрез, 0) КАК СубконтоКт4Разрез,
		//
		|	ЕСТЬNULL(База.СчетДтНУРазрез, 0) КАК СчетДтНУРазрез,
		|	ЕСТЬNULL(База.СчетКтНУРазрез, 0) КАК СчетКтНУРазрез,
		|	ЕСТЬNULL(СубконтоСт255НКБазы.НомерСтроки, 0) КАК НомерСубконтоСт255НКБазы,
		|	ЕСТЬNULL(База.СубконтоДтНУ1Разрез, 0) КАК СубконтоДтНУ1Разрез,
		|	ЕСТЬNULL(База.СубконтоДтНУ2Разрез, 0) КАК СубконтоДтНУ2Разрез,
		|	ЕСТЬNULL(База.СубконтоДтНУ3Разрез, 0) КАК СубконтоДтНУ3Разрез,
		|	ЕСТЬNULL(База.СубконтоКтНУ1Разрез, 0) КАК СубконтоКтНУ1Разрез,
		|	ЕСТЬNULL(База.СубконтоКтНУ2Разрез, 0) КАК СубконтоКтНУ2Разрез,
		|	ЕСТЬNULL(База.СубконтоКтНУ3Разрез, 0) КАК СубконтоКтНУ3Разрез,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.ДоляСпособаОтражения ЕСТЬ НЕ NULL 
		|			ТОГДА ДанныеУчета.ДоляСпособаОтражения
		|		КОГДА База.РезультатБаза ЕСТЬ НЕ NULL 
		|			ТОГДА База.РезультатБаза
		|	КОНЕЦ КАК РезультатБаза,
		|	ДанныеУчета.ДоляСпособаОтражения,
		|	ДанныеУчета.РезультатСторно КАК РезультатСторно,
		|	ДанныеУчета.ПериодДействияНачалоСторно КАК ПериодДействияНачалоСторно,
		|	ДанныеУчета.ПериодДействияКонецСторно КАК ПериодДействияКонецСторно
		|ИЗ
		|	ДанныеУчета КАК ДанныеУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоРаботникиДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоРаботникиДт.Ссылка
		|			И (ВидыСубконтоРаботникиДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоРаботникиКт
		|		ПО (ДанныеУчета.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетКт = ВидыСубконтоРаботникиКт.Ссылка
		|			И (ВидыСубконтоРаботникиКт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоПодразделенияДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоПодразделенияДт.Ссылка
		|			И (ВидыСубконтоПодразделенияДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		//vvv
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоПодразделенияДтНалогов
		|		ПО (ДанныеУчета.СчетДтНалогов <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНалогов = ВидыСубконтоПодразделенияДтНалогов.Ссылка
		|			И (ВидыСубконтоПодразделенияДтНалогов.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоПодразделенияДтСотрудника
		|		ПО (ДанныеУчета.СчетДтСотрудника <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтСотрудника = ВидыСубконтоПодразделенияДтСотрудника.Ссылка
		|			И (ВидыСубконтоПодразделенияДтСотрудника.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоАвтомобилиДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоАвтомобилиДт.Ссылка
		|			И (ВидыСубконтоАвтомобилиДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Автомобили))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоАвтомобилиДтСотрудника
		|		ПО (ДанныеУчета.СчетДтСотрудника <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтСотрудника = ВидыСубконтоАвтомобилиДтСотрудника.Ссылка
		|			И (ВидыСубконтоАвтомобилиДтСотрудника.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Автомобили))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоАвтомобилиДтНалогов
		|		ПО (ДанныеУчета.СчетДтНалогов <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНалогов = ВидыСубконтоАвтомобилиДтНалогов.Ссылка
		|			И (ВидыСубконтоАвтомобилиДтНалогов.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Автомобили))
		//
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоСтатьиЗатратДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоСтатьиЗатратДт.Ссылка
		|			И (ВидыСубконтоСтатьиЗатратДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоСтатьиЗатратДтНУ
		|		ПО (ДанныеУчета.СчетДтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНУ = ВидыСубконтоСтатьиЗатратДтНУ.Ссылка
		|			И (ВидыСубконтоСтатьиЗатратДтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК СубконтоСт255НК
		|		ПО (ДанныеУчета.СчетКтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетКтНУ = СубконтоСт255НК.Ссылка
		|			И (СубконтоСт255НК.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидНачисленийОплатыТрудаПоСтатье255НК))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиДтНУ
		|		ПО (ДанныеУчета.СчетДтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНУ = ВидыСубконтоРаботникиДтНУ.Ссылка
		|			И (ВидыСубконтоРаботникиДтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиКтНУ
		|		ПО (ДанныеУчета.СчетКтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетКтНУ = ВидыСубконтоРаботникиКтНУ.Ссылка
		|			И (ВидыСубконтоРаботникиКтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоПодразделенияДтНУ
		|		ПО (ДанныеУчета.СчетДтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНУ = ВидыСубконтоПодразделенияДтНУ.Ссылка
		|			И (ВидыСубконтоПодразделенияДтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_База КАК База
		|		ПО ДанныеУчета.Регистратор = База.Регистратор
		|			И ДанныеУчета.НомерСтроки = База.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК СубконтоСт255НКБазы
		|		ПО (ЕСТЬNULL(База.СчетКтНУРазрез, 0) <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И (ЕСТЬNULL(База.СчетКтНУРазрез, 0) = СубконтоСт255НКБазы.Ссылка)
		|			И (СубконтоСт255НКБазы.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидНачисленийОплатыТрудаПоСтатье255НК))
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование,
		|	Регистратор,
		|	НомерСтроки,
		|	СчетДтРазрез,
		|	СчетДтНУРазрез,
		|	СубконтоДт1Разрез,
		|	СубконтоДт2Разрез,
		|	СубконтоДтНУ1Разрез,
		|	СубконтоДтНУ2Разрез,
		|	СчетДт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		
	Иначе // Дополнительные начисления
		
		Если Не ЭтоПервичныеНачисления Тогда
			
			//соберем базу для зависимых начислений
			БазаТекст = 
			"ВЫБРАТЬ
			|	База.Регистратор КАК Регистратор,
			|	База.НомерСтроки КАК НомерСтроки,
			|	База.СчетДтРазрез КАК СчетДтРазрез,
			|	База.СчетКтРазрез КАК СчетКтРазрез,
			|	База.СубконтоДт1Разрез КАК СубконтоДт1Разрез,
			|	База.СубконтоДт2Разрез КАК СубконтоДт2Разрез,
			|	База.СубконтоДт3Разрез КАК СубконтоДт3Разрез,
			//vvv
			|	База.СубконтоДт4Разрез КАК СубконтоДт4Разрез,
			//
			|	База.СубконтоКт1Разрез КАК СубконтоКт1Разрез,
			|	База.СубконтоКт2Разрез КАК СубконтоКт2Разрез,
			|	База.СубконтоКт3Разрез КАК СубконтоКт3Разрез,
			//vvv
			|	База.СубконтоКт4Разрез КАК СубконтоКт4Разрез,
			//
			|	База.СчетДтНУРазрез КАК СчетДтНУРазрез,
			|	База.СчетКтНУРазрез КАК СчетКтНУРазрез,
			|	База.СубконтоДтНУ1Разрез КАК СубконтоДтНУ1Разрез,
			|	База.СубконтоДтНУ2Разрез КАК СубконтоДтНУ2Разрез,
			|	База.СубконтоДтНУ3Разрез КАК СубконтоДтНУ3Разрез,
			|	База.СубконтоКтНУ1Разрез КАК СубконтоКтНУ1Разрез,
			|	База.СубконтоКтНУ2Разрез КАК СубконтоКтНУ2Разрез,
			|	База.СубконтоКтНУ3Разрез КАК СубконтоКтНУ3Разрез,
			|	СУММА(База.РезультатБаза) КАК РезультатБаза
			|ПОМЕСТИТЬ База
			|ИЗ
			|	(ВЫБРАТЬ
			|		БазаБУДополнительныеНачисления.Регистратор КАК Регистратор,
			|		БазаБУДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
			|		БазаБУДополнительныеНачисления.СчетДтРазрез КАК СчетДтРазрез,
			|		БазаБУДополнительныеНачисления.СчетКтРазрез КАК СчетКтРазрез,
			|		БазаБУДополнительныеНачисления.СубконтоДт1Разрез КАК СубконтоДт1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДт2Разрез КАК СубконтоДт2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДт3Разрез КАК СубконтоДт3Разрез,
			//vvv
			|		БазаБУДополнительныеНачисления.СубконтоДт4Разрез КАК СубконтоДт4Разрез,
			//
			|		БазаБУДополнительныеНачисления.СубконтоКт1Разрез КАК СубконтоКт1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКт2Разрез КАК СубконтоКт2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКт3Разрез КАК СубконтоКт3Разрез,
			//vvv
			|		БазаБУДополнительныеНачисления.СубконтоКт4Разрез КАК СубконтоКт4Разрез,
			//
			|		БазаБУДополнительныеНачисления.СчетДтНУРазрез КАК СчетДтНУРазрез,
			|		БазаБУДополнительныеНачисления.СчетКтНУРазрез КАК СчетКтНУРазрез,
			|		БазаБУДополнительныеНачисления.СубконтоДтНУ1Разрез КАК СубконтоДтНУ1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДтНУ2Разрез КАК СубконтоДтНУ2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоДтНУ3Разрез КАК СубконтоДтНУ3Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКтНУ1Разрез КАК СубконтоКтНУ1Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКтНУ2Разрез КАК СубконтоКтНУ2Разрез,
			|		БазаБУДополнительныеНачисления.СубконтоКтНУ3Разрез КАК СубконтоКтНУ3Разрез,
			|		БазаБУДополнительныеНачисления.РезультатБаза КАК РезультатБаза
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.БазаБУДополнительныеНачисления(
			|				&парамИзмерения,
			|				&парамИзмерения,
			|				&парамРазрезыБУ,
			|				ОбособленноеПодразделение = &парамОрганизация
			|					И НАЧАЛОПЕРИОДА(ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
			|					И ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
			|					И ВидРасчета В (&парамСписокНачислений)
			|					И (НЕ Сторно)) КАК БазаБУДополнительныеНачисления
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		БазаБУОсновныеНачисления.Регистратор,
			|		БазаБУОсновныеНачисления.НомерСтроки,
			|		БазаБУОсновныеНачисления.СчетДтРазрез,
			|		БазаБУОсновныеНачисления.СчетКтРазрез,
			|		БазаБУОсновныеНачисления.СубконтоДт1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДт2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДт3Разрез,
			//vvv
			|		БазаБУОсновныеНачисления.СубконтоДт4Разрез,
			//
			|		БазаБУОсновныеНачисления.СубконтоКт1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКт2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКт3Разрез,
			//vvv
			|		БазаБУОсновныеНачисления.СубконтоКт4Разрез,
			//
			|		БазаБУОсновныеНачисления.СчетДтНУРазрез,
			|		БазаБУОсновныеНачисления.СчетКтНУРазрез,
			|		БазаБУОсновныеНачисления.СубконтоДтНУ1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДтНУ2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоДтНУ3Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКтНУ1Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКтНУ2Разрез,
			|		БазаБУОсновныеНачисления.СубконтоКтНУ3Разрез,
			|		БазаБУОсновныеНачисления.РезультатБаза
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.БазаБУОсновныеНачисления(
			|				&парамИзмерения,
			|				&парамИзмерения,
			|				&парамРазрезыБУ,
			|				ОбособленноеПодразделение = &парамОрганизация
			|					И НАЧАЛОПЕРИОДА(ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
			|					И ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
			|					И ВидРасчета В (&парамСписокНачислений)
			|					И (НЕ Сторно)) КАК БазаБУОсновныеНачисления) КАК База
			|
			|СГРУППИРОВАТЬ ПО
			|	База.Регистратор,
			|	База.НомерСтроки,
			|	База.СчетДтРазрез,
			|	База.СчетКтРазрез,
			|	База.СубконтоДт1Разрез,
			|	База.СубконтоДт2Разрез,
			|	База.СубконтоДт3Разрез,
			//vvv
			|	База.СубконтоДт4Разрез,
			//
			|	База.СубконтоКт1Разрез,
			|	База.СубконтоКт2Разрез,
			|	База.СубконтоКт3Разрез,
			//vvv
			|	База.СубконтоКт4Разрез,
			//
			|	База.СчетДтНУРазрез,
			|	База.СчетКтНУРазрез,
			|	База.СубконтоДтНУ1Разрез,
			|	База.СубконтоДтНУ2Разрез,
			|	База.СубконтоДтНУ3Разрез,
			|	База.СубконтоКтНУ1Разрез,
			|	База.СубконтоКтНУ2Разрез,
			|	База.СубконтоКтНУ3Разрез
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
			
		Иначе
			
			БазаТекст = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Документ.НачислениеЗарплатыРаботникамОрганизаций.ПустаяСсылка) КАК Регистратор,
			|	0 КАК НомерСтроки,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДтРазрез,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКтРазрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДт1Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДт2Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДт3Разрез,
			//vvv
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДт4Разрез,
			//
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКт1Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКт2Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКт3Разрез,
			//vvv
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКт4Разрез,
			//
			|	ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка) КАК СчетДтНУРазрез,
			|	ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка) КАК СчетКтНУРазрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДтНУ1Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДтНУ2Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоДтНУ3Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКтНУ1Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКтНУ2Разрез,
			|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СубконтоКтНУ3Разрез,
			|	0 КАК РезультатБаза
			|ПОМЕСТИТЬ База";
			
		КонецЕсли;
		
		Запрос.Текст = БазаТекст;
		//временная таблица - База
		Запрос.Выполнить();
		
		///////////////////////////////////////////////////////////////////////////////////
		//получим отражение в учете сторно записей
		
		ДополнительныеНачисленияСторноТекст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник,
		|	ДополнительныеНачисления.ВидРасчета,
		|	ДополнительныеНачисления.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВТ_ДополнительныеНачисленияСторно
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
		|	И ДополнительныеНачисления.Результат <> 0
		|	И ДополнительныеНачисления.Сторно";
		
		Запрос.Текст = ДополнительныеНачисленияСторноТекст;
		//временная таблица - ВТ_ДополнительныеНачисленияСторно
		Результат = Запрос.Выполнить().Выгрузить();
		КоличествоСторноЗаписей = Результат[0].Количество; 
		
		Если КоличествоСторноЗаписей <> 0 Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДополнительныеНачисленияСторно.Регистратор КАК Регистратор,
			|	ДополнительныеНачисленияСторно.НомерСтроки КАК НомерСтроки,
			|	ДополнительныеНачисленияСторно.Сотрудник КАК Сотрудник,
			|	ДополнительныеНачисленияСторно.ВидРасчета КАК ВидРасчета,
			|	ДополнительныеНачисленияСторно.СторнируемыйДокумент КАК СторнируемыйДокумент,
			|	НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) КАК ПериодРегистрации
			|ПОМЕСТИТЬ ВТ_СторноСотрудники
			|ИЗ
			|	ВТ_ДополнительныеНачисленияСторно КАК ДополнительныеНачисленияСторно
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
			|		ПО ДополнительныеНачисленияСторно.СторнируемыйДокумент = ДополнительныеНачисления.Регистратор
			|ГДЕ
			|	ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник,
			|	ПериодРегистрации,
			|	ВидРасчета";
			
			//временная таблица - ВТ_СторноСотрудники
			Запрос.Выполнить();
			
			ОтражениеВУчетеСторноТекст = 
			"ВЫБРАТЬ
			|	ДополнительныеНачисления.Регистратор КАК Регистратор,
			|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
			|	БУДополнительныеНачисления.СчетДт,
			|	БУДополнительныеНачисления.СубконтоДт1,
			|	БУДополнительныеНачисления.СубконтоДт2,
			|	БУДополнительныеНачисления.СубконтоДт3,
			//vvv
			|	БУДополнительныеНачисления.СубконтоДт4,
			//
			|	БУДополнительныеНачисления.СчетКт,
			|	БУДополнительныеНачисления.СубконтоКт1,
			|	БУДополнительныеНачисления.СубконтоКт2,
			|	БУДополнительныеНачисления.СубконтоКт3,
			//vvv
			|	БУДополнительныеНачисления.СубконтоКт4,
			//
			|	БУДополнительныеНачисления.СчетДтНУ,
			|	БУДополнительныеНачисления.СубконтоДтНУ1,
			|	БУДополнительныеНачисления.СубконтоДтНУ2,
			|	БУДополнительныеНачисления.СубконтоДтНУ3,
			|	БУДополнительныеНачисления.СчетКтНУ,
			|	БУДополнительныеНачисления.СубконтоКтНУ1,
			|	БУДополнительныеНачисления.СубконтоКтНУ2,
			|	БУДополнительныеНачисления.СубконтоКтНУ3,
			|	БУДополнительныеНачисления.Результат
			|ПОМЕСТИТЬ ВТ_ОтражениеВУчетеСторно
			|ИЗ
			|	ВТ_СторноСотрудники КАК ДополнительныеНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			БУДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
			|			БУДополнительныеНачисления.Сотрудник КАК Сотрудник,
			|			БУДополнительныеНачисления.ФизЛицо КАК ФизЛицо,
			|			БУДополнительныеНачисления.Организация КАК Организация,
			|			БУДополнительныеНачисления.Результат КАК Результат,
			|			БУДополнительныеНачисления.СчетДт КАК СчетДт,
			|			БУДополнительныеНачисления.СубконтоДт1 КАК СубконтоДт1,
			|			БУДополнительныеНачисления.СубконтоДт2 КАК СубконтоДт2,
			|			БУДополнительныеНачисления.СубконтоДт3 КАК СубконтоДт3,
			//vvv
			|			БУДополнительныеНачисления.СубконтоДт4 КАК СубконтоДт4,
			//
			|			БУДополнительныеНачисления.СчетКт КАК СчетКт,
			|			БУДополнительныеНачисления.СубконтоКт1 КАК СубконтоКт1,
			|			БУДополнительныеНачисления.СубконтоКт2 КАК СубконтоКт2,
			|			БУДополнительныеНачисления.СубконтоКт3 КАК СубконтоКт3,
			//vvv
			|			БУДополнительныеНачисления.СубконтоКт4 КАК СубконтоКт4,
			//
			|			БУДополнительныеНачисления.СчетДтНУ КАК СчетДтНУ,
			|			БУДополнительныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
			|			БУДополнительныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
			|			БУДополнительныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
			|			БУДополнительныеНачисления.СчетКтНУ КАК СчетКтНУ,
			|			БУДополнительныеНачисления.СубконтоКтНУ1 КАК СубконтоКтНУ1,
			|			БУДополнительныеНачисления.СубконтоКтНУ2 КАК СубконтоКтНУ2,
			|			БУДополнительныеНачисления.СубконтоКтНУ3 КАК СубконтоКтНУ3,
			|			БУДополнительныеНачисления.ДокументОснование КАК ДокументОснование
			|		ИЗ
			|			РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
			|		ГДЕ
			|			(НАЧАЛОПЕРИОДА(БУДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ), БУДополнительныеНачисления.Сотрудник, БУДополнительныеНачисления.ВидРасчета) В
			|					(ВЫБРАТЬ
			|						ДополнительныеНачисления.ПериодРегистрации,
			|						ДополнительныеНачисления.Сотрудник,
			|						ДополнительныеНачисления.ВидРасчета
			|					ИЗ
			|						ВТ_СторноСотрудники КАК ДополнительныеНачисления)
			|			И (НЕ БУДополнительныеНачисления.Сторно)) КАК БУДополнительныеНачисления
			|		ПО ДополнительныеНачисления.ВидРасчета = БУДополнительныеНачисления.ВидРасчета
			|			И ДополнительныеНачисления.Сотрудник = БУДополнительныеНачисления.Сотрудник
			|			И ДополнительныеНачисления.СторнируемыйДокумент = БУДополнительныеНачисления.ДокументОснование
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
			
		Иначе
			
			ОтражениеВУчетеСторноТекст = 
			"ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Регистратор,
			|	НЕОПРЕДЕЛЕНО КАК НомерСтроки,
			|	НЕОПРЕДЕЛЕНО КАК СчетДт,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			//vvv
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт4,
			//
			|	НЕОПРЕДЕЛЕНО КАК СчетКт,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			//vvv
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт4,
			//
			|	НЕОПРЕДЕЛЕНО КАК СчетДтНУ,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
			|	НЕОПРЕДЕЛЕНО КАК СчетКтНУ,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
			|	0 КАК Результат
			|ПОМЕСТИТЬ ВТ_ОтражениеВУчетеСторно";
			
		КонецЕсли;
		
		Запрос.Текст = ОтражениеВУчетеСторноТекст;
		//временная таблица - ВТ_ОтражениеВУчетеСторно
		Запрос.Выполнить();
		
		//получили отражение в учете сторно записей
		///////////////////////////////////////////////////////////////////////////////////
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ПЛАНОВЫХ НАЧИСЛЕНИЙ
		// таблица ВТ_УчетПлановыхНачислений
		
		УчетПлановыхНачисленийТекст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ДополнительныеНачисления.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_ДополнительныеНачислениДляПлановый
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
		|	И ДополнительныеНачисления.Результат <> 0
		|	И ДополнительныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|	И (НЕ ДополнительныеНачисления.Сторно)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период,
		|	ДополнительныеНачисления.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_СведенияОНачислениях
		|ИЗ
		|	ВТ_ДополнительныеНачислениДляПлановый КАК ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|		ПО ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|			И ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|			И ДополнительныеНачисления.ДокументОснование = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеНачисления.Регистратор,
		|	ДополнительныеНачисления.НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник,
		|	ДополнительныеНачисления.ВидРасчета,
		|	ДополнительныеНачисления.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
		|	СведенияОНачисленияхСрез.Регистратор КАК Регистратор,
		|	СведенияОНачисленияхСрез.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_УчетПлановыхНачислений
		|ИЗ
		|	РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОНачислениях КАК СведенияОНачисленияхСрез
		|		ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|			И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|			И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			И (СведенияОНачисленияхСрез.ДокументОснование = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ДокументОснование)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
		Запрос.Текст = УчетПлановыхНачисленийТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ПЛАНОВЫХ НАЧИСЛЕНИЙ
		///////////////////////////////////////////////////////////////////////////////////
		
		ДополнительныеНачисленияТекст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ДополнительныеНачисления.ПериодРегистрации,
		|	ДополнительныеНачисления.ПодразделениеОрганизации,
		|	ДополнительныеНачисления.ОбособленноеПодразделение
		|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
		|	И ДополнительныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия)
		|	И ДополнительныеНачисления.Результат <> 0
		|	И ДополнительныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|	И (НЕ ДополнительныеНачисления.Сторно)";
		Запрос.Текст = ДополнительныеНачисленияТекст;
		Запрос.Выполнить();
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА РАБОТНИКОВ
		// таблица ВТ_УчетОсновногоЗаработка

		УчетОсновногоЗаработкаТекст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(УчетЗарВРеглУчете.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СведенияОРаботниках
		|ИЗ
		|	ВТ_ДополнительныеНачисления КАК ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете КАК УчетЗарВРеглУчете
		|		ПО ДополнительныеНачисления.Сотрудник = УчетЗарВРеглУчете.Сотрудник
		//vvv берем начало месяца, т.к. если сотрудник принят в середине месяца - отражение не бралось
		//|			И (УчетЗарВРеглУчете.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|			И (НАЧАЛОПЕРИОДА(УчетЗарВРеглУчете.Период,МЕСЯЦ) <= ДополнительныеНачисления.ПериодРегистрации)
		//
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеНачисления.Регистратор,
		|	ДополнительныеНачисления.НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете,
		|	СведенияОРаботникахСрез.Регистратор КАК Регистратор,
		|	СведенияОРаботникахСрез.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_УчетОсновногоЗаработка
		|ИЗ
		|	РегистрСведений.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете КАК УчетЗарВРеглУчете
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОРаботниках КАК СведенияОРаботникахСрез
		|		ПО (СведенияОРаботникахСрез.Сотрудник = УчетЗарВРеглУчете.Сотрудник)
		|			И (СведенияОРаботникахСрез.Период = УчетЗарВРеглУчете.Период)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
		Запрос.Текст = УчетОсновногоЗаработкаТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА РАБОТНИКОВ
		///////////////////////////////////////////////////////////////////////////////////
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ПОДРАЗДЕЛЕНИЯ
		// таблица ВТ_УчетОсновногоЗаработкаПодразделения

		УчетОсновногоЗаработкаПодразделенияТекст =
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	МАКСИМУМ(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СведенияОПодразделениях
		|ИЗ
		|	ВТ_ДополнительныеНачисления КАК ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО ДополнительныеНачисления.ПодразделениеОрганизации = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.ПодразделениеОрганизации
		|			И (УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеНачисления.ПодразделениеОрганизации,
		|	ДополнительныеНачисления.Регистратор,
		|	ДополнительныеНачисления.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодразделениеОрганизации,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОПодразделенияхСрез.Регистратор КАК Регистратор,
		|	СведенияОПодразделенияхСрез.НомерСтроки КАК НомерСтроки,
		|	УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете
		|ПОМЕСТИТЬ ВТ_УчетОсновногоЗаработкаПодразделения
		|ИЗ
		|	ВТ_СведенияОПодразделениях КАК СведенияОПодразделенияхСрез
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО СведенияОПодразделенияхСрез.ПодразделениеОрганизации = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.ПодразделениеОрганизации
		|			И СведенияОПодразделенияхСрез.Период = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
		Запрос.Текст = УчетОсновногоЗаработкаПодразделенияТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ПОДРАЗДЕЛЕНИЯ
		///////////////////////////////////////////////////////////////////////////////////
		
		///////////////////////////////////////////////////////////////////////////////////
		// ПОЛУЧЕНИЕ СПОСОБОВ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ОРГАНИЗАЦИИ
		// таблица ВТ_УчетОсновногоЗаработкаОрганизации
		
		УчетОсновногоЗаработкаОрганизацииТекст =
        "ВЫБРАТЬ
        |	ДополнительныеНачисления.Регистратор КАК Регистратор,
        |	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
        |	ДополнительныеНачисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
        |	МАКСИМУМ(УчетОсновногоЗаработкаОрганизации.Период) КАК Период
        |ПОМЕСТИТЬ ВТ_СведенияПоОрганизации
        |ИЗ
        |	ВТ_ДополнительныеНачисления КАК ДополнительныеНачисления
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
        |		ПО ДополнительныеНачисления.ОбособленноеПодразделение = УчетОсновногоЗаработкаОрганизации.Организация
        |			И (УчетОсновногоЗаработкаОрганизации.Период <= ДополнительныеНачисления.ПериодРегистрации)
        |
        |СГРУППИРОВАТЬ ПО
        |	ДополнительныеНачисления.ОбособленноеПодразделение,
        |	ДополнительныеНачисления.Регистратор,
        |	ДополнительныеНачисления.НомерСтроки
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	СведенияПоОрганизации.Регистратор КАК Регистратор,
        |	СведенияПоОрганизации.НомерСтроки КАК НомерСтроки,
        |	УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете КАК СпособОтраженияВБухучете
        |ПОМЕСТИТЬ ВТ_УчетОсновногоЗаработкаОрганизации
        |ИЗ
        |	ВТ_СведенияПоОрганизации КАК СведенияПоОрганизации
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
        |		ПО СведенияПоОрганизации.ОбособленноеПодразделение = УчетОсновногоЗаработкаОрганизации.Организация
        |			И СведенияПоОрганизации.Период = УчетОсновногоЗаработкаОрганизации.Период
        |
        |ИНДЕКСИРОВАТЬ ПО
        |	Регистратор,
        |	НомерСтроки";
		Запрос.Текст = УчетОсновногоЗаработкаОрганизацииТекст;
		Запрос.Выполнить();
		
		// ПОЛУЧИЛИ СПОСОБЫ ОТРАЖЕНИЯ В УЧЕТЕ ОСНОВНОГО ЗАРАБОТКА ОРГАНИЗАЦИИ
		///////////////////////////////////////////////////////////////////////////////////
		
		ДанныеУчетаТекст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Регистратор КАК Регистратор,
		|	ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ДополнительныеНачисления.ФизЛицо КАК ФизЛицо,
		|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ДополнительныеНачисления.ВидРасчета.ВидНачисленияПоСт255НК КАК ВидНачисленияПоСт255НК,
		|	ДополнительныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ДополнительныеНачисления.ВидРасчета.СтратегияОтраженияВУчете КАК СтратегияОтраженияВУчете,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДт
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СчетДт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетКт
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СчетКт
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКт
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетКт
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетКт
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетКт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетКт
		|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт1
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоДт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт1
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт2
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоДт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт3
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоДт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт3
		|	КОНЕЦ КАК СубконтоДт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДт4
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоДт4		
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт4
		|	КОНЕЦ КАК СубконтоДт4,
		//
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт1
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоКт1
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт1
		|	КОНЕЦ КАК СубконтоКт1,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт2
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоКт2
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт2
		|	КОНЕЦ КАК СубконтоКт2,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт3
		//vvv
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоКт3
		//
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт3
		|	КОНЕЦ КАК СубконтоКт3,
		//vvv
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКт4
		|		КОГДА ДополнительныеНачисления.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.СпособОтраженияВБухучете.СубконтоКт4		
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКт4
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКт4
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКт4
		|	КОНЕЦ КАК СубконтоКт4,
		//
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетДтНУ
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетДтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетНУ
		|	КОНЕЦ КАК СчетДтНУ,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СчетКтНУ
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СчетКтНУ
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СчетКтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетКтНУ
		|	КОНЕЦ КАК СчетКтНУ,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ1
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ1
		|	КОНЕЦ КАК СубконтоДтНУ1,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ2
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ2
		|	КОНЕЦ КАК СубконтоДтНУ2,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоДтНУ3
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ3
		|	КОНЕЦ КАК СубконтоДтНУ3,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ1
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ1
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ1
		|	КОНЕЦ КАК СубконтоКтНУ1,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ2
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ2
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ2
		|	КОНЕЦ КАК СубконтоКтНУ2,
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.Сторно
		|			ТОГДА ОтражениеВУчетеСторно.СубконтоКтНУ3
		|		КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА Распределение.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА Распределение.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		КОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|			ТОГДА УчетОсновногоЗаработкаОрганизации.СпособОтраженияВБухучете.СубконтоКтНУ3
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоКтНУ3
		|	КОНЕЦ КАК СубконтоКтНУ3,
		|	Распределение.ДоляСпособаОтражения КАК ДоляСпособаОтражения,
		|	ДополнительныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//vvv
		|	ВодителиОрганизаций.Автомобиль КАК Автомобиль,
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете.СчетДт КАК СчетДтСотрудника,
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДтСотрудника1,
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДтСотрудника2,
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДтСотрудника3,
		|	УчетЗарВРеглУчете.СпособОтраженияВБухучете.СубконтоДт4 КАК СубконтоДтСотрудника4,
		//
		|	ДополнительныеНачисления.Результат КАК Результат,
		|	ДополнительныеНачисления.Сторно КАК Сторно,
		|	ДополнительныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		//vvv
		|	ВЫБОР
		|		КОГДА ДополнительныеНачисления.БазовыйПериодНачало=ДАТАВРЕМЯ(1,1,1,0,0,0) ТОГДА ДополнительныеНачисления.ПериодРегистрации
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисления.БазовыйПериодНачало,МЕСЯЦ)
		|	КОНЕЦ КАК ПериодДействияДоп,
		//
		|	ОтражениеВУчетеСторно.Результат КАК РезультатСторно,
		|	ДополнительныеНачисления.Сотрудник.Наименование КАК СотрудникНаименование
		|ПОМЕСТИТЬ ДанныеУчета
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетПлановыхНачислений КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|		ПО ДополнительныеНачисления.Регистратор = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Регистратор
		|			И ДополнительныеНачисления.НомерСтроки = РеглУчетПлановыхНачисленийРаботниковОрганизаций.НомерСтроки
		|			И ((НЕ ДополнительныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК Распределение
		|		ПО ДополнительныеНачисления.Сотрудник = Распределение.Сотрудник
		|			И (НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = Распределение.ПериодРегистрации)
		|			И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете ЕСТЬ NULL )
		|			И (ДополнительныеНачисления.ВидРасчета.СтратегияОтраженияВУчете = ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия))
		|			И ((НЕ ДополнительныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработка КАК УчетЗарВРеглУчете
		|		ПО ДополнительныеНачисления.Регистратор = УчетЗарВРеглУчете.Регистратор
		|			И ДополнительныеНачисления.НомерСтроки = УчетЗарВРеглУчете.НомерСтроки
		|			И ((НЕ ДополнительныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаПодразделения КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации
		|		ПО ДополнительныеНачисления.Регистратор = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.Регистратор
		|			И ДополнительныеНачисления.НомерСтроки = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.НомерСтроки
		|			И ((НЕ ДополнительныеНачисления.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетОсновногоЗаработкаОрганизации КАК УчетОсновногоЗаработкаОрганизации
		|		ПО ДополнительныеНачисления.Регистратор = УчетОсновногоЗаработкаОрганизации.Регистратор
		|			И ДополнительныеНачисления.НомерСтроки = УчетОсновногоЗаработкаОрганизации.НомерСтроки
		|			И ((НЕ ДополнительныеНачисления.Сторно))
		//vvv
		|		ЛЕВОЕ СОЕДИНЕНИЕ (
		|			ВЫБРАТЬ
		|				ВодителиСрез.Сотрудник,
		//|				ВодителиОрганизаций.Автомобиль
		|				ВЫБОР КОГДА ВодителиОрганизаций.ПериодЗавершения<>ДАТАВРЕМЯ(1,1,1) И ВодителиОрганизаций.ПериодЗавершения<=&парамПериодРегистрации
		|					ТОГДА ВодителиОрганизаций.АвтомобильЗавершения
		|					ИНАЧЕ ВодителиОрганизаций.Автомобиль
		|				КОНЕЦ КАК Автомобиль
		|			ИЗ 
		|				(ВЫБРАТЬ 
		|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|					МАКСИМУМ(ВодителиОрганизаций.Период) КАК ПериодСреза 
		|				ИЗ
		|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВодителиОрганизаций КАК ВодителиОрганизаций 
		|						ПО ДополнительныеНачисления.Сотрудник=ВодителиОрганизаций.Сотрудник
		|						И ВодителиОрганизаций.Период<=ДополнительныеНачисления.ПериодРегистрации
		|				ГДЕ
		|					ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
		|					И ДополнительныеНачисления.Результат <> 0
		|					И ДополнительныеНачисления.ВидРасчета В(&парамСписокНачислений)
		|				СГРУППИРОВАТЬ ПО
		|					ДополнительныеНачисления.Сотрудник) КАК ВодителиСрез
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВодителиОрганизаций КАК ВодителиОрганизаций 
		|					ПО ВодителиСрез.Сотрудник=ВодителиОрганизаций.Сотрудник
		|					И ВодителиОрганизаций.Период=ВодителиСрез.ПериодСреза) КАК ВодителиОрганизаций
		|						ПО ДополнительныеНачисления.Сотрудник=ВодителиОрганизаций.Сотрудник 
		//
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.БУДополнительныеНачисления КАК БУДополнительныеНачисления
		|		ПО (БУДополнительныеНачисления.Сотрудник = ДополнительныеНачисления.Сотрудник)
		|			И (БУДополнительныеНачисления.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
		|			И (НАЧАЛОПЕРИОДА(БУДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации)
		|			И (БУДополнительныеНачисления.ДокументОснование = ДополнительныеНачисления.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеВУчетеСторно КАК ОтражениеВУчетеСторно
		|		ПО ДополнительныеНачисления.Регистратор = ОтражениеВУчетеСторно.Регистратор
		|			И ДополнительныеНачисления.НомерСтроки = ОтражениеВУчетеСторно.НомерСтроки
		|ГДЕ
		|	БУДополнительныеНачисления.Сотрудник ЕСТЬ NULL 
		|	И ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|	И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
		|	И ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.СпособОтраженияВБухучете
		|			КОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА ДополнительныеНачисления.ВидРасчета.СпособОтраженияВБухучете
		|			КОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
		|				ТОГДА УчетЗарВРеглУчете.СпособОтраженияВБухучете
		|			ИНАЧЕ &парамСпособПоУмолчанию
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете)
		|	И ДополнительныеНачисления.Результат <> 0
		|	И ДополнительныеНачисления.ВидРасчета В(&парамСписокНачислений)";
		
		Запрос.Текст = ДанныеУчетаТекст;
		//временная таблица - ДанныеУчета
		Запрос.Выполнить();
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&парамГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ДанныеУчета.Регистратор КАК Регистратор,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.СотрудникНаименование КАК СотрудникНаименование,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.СчетДт,
		|	ДанныеУчета.СубконтоДт1,
		|	ДанныеУчета.СубконтоДт2,
		|	ДанныеУчета.СубконтоДт3,
		//vvv
		|	ДанныеУчета.СубконтоДт4,
		//
		|	ДанныеУчета.СчетКт,
		|	ДанныеУчета.СубконтоКт1,
		|	ДанныеУчета.СубконтоКт2,
		|	ДанныеУчета.СубконтоКт3,
		//vvv
		|	ДанныеУчета.СубконтоКт4,
		|	NULL КАК СчетДтНалогов,
		|	NULL КАК СубконтоДтНалогов1,
		|	NULL КАК СубконтоДтНалогов2,
		|	NULL КАК СубконтоДтНалогов3,
		|	NULL КАК СубконтоДтНалогов4,
		|	0 КАК НомерСубконтоПодразделенияДтНалогов,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтСотрудника.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтСотрудника,
		//
		|	ДанныеУчета.СчетДтНУ,
		|	ДанныеУчета.СчетКтНУ,
		|	ДанныеУчета.СубконтоДтНУ1,
		|	ДанныеУчета.СубконтоДтНУ2,
		|	ДанныеУчета.СубконтоДтНУ3,
		|	ДанныеУчета.СубконтоКтНУ1,
		|	ДанныеУчета.СубконтоКтНУ2,
		|	ДанныеУчета.СубконтоКтНУ3,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.ВидНачисленияПоСт255НК,
		|	ДанныеУчета.СтратегияОтраженияВУчете,
		|	ДанныеУчета.ПодразделениеОрганизации,
		//vvv
		|	ДанныеУчета.Автомобиль,
		|	ДанныеУчета.СчетДтСотрудника,
		|	ДанныеУчета.СубконтоДтСотрудника1,
		|	ДанныеУчета.СубконтоДтСотрудника2,
		|	ДанныеУчета.СубконтоДтСотрудника3,
		|	ДанныеУчета.СубконтоДтСотрудника4,
		|	ДанныеУчета.ВидРасчета.ОтчисленияОтносятсяНаЗатратыСотрудника КАК ОтчисленияОтносятсяНаЗатратыСотрудника,
		//
		|	ДанныеУчета.Результат,
		|	ДанныеУчета.ПериодРегистрации,
		|	ЛОЖЬ КАК УказанСпособОтраженияВБухучетеЗаСчетРаботодателя,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка) КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
		|	ЕСТЬNULL(ВидыСубконтоРаботникиДт.НомерСтроки, 0) КАК НомерСубконтоРаботникиДт,
		|	ЕСТЬNULL(ВидыСубконтоРаботникиКт.НомерСтроки, 0) КАК НомерСубконтоРаботникиКт,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДт.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДт,
		//vvv
		|	ЕСТЬNULL(ВидыСубконтоАвтомобилиДт.НомерСтроки, 0) КАК НомерСубконтоАвтомобилиДт,
		|	ЕСТЬNULL(ВидыСубконтоАвтомобилиДтСотрудника.НомерСтроки, 0) КАК НомерСубконтоАвтомобилиДтСотрудника,
		|	0 КАК НомерСубконтоАвтомобилиДтНалогов,
		//
		|	ЕСТЬNULL(ВидыСубконтоРаботникиДтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиДтНУ,
		|	ЕСТЬNULL(ВидыСубконтоРаботникиКтНУ.НомерСтроки, 0) КАК НомерСубконтоРаботникиКтНУ,
		|	ЕСТЬNULL(ВидыСубконтоПодразделенияДтНУ.НомерСтроки, 0) КАК НомерСубконтоПодразделенияДтНУ,
		|	ЕСТЬNULL(ВидыСубконтоСтатьиЗатратДт.НомерСтроки, 0) КАК НомерСубконтоСтатьиЗатратДт,
		|	ЕСТЬNULL(ВидыСубконтоСтатьиЗатратДтНУ.НомерСтроки, 0) КАК НомерСубконтоСтатьиЗатратДтНУ,
		|	ЕСТЬNULL(СубконтоСт255НК.НомерСтроки, 0) КАК НомерСубконтоСт255НК,
		|	ЕСТЬNULL(База.СчетДтРазрез, 0) КАК СчетДтРазрез,
		|	ЕСТЬNULL(База.СчетКтРазрез, 0) КАК СчетКтРазрез,
		|	ЕСТЬNULL(База.СубконтоДт1Разрез, 0) КАК СубконтоДт1Разрез,
		|	ЕСТЬNULL(База.СубконтоДт2Разрез, 0) КАК СубконтоДт2Разрез,
		|	ЕСТЬNULL(База.СубконтоДт3Разрез, 0) КАК СубконтоДт3Разрез,
		//vvv
		|	ЕСТЬNULL(База.СубконтоДт4Разрез, 0) КАК СубконтоДт4Разрез,
		//
		|	ЕСТЬNULL(База.СубконтоКт1Разрез, 0) КАК СубконтоКт1Разрез,
		|	ЕСТЬNULL(База.СубконтоКт2Разрез, 0) КАК СубконтоКт2Разрез,
		|	ЕСТЬNULL(База.СубконтоКт3Разрез, 0) КАК СубконтоКт3Разрез,
		//vvv
		|	ЕСТЬNULL(База.СубконтоКт4Разрез, 0) КАК СубконтоКт4Разрез,
		|	ДанныеУчета.ПериодДействияДоп КАК ПериодДействияДоп,
		//
		|	ЕСТЬNULL(База.СчетДтНУРазрез, 0) КАК СчетДтНУРазрез,
		|	ЕСТЬNULL(База.СчетКтНУРазрез, 0) КАК СчетКтНУРазрез,
		|	ЕСТЬNULL(СубконтоСт255НКБазы.НомерСтроки, 0) КАК НомерСубконтоСт255НКБазы,
		|	ЕСТЬNULL(База.СубконтоДтНУ1Разрез, 0) КАК СубконтоДтНУ1Разрез,
		|	ЕСТЬNULL(База.СубконтоДтНУ2Разрез, 0) КАК СубконтоДтНУ2Разрез,
		|	ЕСТЬNULL(База.СубконтоДтНУ3Разрез, 0) КАК СубконтоДтНУ3Разрез,
		|	ЕСТЬNULL(База.СубконтоКтНУ1Разрез, 0) КАК СубконтоКтНУ1Разрез,
		|	ЕСТЬNULL(База.СубконтоКтНУ2Разрез, 0) КАК СубконтоКтНУ2Разрез,
		|	ЕСТЬNULL(База.СубконтоКтНУ3Разрез, 0) КАК СубконтоКтНУ3Разрез,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.ДоляСпособаОтражения ЕСТЬ НЕ NULL 
		|			ТОГДА ДанныеУчета.ДоляСпособаОтражения
		|		КОГДА База.РезультатБаза ЕСТЬ НЕ NULL 
		|			ТОГДА База.РезультатБаза
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК РезультатБаза,
		|	ДанныеУчета.Сторно КАК Сторно,
		|	ДанныеУчета.ДоляСпособаОтражения,
		|	ДанныеУчета.ДатаНачалаСобытия,
		|	ДанныеУчета.РезультатСторно КАК РезультатСторно
		|ИЗ
		|	ДанныеУчета КАК ДанныеУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоРаботникиДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоРаботникиДт.Ссылка
		|			И (ВидыСубконтоРаботникиДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоРаботникиКт
		|		ПО (ДанныеУчета.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетКт = ВидыСубконтоРаботникиКт.Ссылка
		|			И (ВидыСубконтоРаботникиКт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоПодразделенияДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоПодразделенияДт.Ссылка
		|			И (ВидыСубконтоПодразделенияДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		//vvv
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоПодразделенияДтСотрудника
		|		ПО (ДанныеУчета.СчетДтСотрудника <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтСотрудника = ВидыСубконтоПодразделенияДтСотрудника.Ссылка
		|			И (ВидыСубконтоПодразделенияДтСотрудника.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоАвтомобилиДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоАвтомобилиДт.Ссылка
		|			И (ВидыСубконтоАвтомобилиДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Автомобили))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоАвтомобилиДтСотрудника
		|		ПО (ДанныеУчета.СчетДтСотрудника <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтСотрудника = ВидыСубконтоАвтомобилиДтСотрудника.Ссылка
		|			И (ВидыСубконтоАвтомобилиДтСотрудника.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Автомобили))
		//
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконтоСтатьиЗатратДт
		|		ПО (ДанныеУчета.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|			И ДанныеУчета.СчетДт = ВидыСубконтоСтатьиЗатратДт.Ссылка
		|			И (ВидыСубконтоСтатьиЗатратДт.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоСтатьиЗатратДтНУ
		|		ПО (ДанныеУчета.СчетДтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНУ = ВидыСубконтоСтатьиЗатратДтНУ.Ссылка
		|			И (ВидыСубконтоСтатьиЗатратДтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК СубконтоСт255НК
		|		ПО (ДанныеУчета.СчетКтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетКтНУ = СубконтоСт255НК.Ссылка
		|			И (СубконтоСт255НК.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидНачисленийОплатыТрудаПоСтатье255НК))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиДтНУ
		|		ПО (ДанныеУчета.СчетДтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНУ = ВидыСубконтоРаботникиДтНУ.Ссылка
		|			И (ВидыСубконтоРаботникиДтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоРаботникиКтНУ
		|		ПО (ДанныеУчета.СчетКтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетКтНУ = ВидыСубконтоРаботникиКтНУ.Ссылка
		|			И (ВидыСубконтоРаботникиКтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК ВидыСубконтоПодразделенияДтНУ
		|		ПО (ДанныеУчета.СчетДтНУ <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И ДанныеУчета.СчетДтНУ = ВидыСубконтоПодразделенияДтНУ.Ссылка
		|			И (ВидыСубконтоПодразделенияДтНУ.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения))
		|		ЛЕВОЕ СОЕДИНЕНИЕ База КАК База
		|		ПО ДанныеУчета.Регистратор = База.Регистратор
		|			И ДанныеУчета.НомерСтроки = База.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Налоговый.ВидыСубконто КАК СубконтоСт255НКБазы
		|		ПО (ЕСТЬNULL(База.СчетКтНУРазрез, 0) <> ЗНАЧЕНИЕ(ПланСчетов.Налоговый.ПустаяСсылка))
		|			И (ЕСТЬNULL(База.СчетКтНУРазрез, 0) = СубконтоСт255НКБазы.Ссылка)
		|			И (СубконтоСт255НКБазы.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидНачисленийОплатыТрудаПоСтатье255НК))
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование,
		|	Регистратор,
		|	НомерСтроки,
		|	СчетДтРазрез,
		|	СчетДтНУРазрез,
		|	СубконтоДт1Разрез,
		|	СубконтоДт2Разрез,
		|	СубконтоДтНУ1Разрез,
		|	СубконтоДтНУ2Разрез
		|АВТОУПОРЯДОЧИВАНИЕ";

	КонецЕсли;                   

	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
		
	
КонецФункции  // ПолучитьДанныеУчета

// Процедура регистрирует в таблице мТаблицаОшибок ошибку обработки данных учета, для
// последующего формирования сообщений пользователю о строке табличной части в 
// которой есть ошибка, причине возникновения ошибки и что делать для устранения ошибки
//
Процедура ЗарегистрироватьОшибкуОбработкиДанныхУчета(ДанныеУчета, ЭтоОсновныеНачисления, СтруктураПоискаОшибок, КодОшибки)
	
	//ошибку регистрируем, если для этого начисления еще не зарегистрирована ошибка
	СтруктураПоискаОшибок.Регистратор = ДанныеУчета.Регистратор;
	СтруктураПоискаОшибок.НомерСтроки = ДанныеУчета.НомерСтроки;
	СтруктураПоискаОшибок.КодОшибки   = КодОшибки;
	
	Если мТаблицаОшибок.НайтиСтроки(СтруктураПоискаОшибок).Количество() = 0 Тогда
		
		СтрокаТаблицыОшибок = мТаблицаОшибок.Добавить();
		СтрокаТаблицыОшибок.Сотрудник  = ДанныеУчета.Сотрудник;
		СтрокаТаблицыОшибок.ВидРасчета = ДанныеУчета.ВидРасчета;
		Если ЭтоОсновныеНачисления Тогда
			СтрокаТаблицыОшибок.ПериодДействияНачало = ДанныеУчета.ПериодДействияНачало;
			СтрокаТаблицыОшибок.ПериодДействияКонец  = ДанныеУчета.ПериодДействияКонец;
		КонецЕсли;
		СтрокаТаблицыОшибок.Сторно 		= ДанныеУчета.Сторно;
		СтрокаТаблицыОшибок.КодОшибки 	= КодОшибки;
		СтрокаТаблицыОшибок.Регистратор = ДанныеУчета.Регистратор;
		СтрокаТаблицыОшибок.НомерСтроки = ДанныеУчета.НомерСтроки;
		
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибкуОбработкиДанныхУчета()


// создает строку движений БУОсновныеНачисления или БУДополнительныеНачисления
// вызывается из ОбработатьДанныеУчета
//
// Параметры:
//	ДанныеУчета				- спозиционированная выборка по результату запроса
//	НаборЗаписей			- набор записей
//	ЭтоОсновныеНачисления	- признак того, что передан набор записей основных начсилений
//	Пустой счет				- пустая ссылка на счет
//
//vvv добавляем 5-й параметр ПараметрыПолученияСубконто
Функция СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, ЭтоОсновныеНачисления, ПустойСчет,ПараметрыПолученияСубконто = Неопределено)
	
	//vvv
	Если ПараметрыПолученияСубконто <> Неопределено Тогда
		
		ПараметрыПолученияСубконто[Тип("СправочникСсылка.СтатьиЗатрат")].ВидСтатьиЗатрат = ДанныеУчета.ВидРасчета;
		
	КонецЕсли;
	//
	
	СтрокаДанных = НаборЗаписей.Добавить();
	
	// вид расчета
	СтрокаДанных.ВидРасчета					= ДанныеУчета.ВидРасчета;
	
	// признак сторно
	СтрокаДанных.Сторно						= ДанныеУчета.Сторно;
	
	// измерения
	СтрокаДанных.Сотрудник					= ДанныеУчета.Сотрудник;
	СтрокаДанных.Физлицо					= ДанныеУчета.Физлицо;
	СтрокаДанных.Организация				= ДанныеУчета.ГоловнаяОрганизация;
	
	// ресурсы
	СтрокаДанных.Результат					= ДанныеУчета.Результат;

	// реквизиты
	Если ЭтоОсновныеНачисления Тогда
		// только для БУОсновныеНачисления
		
		// период действия
		СтрокаДанных.ПериодДействияНачало	= ДанныеУчета.ПериодДействияНачало;
		СтрокаДанных.ПериодДействияКонец	= ДанныеУчета.ПериодДействияКонец;
		
		СтрокаДанных.ГрафикРаботы			= ДанныеУчета.ГрафикРаботы;
		СтрокаДанных.ВидУчетаВремени		= ДанныеУчета.ВидУчетаВремени;
		
		// период регистрации
		СтрокаДанных.ПериодРегистрации			= ПериодРегистрации;
		//vvv
		СтрокаДанных.СчетДтНалогов			= ДанныеУчета.СчетДтНалогов;
		СтрокаДанных.СубконтоДтНалогов1		= ДанныеУчета.СубконтоДтНалогов1;
		СтрокаДанных.СубконтоДтНалогов2		= ДанныеУчета.СубконтоДтНалогов2;
		СтрокаДанных.СубконтоДтНалогов3		= ДанныеУчета.СубконтоДтНалогов3;	
		СтрокаДанных.СубконтоДтНалогов4		= ДанныеУчета.СубконтоДтНалогов4;
		//
	Иначе
		
		// период регистрации
		СтрокаДанных.ПериодРегистрации			= ДанныеУчета.ПериодРегистрации;
		//vvv
		СтрокаДанных.ПериодДействияДоп			= ДанныеУчета.ПериодДействияДоп;
		//
	КонецЕсли;
	
	СтрокаДанных.СчетДт			= ДанныеУчета.СчетДт;
	СтрокаДанных.СчетКт			= ДанныеУчета.СчетКт;
	//vvv
	//СтрокаДанных.СубконтоДт1	= ДанныеУчета.СубконтоДт1;
	//СтрокаДанных.СубконтоДт2	= ДанныеУчета.СубконтоДт2;
	//СтрокаДанных.СубконтоДт3	= ДанныеУчета.СубконтоДт3;
	СтрокаДанных.СубконтоДт1	= ПолучитьСубконто(ДанныеУчета.СубконтоДт1,ПараметрыПолученияСубконто);
	СтрокаДанных.СубконтоДт2	= ПолучитьСубконто(ДанныеУчета.СубконтоДт2,ПараметрыПолученияСубконто);
	СтрокаДанных.СубконтоДт3	= ПолучитьСубконто(ДанныеУчета.СубконтоДт3,ПараметрыПолученияСубконто);
	СтрокаДанных.СубконтоДт4	= ПолучитьСубконто(ДанныеУчета.СубконтоДт4,ПараметрыПолученияСубконто);
	//
	СтрокаДанных.СубконтоКт1	= ДанныеУчета.СубконтоКт1;
	СтрокаДанных.СубконтоКт2	= ДанныеУчета.СубконтоКт2;
	СтрокаДанных.СубконтоКт3	= ДанныеУчета.СубконтоКт3;
	//vvv
	СтрокаДанных.СубконтоКт4	= ДанныеУчета.СубконтоКт4;
	СтрокаДанных.СчетДтСотрудника	= ДанныеУчета.СчетДтСотрудника;
	СтрокаДанных.СубконтоДтСотрудника1	= ДанныеУчета.СубконтоДтСотрудника1;
	СтрокаДанных.СубконтоДтСотрудника2	= ДанныеУчета.СубконтоДтСотрудника2;
	СтрокаДанных.СубконтоДтСотрудника3	= ДанныеУчета.СубконтоДтСотрудника3;
	СтрокаДанных.СубконтоДтСотрудника4	= ДанныеУчета.СубконтоДтСотрудника4;
	СтрокаДанных.ОтчисленияОтносятсяНаЗатратыСотрудника	= ДанныеУчета.ОтчисленияОтносятсяНаЗатратыСотрудника;

	//
	СтрокаДанных.СчетДтНУ		= ДанныеУчета.СчетДтНУ;
	СтрокаДанных.СчетКтНУ		= ДанныеУчета.СчетКтНУ;
	СтрокаДанных.СубконтоДтНУ1	= ДанныеУчета.СубконтоДтНУ1;
	СтрокаДанных.СубконтоДтНУ2	= ДанныеУчета.СубконтоДтНУ2;
	СтрокаДанных.СубконтоДтНУ3	= ДанныеУчета.СубконтоДтНУ3;
	СтрокаДанных.СубконтоКтНУ1	= ?(ДанныеУчета.НомерСубконтоСт255НК = 1, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ1);
	СтрокаДанных.СубконтоКтНУ2	= ?(ДанныеУчета.НомерСубконтоСт255НК = 2, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ2);
	СтрокаДанных.СубконтоКтНУ3	= ?(ДанныеУчета.НомерСубконтоСт255НК = 3, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ3);
	//СтрокаДанных.СчетКтУСН		= ДанныеУчета.СчетКтУСН;
	//СтрокаДанных.ОтражениеВУСН	= ДанныеУчета.ОтражениеВУСН;
	
	СтрокаДанных.ОбособленноеПодразделение = Организация;
	СтрокаДанных.ДокументОснование = ДанныеУчета.Регистратор;

	АвтозаполнениеСубконто(ДанныеУчета, СтрокаДанных, ПустойСчет);
	
	Возврат СтрокаДанных;
КонецФункции // СоздатьСтрокуДвижений()

// Функция формирует набор записей по данным из запроса
// и в том случае, если проводится обработка первичных данных
// возвращает массив категорий непервичных начислений для 
// которых необходимо выполнить формирование данных учета
//
// Параметры:
//	РезультатДанныеУчета		- выборка по резултату запроса, возвращенная функцией 
//								  ПолучитьПервичныеДанныеУчета или ПолучитьВторичныеДанныеУчета
//	ОбработкаПервичныхДанных	- проводится ли обработка первичных данных (или вторичных)
//	Успешно						- в этот параметр возвращается значение Ложь, если обработка не выполнена
//								  (например, если не оказалось базовых данных)
//	НаборЗаписей - набор записей
//
// Возвращаемое значение:
//	массив категорий начислений
//
Функция ОбработатьДанныеУчета(РезультатДанныеУчета, Успешно, НаборЗаписей, ПараметрыПолученияСубконто = НеОпределено)

	// признак основных начислений
	ЭтоОсновныеНачисления = (ТипЗнч(НаборЗаписей) = Тип("РегистрРасчетаНаборЗаписей.БУОсновныеНачисления"));
	
	// пустая ссылка на счет - для проверок способов отражения в бухучете
	ПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	Счет70 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;

	// структура поиска для позиционирования в ДанныеНалоговогоУчетаВспомогательные
	// при необходимости суммирования "базовых" ресурсов
	СтруктураПоиска = Новый Структура("Регистратор,НомерСтроки");
	
	// структура поиска в таблице ошибок мТаблицаОшибок
	СтруктураПоискаОшибок = Новый Структура("Регистратор,НомерСтроки,КодОшибки");
	
	// основная выборка - по ней ведем обход и вводим записи движений
	ДанныеУчета = РезультатДанныеУчета.Выбрать();
	
	// вспомогательная выборка - по ней ведем суммирование базовых результатов
	ДанныеУчетаВспомогательные = РезультатДанныеУчета.Выбрать();

    ПродолжатьОбработку = ДанныеУчета.Следующий();
	Пока ПродолжатьОбработку Цикл
		
		//vvv добавляем 5-й параметр
		СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, ЭтоОсновныеНачисления, ПустойСчет, ПараметрыПолученияСубконто);
		
		Если ДанныеУчета.Сторно Тогда
			
			// необходимо обойти все данные относящиеся к одной строке основного регистра и 
			// выполнить распределение, нормируя на долю 
			
			// текущий ключ поиска 
			ТекущийРегистратор = ДанныеУчета.Регистратор;
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			// позиционируемся во вспомогательной выборке по запросу для суммирования "базовых" данных
			СтруктураПоиска.Регистратор = ТекущийРегистратор;
			СтруктураПоиска.НомерСтроки = ТекущийНомерСтроки;
			Если ДанныеУчетаВспомогательные.Регистратор <> ТекущийРегистратор ИЛИ 
				ДанныеУчетаВспомогательные.НомерСтроки <> ТекущийНомерСтроки Тогда
				// ищем следующую строку во спомогательной выборке если она не является искомой	
				ДанныеУчетаВспомогательные.НайтиСледующий(СтруктураПоиска);
			КонецЕсли;
			
			СуммаПоСтроке = 0;
			// суммируем базовые ресурсы по текущей строке набора записей
			Пока ДанныеУчетаВспомогательные.Регистратор = ТекущийРегистратор И ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
				Если ДанныеУчетаВспомогательные.РезультатСторно = NULL Тогда
					//для сторно-записи нет данных отражения в учете
					Успешно = Ложь;
					ЗарегистрироватьОшибкуОбработкиДанныхУчета(ДанныеУчетаВспомогательные, ЭтоОсновныеНачисления, СтруктураПоискаОшибок, 1);
				Иначе
					СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатСторно;
				КонецЕсли;
				Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
			СуммарнаяДоля = 0;
			// полный результат
			ПолныйРезультат = ДанныеУчета.Результат;
			// обходим строки и вычисляем долю результата по базовым записям
			ПерваяИзГруппыСтрок = Истина;
			Пока ДанныеУчета.Регистратор = ТекущийРегистратор И ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
				// если это не первая из группы "базовых" строк по одной строке основного регистра
				// то создаем очередную строку движений
				Если Не ПерваяИзГруппыСтрок Тогда
					СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, ЭтоОсновныеНачисления, ПустойСчет);
				Иначе
					ПерваяИзГруппыСтрок = Ложь;
				КонецЕсли;
				
				Если СуммаПоСтроке = 0 Тогда
					Доля = 0;
				Иначе
					Если ДанныеУчета.РезультатСторно = NULL Тогда
						Доля = 0;
					Иначе
						Доля = Окр(ПолныйРезультат * ДанныеУчета.РезультатСторно / СуммаПоСтроке,2);
					КонецЕсли;
				КонецЕсли;
				
				// единственное отличие от обработки данных распределяемых по базе - 
				// данные учета получаем не из полей запроса ...Разрез, а из "обычных" полей 
				СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДт;
				СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКт;
				СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1;
				СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2;
				СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3;
				
				СтрокаДанных.СчетДтНУ 	   = ДанныеУчета.СчетДтНУ;
				СтрокаДанных.СубконтоДтНУ1 = ДанныеУчета.СубконтоДтНУ1;
				СтрокаДанных.СубконтоДтНУ2 = ДанныеУчета.СубконтоДтНУ2;
				СтрокаДанных.СубконтоДтНУ3 = ДанныеУчета.СубконтоДтНУ3;
				СтрокаДанных.СчетКтНУ	   = ДанныеУчета.СчетКтНУ;
				СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1;
				СтрокаДанных.СубконтоКтНУ2 = ДанныеУчета.СубконтоКтНУ2;
				СтрокаДанных.СубконтоКтНУ3 = ДанныеУчета.СубконтоКтНУ3;
				
				//СтрокаДанных.ОтражениеВУСН = ДанныеУчета.ОтражениеВУСН;
				
				// автозаполним субконто
				АвтозаполнениеСубконто(ДанныеУчета, СтрокаДанных, ПустойСчет);
				
				СтрокаДанных.Результат = ?(ПолныйРезультат > 0,Мин(Доля,ПолныйРезультат - СуммарнаяДоля),Макс(Доля,ПолныйРезультат - СуммарнаяДоля));
									
				СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
				
				Если ЭтоОсновныеНачисления Тогда
					Если ДанныеУчета.ПериодДействияНачалоСторно <> NULL Тогда
						//vvv пока комментируем, непонятно для каких сторно-начислений нужно брать весь период, а не только период который сторнируется,
						//например, отпуск с 11.05.16 по 10.06.05. Больничный с 23.05. Сторно бралось в этом случае с 11, а не с 23. Это неправильно
						//СтрокаДанных.ПериодДействияНачало = ДанныеУчета.ПериодДействияНачалоСторно;	
						//СтрокаДанных.ПериодДействияКонец  = ДанныеУчета.ПериодДействияКонецСторно;
					КонецЕсли;	
				КонецЕсли;
				
				Если Не ДанныеУчета.Следующий() Тогда
					ПродолжатьОбработку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// ошибки округления складываются на последнюю запись из группы базовых записей
			СтрокаДанных.Результат = СтрокаДанных.Результат + ПолныйРезультат - СуммарнаяДоля;
		
			
		ИначеЕсли ЗначениеЗаполнено(ДанныеУчета.ДоляСпособаОтражения)  Тогда
			// необходимо обойти все данные относящиеся к одной строке основного регистра и 
			// выполнить распределение, нормируя на долю 
			
			// текущий ключ поиска 
			ТекущийРегистратор = ДанныеУчета.Регистратор;
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			// позиционируемся во вспомогательной выборке по запросу для суммирования "базовых" данных
			СтруктураПоиска.Регистратор = ТекущийРегистратор;
			СтруктураПоиска.НомерСтроки = ТекущийНомерСтроки;
			Если ДанныеУчетаВспомогательные.Регистратор <> ТекущийРегистратор ИЛИ 
				ДанныеУчетаВспомогательные.НомерСтроки <> ТекущийНомерСтроки Тогда
				// ищем следующую строку во спомогательной выборке если она не является искомой	
				ДанныеУчетаВспомогательные.НайтиСледующий(СтруктураПоиска);
			КонецЕсли;
			
			СуммаПоСтроке = 0;
			// суммируем базовые ресурсы по текущей строке набора записей
			Пока ДанныеУчетаВспомогательные.Регистратор = ТекущийРегистратор И ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
				Если Не ДанныеУчетаВспомогательные.РезультатБаза = NULL Тогда
					СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатБаза;
				КонецЕсли;
				Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
			СуммарнаяДоля = 0;
			// полный результат
			ПолныйРезультат = ДанныеУчета.Результат;
			// обходим строки и вычисляем долю результата по базовым записям
			ПерваяИзГруппыСтрок = Истина;
			Пока ДанныеУчета.Регистратор = ТекущийРегистратор И ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
				// если это не первая из группы "базовых" строк по одной строке основного регистра
				// то создаем очередную строку движений
				Если Не ПерваяИзГруппыСтрок Тогда
					СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, ЭтоОсновныеНачисления, ПустойСчет);
				Иначе
					ПерваяИзГруппыСтрок = Ложь;
				КонецЕсли;
				
				Если СуммаПоСтроке = 0 Тогда
					Доля = 0;
				Иначе
					Если ДанныеУчета.РезультатБаза = NULL Тогда
						Доля = 0;
					Иначе
						Доля = Окр(ПолныйРезультат * ДанныеУчета.РезультатБаза / СуммаПоСтроке,2);
					КонецЕсли;
				КонецЕсли;
				
				// единственное отличие от обработки данных распределяемых по базе - 
				// данные учета получаем не из полей запроса ...Разрез, а из "обычных" полей 
				СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДт;
				СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКт;
				СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1;
				СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2;
				СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3;
				
				СтрокаДанных.СчетДтНУ 	 = ДанныеУчета.СчетДтНУ;
				СтрокаДанных.СубконтоДтНУ1 = ДанныеУчета.СубконтоДтНУ1;
				СтрокаДанных.СубконтоДтНУ2 = ДанныеУчета.СубконтоДтНУ2;
				СтрокаДанных.СубконтоДтНУ3 = ДанныеУчета.СубконтоДтНУ3;
				СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУ;
				СтрокаДанных.СубконтоКтНУ1 = ?(ДанныеУчета.НомерСубконтоСт255НК = 1, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ1);
				СтрокаДанных.СубконтоКтНУ2 = ?(ДанныеУчета.НомерСубконтоСт255НК = 2, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ2);
				СтрокаДанных.СубконтоКтНУ3 = ?(ДанныеУчета.НомерСубконтоСт255НК = 3, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ3);
								
				// автозаполним субконто
				АвтозаполнениеСубконто(ДанныеУчета, СтрокаДанных, ПустойСчет);
				
				СтрокаДанных.Результат = ?(ПолныйРезультат > 0,Мин(Доля,ПолныйРезультат - СуммарнаяДоля),Макс(Доля,ПолныйРезультат - СуммарнаяДоля));
				
				СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
				Если Не ДанныеУчета.Следующий() Тогда
					ПродолжатьОбработку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// ошибки округления складываются на последнюю запись из группы базовых записей
			СтрокаДанных.Результат = СтрокаДанных.Результат + ПолныйРезультат - СуммарнаяДоля;
		
			
		ИначеЕсли ДанныеУчета.СтратегияОтраженияВУчете <> Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления Тогда
			
				//СтрокаДанных.СубконтоДт1 	= ?(ДанныеУчета.НомерСубконтоСтатьиЗатратДт = 1, ?(ЗначениеЗаполнено(ДанныеУчета.СтатьяЗатратНеЕНВД),ДанныеУчета.СтатьяЗатратНеЕНВД,СтрокаДанных.СубконтоДт1), СтрокаДанных.СубконтоДт1);
				//СтрокаДанных.СубконтоДт2 	= ?(ДанныеУчета.НомерСубконтоСтатьиЗатратДт = 2, ?(ЗначениеЗаполнено(ДанныеУчета.СтатьяЗатратНеЕНВД),ДанныеУчета.СтатьяЗатратНеЕНВД,СтрокаДанных.СубконтоДт2), СтрокаДанных.СубконтоДт2);
				//СтрокаДанных.СубконтоДт3 	= ?(ДанныеУчета.НомерСубконтоСтатьиЗатратДт = 3, ?(ЗначениеЗаполнено(ДанныеУчета.СтатьяЗатратНеЕНВД),ДанныеУчета.СтатьяЗатратНеЕНВД,СтрокаДанных.СубконтоДт3), СтрокаДанных.СубконтоДт3);
				//СтрокаДанных.СубконтоДтНУ1 	= ?(ДанныеУчета.НомерСубконтоСтатьиЗатратДтНУ = 1, ?(ЗначениеЗаполнено(ДанныеУчета.СтатьяЗатратНеЕНВД),ДанныеУчета.СтатьяЗатратНеЕНВД,СтрокаДанных.СубконтоДтНУ1), СтрокаДанных.СубконтоДтНУ1);
				//СтрокаДанных.СубконтоДтНУ2 	= ?(ДанныеУчета.НомерСубконтоСтатьиЗатратДтНУ = 2, ?(ЗначениеЗаполнено(ДанныеУчета.СтатьяЗатратНеЕНВД),ДанныеУчета.СтатьяЗатратНеЕНВД,СтрокаДанных.СубконтоДтНУ2), СтрокаДанных.СубконтоДтНУ2);
				//СтрокаДанных.СубконтоДтНУ3 	= ?(ДанныеУчета.НомерСубконтоСтатьиЗатратДтНУ = 3, ?(ЗначениеЗаполнено(ДанныеУчета.СтатьяЗатратНеЕНВД),ДанныеУчета.СтатьяЗатратНеЕНВД,СтрокаДанных.СубконтоДтНУ3), СтрокаДанных.СубконтоДтНУ3);
				//
				
			СтрокаДанных.Результат = ДанныеУчета.Результат;
								
			Если Не ДанныеУчета.Следующий() Тогда
				ПродолжатьОбработку = Ложь;
			КонецЕсли;
			
		ИначеЕсли ДанныеУчета.СтратегияОтраженияВУчете = Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления Тогда
			// вычисляем результат нормируя его на базу для строк базы относящихся 
			// к одной строке основного регистра
			
			// текущий ключ поиска 
			ТекущийРегистратор = ДанныеУчета.Регистратор;
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			// позиционируемся во вспомогательной выборке по запросу для суммирования "базовых" данных
			СтруктураПоиска.Регистратор = ТекущийРегистратор;
			СтруктураПоиска.НомерСтроки = ТекущийНомерСтроки;
			Если 	ДанныеУчетаВспомогательные.Регистратор <> ТекущийРегистратор ИЛИ 
				ДанныеУчетаВспомогательные.НомерСтроки <> ТекущийНомерСтроки Тогда
				// ищем следующую строку во спомогательной выборке если она не является искомой	
				ДанныеУчетаВспомогательные.НайтиСледующий(СтруктураПоиска);
			КонецЕсли;
			
			СуммаПоСтроке = 0;
			// суммируем базовые ресурсы по текущей строке набора записей
			Пока ДанныеУчетаВспомогательные.Регистратор = ТекущийРегистратор И ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
				Если ДанныеУчетаВспомогательные.РезультатБаза = NULL Тогда
					Успешно = Ложь;
					ЗарегистрироватьОшибкуОбработкиДанныхУчета(ДанныеУчета, ЭтоОсновныеНачисления, СтруктураПоискаОшибок, 5);
				Иначе
					СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатБаза;
				КонецЕсли;
				Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
			СуммарнаяДоля = 0;
			// полный результат
			ПолныйРезультат = ДанныеУчета.Результат;
			// обходим строки и вычисляем долю результата по базовым записям
			ПерваяИзГруппыСтрок = Истина;
			Пока ДанныеУчета.Регистратор = ТекущийРегистратор И ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
				// если это не первая из группы "базовых" строк по одной строке основного регистра
				// то создаем очередную строку движений
				Если Не ПерваяИзГруппыСтрок Тогда
					СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, ЭтоОсновныеНачисления, ПустойСчет);
				Иначе
					ПерваяИзГруппыСтрок = Ложь;
				КонецЕсли;
				
				Если СуммаПоСтроке = 0 Тогда
					Доля = 0;
				Иначе
					Если ДанныеУчета.РезультатБаза = NULL Тогда
						Доля = 0;
					Иначе
						Доля = Окр(ПолныйРезультат * ДанныеУчета.РезультатБаза / СуммаПоСтроке,2);
					КонецЕсли;
				КонецЕсли;
				
				// если счет пустой - заполним счет данными базы
				Если ДанныеУчета.СчетДт = ПустойСчет Тогда
					Если Не ДанныеУчета.СчетДтРазрез = NULL Тогда
						СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
						СтрокаДанных.СубконтоДт1 = ДанныеУчета.СубконтоДт1Разрез;
						СтрокаДанных.СубконтоДт2 = ДанныеУчета.СубконтоДт2Разрез;
						СтрокаДанных.СубконтоДт3 = ДанныеУчета.СубконтоДт3Разрез;
						//vvv
						СтрокаДанных.СубконтоДт4 = ДанныеУчета.СубконтоДт4Разрез;
						//
						//ЗаполнитьПодразделениеДтКт(СтрокаДанных, СтрокаДанных.СчетДт, ПустойСчет, ДанныеУчета.ПодразделениеОрганизации, ПустойСчет);
						СтрокаДанных.СчетДтНУ 	 = ДанныеУчета.СчетДтНУРазрез;
						СтрокаДанных.СубконтоДтНУ1 = ДанныеУчета.СубконтоДтНУ1Разрез;
						СтрокаДанных.СубконтоДтНУ2 = ДанныеУчета.СубконтоДтНУ2Разрез;
						СтрокаДанных.СубконтоДтНУ3 = ДанныеУчета.СубконтоДтНУ3Разрез;
					КонецЕсли;
				КонецЕсли;
				// если счет пустой - заполним счет данными базы
				Если ДанныеУчета.СчетКт = ПустойСчет Тогда
					Если Не ДанныеУчета.СчетКтРазрез = NULL Тогда
						СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
						СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
						СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
						//ЗаполнитьПодразделениеДтКт(СтрокаДанных, ПустойСчет, СтрокаДанных.СчетКт, ДанныеУчета.ПодразделениеОрганизации, ПустойСчет);
						СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
						СтрокаДанных.СубконтоКтНУ1 = ?(ДанныеУчета.НомерСубконтоСт255НКБазы = 1, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ1Разрез);
						СтрокаДанных.СубконтоКтНУ2 = ?(ДанныеУчета.НомерСубконтоСт255НКБазы = 2, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ2Разрез);
						СтрокаДанных.СубконтоКтНУ3 = ?(ДанныеУчета.НомерСубконтоСт255НКБазы = 3, ДанныеУчета.ВидНачисленияПоСт255НК, ДанныеУчета.СубконтоКтНУ3Разрез);
						//ЗаполнитьВидНачисленияПоСт255НК(СтрокаДанных, СтрокаДанных.СчетКт, Счет70, ДанныеУчета.ВидНачисленияПоСт255НК);
						//СтрокаДанных.ОтражениеВУСН	 = ДанныеУчета.ОтражениеВУСНРазрез;		
					КонецЕсли;
				КонецЕсли;
				
				СтрокаДанных.Результат = ?(ПолныйРезультат > 0,Мин(Доля,ПолныйРезультат - СуммарнаяДоля),Макс(Доля,ПолныйРезультат - СуммарнаяДоля));
				СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
				Если Не ДанныеУчета.Следующий() Тогда
					ПродолжатьОбработку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// ошибки округления складываются на последнюю запись из группы базовых записей
			СтрокаДанных.Результат = СтрокаДанных.Результат + ПолныйРезультат - СуммарнаяДоля;
			
		Иначе
			Если Не ДанныеУчета.Следующий() Тогда
				ПродолжатьОбработку = Ложь;
			КонецЕсли;
		КонецЕсли;
    			
	КонецЦикла;

	// при записи данных учета не затираем уже введенные движения
	НаборЗаписей.Записать(Ложь);

КонецФункции	
	
// создает строку промежуточной таблицы, которпая впоследствии будет выгружена в табличную часть
// Параметры:
//	ДанныеУчета - спозиционированная выборка по результату запроса
//
Функция СоздатьСтрокуПромежуточнойТаблицы(ДанныеУчета, ПромежуточнаяТаблица, ПустойСчет)

	СтрокаДанных = ПромежуточнаяТаблица.Добавить();
	//vvv
	СтрокаДанных.ФизЛицо		= ДанныеУчета.ФизЛицо;
	//
	СтрокаДанных.СчетДт			= ДанныеУчета.СчетДт;
	СтрокаДанных.СчетКт			= ДанныеУчета.СчетКт;
	СтрокаДанных.СубконтоДт1	= ДанныеУчета.СубконтоДт1;
	СтрокаДанных.СубконтоДт2	= ДанныеУчета.СубконтоДт2;
	СтрокаДанных.СубконтоДт3	= ДанныеУчета.СубконтоДт3;
	//vvv
	СтрокаДанных.СубконтоДт4	= ДанныеУчета.СубконтоДт4;
	//
	СтрокаДанных.СубконтоКт1	= ДанныеУчета.СубконтоКт1;
	СтрокаДанных.СубконтоКт2	= ДанныеУчета.СубконтоКт2;
	СтрокаДанных.СубконтоКт3	= ДанныеУчета.СубконтоКт3;
	//vvv
	СтрокаДанных.СубконтоКт4	= ДанныеУчета.СубконтоКт4;
	//
	СтрокаДанных.СчетДтНУ		= ДанныеУчета.СчетДтНУ;
	СтрокаДанных.СчетКтНУ		= ДанныеУчета.СчетКтНУ;
	СтрокаДанных.СубконтоДтНУ1	= ДанныеУчета.СубконтоДтНУ1;
	СтрокаДанных.СубконтоДтНУ2	= ДанныеУчета.СубконтоДтНУ2;
	СтрокаДанных.СубконтоДтНУ3	= ДанныеУчета.СубконтоДтНУ3;
	СтрокаДанных.СубконтоКтНУ1	= ДанныеУчета.СубконтоКтНУ1;
	СтрокаДанных.СубконтоКтНУ2	= ДанныеУчета.СубконтоКтНУ2;
	СтрокаДанных.СубконтоКтНУ3	= ДанныеУчета.СубконтоКтНУ3;	
	//СтрокаДанных.СчетКтУСН		= ДанныеУчета.СчетКтУСН;
	//СтрокаДанных.ОтражениеВУСН	= ДанныеУчета.ОтражениеВУСН;	
	СтрокаДанных.Сумма			= ДанныеУчета.Результат;
	
	// выполним автозаполнение субконто если это предусмотрено способом отражения в бухучете
	Если ДанныеУчета.СчетДт <> ПустойСчет Тогда
		Если ДанныеУчета.НомерСубконтоРаботникиДт <> 0 Тогда
			Субконто = ДанныеУчета[НомерДт + ДанныеУчета.НомерСубконтоРаботникиДт];
			Если НЕ ЗначениеЗаполнено(Субконто) Тогда
				СтрокаДанных["СубконтоДт" + ДанныеУчета.НомерСубконтоРаботникиДт] = ДанныеУчета.Физлицо;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ДанныеУчета.СчетКт <> ПустойСчет Тогда
		Если ДанныеУчета.НомерСубконтоРаботникиКт <> 0 Тогда
			Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоРаботникиКт];
			Если НЕ ЗначениеЗаполнено(Субконто) Тогда
				СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоРаботникиКт] = ДанныеУчета.Физлицо;
			КонецЕсли;
		КонецЕсли;
		Если ДанныеУчета.НомерСубконтоКонтрагентыКт <> 0 Тогда
			Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоКонтрагентыКт];
			Если НЕ ЗначениеЗаполнено(Субконто) Тогда
				СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоКонтрагентыКт] = ДанныеУчета.Контрагент;
			КонецЕсли;
		КонецЕсли;
		Если ДанныеУчета.НомерСубконтоИсполнДокументыКт <> 0 Тогда
			Субконто = ДанныеУчета[НомерКт + ДанныеУчета.НомерСубконтоИсполнДокументыКт];
			Если НЕ ЗначениеЗаполнено(Субконто) Тогда
				СтрокаДанных["СубконтоКт" + ДанныеУчета.НомерСубконтоИсполнДокументыКт] = ДанныеУчета.ИсполнительныйДокумент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СтрокаДанных;

КонецФункции // СоздатьСтрокуПромежуточнойТаблицы

// проверяет должен ли быть указан или нет счет учета по НУ
//
// Параметры
//  СчетДт,СчетКт - счета хозрасчетного плана счетов
//  СчетДтНУ	  - счет налогового плана счетов - будущий счет дебета
//
// Возвращаемое значение:
//   булево   – если сочетание корректно, то истина
//
Функция КорректноеСочетаниеСчетовНУ(СчетДт,НаименованиеСчетДт, СчетКт, СчетДтНУ, СчетКтНУ, ПризнакСтатьиЗатрат,Сообщение)
	
	Сообщение = "";
	
	Если СчетДтНУ.Пустая() Тогда
		Если (СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда или СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов)
			и Не (ПризнакСтатьиЗатрат = Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД) Тогда
			Сообщение = "Не указан счет налогового учета!";
		КонецЕсли;
		Если НЕ СчетКтНУ.Пустая() Тогда
			Сообщение = Сообщение + ?(Сообщение = "","",Символы.ПС) + "Указан счет кредита налогового учета, но не указан счет дебета налогового учета!";
		КонецЕсли;
	Иначе
		Если (СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда или СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов) Тогда
			Сообщение = "Проводки в дебет "+НаименованиеСчетДт +" не должны отражаться в налоговом учете!";
		ИначеЕсли ПризнакСтатьиЗатрат = Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД Тогда
			Сообщение = "Проводки по видам деятельности, облагаемым ЕНВД не должны отражаться в налоговом учете!";
		КонецЕсли;
		
		Если СчетКтНУ.Пустая() Тогда
			Сообщение = Сообщение + ?(Сообщение = "","",Символы.ПС) + "Указан счет дебета налогового учета, но не указан счет кредита налогового учета!";
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ПустаяСтрока(Сообщение)
	
КонецФункции // КорректноеСочетаниеСчетовНУ()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоДоходам()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	""Основные"" КАК ТипСтроки,
	|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Основные.НомерСтроки,
	|	Основные.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Основные.ВидРасчета,
	|	ВЫБОР
	|		КОГДА Основные.ВидРасчета.ВидНачисленияПоСт255НК = &ПустойВидНачисленияПоСт255НК
	|				И Основные.ВидРасчета.СпособРасчета <> &СпособРасчетаПоСреднемуЗаработкуФСС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеОтражаетсяВНУ,
	|	Основные.Сотрудник,
	|	Основные.Сотрудник.Физлицо КАК ФизЛицо,
	|	Основные.СчетДт,
	|	Основные.СчетДт.Наименование КАК НаименованиеСчетДт,
	|	Основные.СчетКт,
	|	Основные.СубконтоДт1,
	|	Основные.СубконтоДт2,
	|	Основные.СубконтоДт3,
	//vvv
	|	Основные.СубконтоДт4,
	//
	|	Основные.СубконтоКт1,
	|	Основные.СубконтоКт2,
	|	Основные.СубконтоКт3,
	//vvv
	|	Основные.СубконтоКт4,
	|	Основные.СчетДтНалогов,
	|	Основные.СубконтоДтНалогов1,
	|	Основные.СубконтоДтНалогов2,
	|	Основные.СубконтоДтНалогов3,
	|	Основные.СубконтоДтНалогов4,
	|	Основные.СчетДтСотрудника,
	|	Основные.СубконтоДтСотрудника1,
	|	Основные.СубконтоДтСотрудника2,
	|	Основные.СубконтоДтСотрудника3,
	|	Основные.СубконтоДтСотрудника4,
	|	Основные.ОтчисленияОтносятсяНаЗатратыСотрудника,
	|	NULL КАК ПериодДействияДоп,
	//
	|	Основные.СчетДтНУ,
	|	Основные.СчетКтНУ,
	|	Основные.СубконтоДтНУ1,
	|	Основные.СубконтоДтНУ2,
	|	Основные.СубконтоДтНУ3,
	|	Основные.СубконтоКтНУ1,
	|	Основные.СубконтоКтНУ2,
	|	Основные.СубконтоКтНУ3,
	|	Основные.Результат,
	|	Основные.ПериодДействияНачало,
	|	Основные.ПериодДействияКонец,
	|	ВЫБОР
	|		КОГДА РаботникиСрез.ПериодЗавершения <= Основные.ПериодДействияНачало
	|				И РаботникиСрез.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиСрез.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиСрез.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РаботникиСрез.ПериодЗавершения <= Основные.ПериодДействияНачало
	|					И РаботникиСрез.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиСрез.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|			ИНАЧЕ РаботникиСрез.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|		КОНЕЦ, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	ВЫБОР
	|		КОГДА Основные.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	Основные.ДокументОснование,
	|	Основные.Сторно,
	|	NULL КАК ДатаНачисления
	|ИЗ
	|	Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК Основные
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиСрез.Сотрудник КАК Сотрудник,
	|			Работники.ГрафикРаботы КАК ГрафикРаботы,
	|			Работники.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
	|			Работники.ПериодЗавершения КАК ПериодЗавершения
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Работники.Период) КАК ПериодСреза,
	|				Основные.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК Основные
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|					ПО (Работники.Период <= Основные.ПериодДействияНачало)
	|						И Основные.Сотрудник = Работники.Сотрудник
	|			ГДЕ
	|				Основные.Ссылка = &парамРегистратор
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Основные.Сотрудник) КАК РаботникиСрез
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|				ПО РаботникиСрез.ПериодСреза = Работники.Период
	|					И РаботникиСрез.Сотрудник = Работники.Сотрудник) КАК РаботникиСрез
	|		ПО Основные.Сотрудник = РаботникиСрез.Сотрудник
	|ГДЕ
	|	Основные.Ссылка = &парамРегистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Дополнительные"",
	|	&ГоловнаяОрганизация,
	|	Дополнительные.НомерСтроки,
	|	Дополнительные.ВидРасчета.СпособРасчета,
	|	Дополнительные.ВидРасчета,
	|	ВЫБОР
	|		КОГДА Дополнительные.ВидРасчета.ВидНачисленияПоСт255НК = &ПустойВидНачисленияПоСт255НК
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Дополнительные.Сотрудник,
	|	Дополнительные.Сотрудник.Физлицо,
	|	Дополнительные.СчетДт,
	|	Дополнительные.СчетДт.Наименование,
	|	Дополнительные.СчетКт,
	|	Дополнительные.СубконтоДт1,
	|	Дополнительные.СубконтоДт2,
	|	Дополнительные.СубконтоДт3,
	//vvv
	|	Дополнительные.СубконтоДт4,
	//
	|	Дополнительные.СубконтоКт1,
	|	Дополнительные.СубконтоКт2,
	|	Дополнительные.СубконтоКт3,
	//vvv
	|	Дополнительные.СубконтоКт4,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	Дополнительные.СчетДтСотрудника,
	|	Дополнительные.СубконтоДтСотрудника1,
	|	Дополнительные.СубконтоДтСотрудника2,
	|	Дополнительные.СубконтоДтСотрудника3,
	|	Дополнительные.СубконтоДтСотрудника4,
	|	Дополнительные.ОтчисленияОтносятсяНаЗатратыСотрудника,
	|	Дополнительные.ПериодДействияДоп,
	//
	|	Дополнительные.СчетДтНУ,
	|	Дополнительные.СчетКтНУ,
	|	Дополнительные.СубконтоДтНУ1,
	|	Дополнительные.СубконтоДтНУ2,
	|	Дополнительные.СубконтоДтНУ3,
	|	Дополнительные.СубконтоКтНУ1,
	|	Дополнительные.СубконтоКтНУ2,
	|	Дополнительные.СубконтоКтНУ3,
	|	Дополнительные.Результат,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА Дополнительные.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	Дополнительные.ДокументОснование,
	|	Дополнительные.Сторно,
	|	Дополнительные.ДатаНачисления
	|ИЗ
	|	Документ.ОтражениеЗарплатыВРеглУчете.ДополнительныеНачисления КАК Дополнительные
	|ГДЕ
	|	Дополнительные.Ссылка = &парамРегистратор");
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ПустойВидНачисленияПоСт255НК", Перечисления.ВидыНачисленийОплатыТрудаПоСт255НК.ПустаяСсылка());
	Запрос.УстановитьПараметр("СпособРасчетаПоСреднемуЗаработкуФСС", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция СформироватьЗапросПоОтражениюВУчете()

	// готовим список счетов
	СчетаИсключения = Новый Массив();
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыль);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ОперационныеДоходыИРасходы);
	
	ТекстСчетаИсключения = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаИсключения)";
	
	Запрос = Новый Запрос(ТекстСчетаИсключения);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	СчетаИсключения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.НомерСтроки КАК НомерСтроки,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт В (&СчетаИсключения)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтражаетсяНУ,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт.Наименование КАК НаименованиеСчетДт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СтатьяЗатрат.ОтнесениеРасходовКДеятельностиЕНВД КАК СтатьяЗатратЕНВД,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДтНУ,
	|	ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКтНУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.НомерСтроки КАК НомерСтроки,
	|		ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДт КАК СчетДт,
	|		ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКт КАК СчетКт,
	|		ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетДтНУ КАК СчетДтНУ,
	|		ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СчетКтНУ КАК СчетКтНУ,
	|		ВЫБОР
	|			КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт1
	|			КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт2
	|			КОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат
	|				ТОГДА ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.СубконтоДт3
	|			ИНАЧЕ &ПустаяСтатьяЗатрат
	|		КОНЕЦ КАК СтатьяЗатрат
	|	ИЗ
	|		Документ.ОтражениеЗарплатыВРеглУчете.ОтражениеВУчете КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
	|	ГДЕ
	|		ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Ссылка = &парамРегистратор
	|		И ОтражениеЗарплатыВРеглУчетеОтражениеВУчете.Сумма <> 0) КАК ОтражениеЗарплатыВРеглУчетеОтражениеВУчете
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");

	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ПустаяСсылка());

	Возврат Запрос.Выполнить();

КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задана организация!", Отказ, Заголовок);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задан период за который выполняется отражение начислений в бухгалтерском учете!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоДоходам, Отказ, ПроверятьСочетание, Заголовок = "")

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоДоходам.НомерСтроки) + """ табл. части ""Проводки"": ";
	
	Если ВыборкаПоДоходам.СчетДт.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан счет дебета!", Отказ, Заголовок);
		ПроверятьСочетание = Ложь;
	КонецЕсли;

	Если ВыборкаПоДоходам.СчетКт.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан счет кредита!", Отказ, Заголовок);
		ПроверятьСочетание = Ложь;
	КонецЕсли;
	
	//vvv комментируем налоговый учет
	//Сообщение = "";
	//Если ПроверятьСочетание И ВыборкаПоДоходам.ОтражаетсяНУ И Не КорректноеСочетаниеСчетовНУ(ВыборкаПоДоходам.СчетДт,ВыборкаПоДоходам.НаименованиеСчетДт,ВыборкаПоДоходам.СчетКт,ВыборкаПоДоходам.СчетДтНУ, ВыборкаПоДоходам.СчетКтНУ, ВыборкаПоДоходам.СтатьяЗатратЕНВД, Сообщение) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Сообщение, Отказ, Заголовок);
	//КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ, ПроверятьСочетание, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоДоходам.НомерСтроки) +
	""" табл. части "+ВыборкаПоДоходам.ТипСтроки+": ";

	Если ВыборкаПоДоходам.ВидРасчета.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.Сотрудник.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.СчетДт.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан счет дебета!", Отказ, Заголовок);
		ПроверятьСочетание = Ложь;
	КонецЕсли;
	
	Если ВыборкаПоДоходам.СчетКт.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан счет кредита!", Отказ, Заголовок);
		ПроверятьСочетание = Ложь;
	КонецЕсли;
	
	Сообщение = "";
	//Если ПроверятьСочетание  И Не КорректноеСочетаниеСчетовНУ(ВыборкаПоДоходам.СчетДт,ВыборкаПоДоходам.НаименованиеСчетДт,ВыборкаПоДоходам.СчетКт,ВыборкаПоДоходам.СчетДтНУ, ВыборкаПоДоходам.СчетКтНУ, Сообщение) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Сообщение, Отказ, Заголовок);
	//КонецЕсли;
	
	Если ВыборкаПоДоходам.ТипСтроки = "Основные" Тогда
		
		Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияНачало) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала!", Отказ, Заголовок);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияКонец) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания!", Отказ, Заголовок);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияКонец) и ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияНачало) Тогда
			Если ВыборкаПоДоходам.ПериодДействияКонец < ВыборкаПоДоходам.ПериодДействияНачало Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания не должна быть меньше даты начала!", Отказ, Заголовок);
			ИначеЕсли НачалоМесяца(ВыборкаПоДоходам.ПериодДействияКонец) <> НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "даты начала и окончания должны принадлежать одному месяцу!", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоДоходам.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет движение в наборы записей БУОсновныеНачисления и БУДополнительныеНачисления
// Параметры:
//	ВыборкаПоДоходам - спозиционированнная выборка по данным документа
//	НаборЗаписейОсновные - набор записей типа БУОсновныеНачисления
//	НаборЗаписейДополнительные - набор записей типа БУДополнительныеНачисления
//
Процедура ДобавитьСтрокуВДвиженияПоДоходам(ВыборкаПоДоходам, НаборЗаписейОсновные, НаборЗаписейДополнительные)
	
	Если ВыборкаПоДоходам.ТипСтроки = "Основные" Тогда
		// ОсновныеНачисленияРаботниковОрганизации
		Строка = НаборЗаписейОсновные.Добавить();
		
		// свойства
		Строка.ПериодДействияНачало = ВыборкаПоДоходам.ПериодДействияНачало;
		Строка.ПериодДействияКонец  = КонецДня(ВыборкаПоДоходам.ПериодДействияКонец);
		
		// реквизиты
		Строка.ГрафикРаботы = ВыборкаПоДоходам.ГрафикРаботы;
		Строка.ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоДоходам.СпособРасчета,ВыборкаПоДоходам.ВидРасчета.ВидВремени,ВыборкаПоДоходам.СуммированныйУчетРабочегоВремени,ВыборкаПоДоходам.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени,ВыборкаПоДоходам.ВидРасчета.Показатели);
		//vvv
		Строка.СчетДтНалогов = ВыборкаПоДоходам.СчетДтНалогов;
		Строка.СубконтоДтНалогов1 = ВыборкаПоДоходам.СубконтоДтНалогов1;
		Строка.СубконтоДтНалогов2 = ВыборкаПоДоходам.СубконтоДтНалогов2;
		Строка.СубконтоДтНалогов3 = ВыборкаПоДоходам.СубконтоДтНалогов3;		
		Строка.СубконтоДтНалогов4 = ВыборкаПоДоходам.СубконтоДтНалогов4;
		//
	Иначе
		
		Строка = НаборЗаписейДополнительные.Добавить();
		//vvv
		Строка.ПериодДействияДоп = ВыборкаПоДоходам.ПериодДействияДоп;
		//
		
	КонецЕсли;
	
	// свойства
	Строка.ВидРасчета			= ВыборкаПоДоходам.ВидРасчета;
	Строка.ПериодРегистрации	= ПериодРегистрации;
	Строка.Сторно				= ВыборкаПоДоходам.Сторно;

	
	// Измерения
	Строка.Сотрудник			= ВыборкаПоДоходам.Сотрудник;
	Строка.Физлицо				= ВыборкаПоДоходам.Физлицо;
	Строка.Организация			= ВыборкаПоДоходам.ГоловнаяОрганизация;
	
	// ресурсы
	Строка.Результат			= ВыборкаПоДоходам.Результат;
	
	// реквизиты
	Строка.СчетДт = ВыборкаПоДоходам.СчетДт;
	Строка.СчетКт = ВыборкаПоДоходам.СчетКт;
	Строка.СубконтоДт1 = ВыборкаПоДоходам.СубконтоДт1;
	Строка.СубконтоДт2 = ВыборкаПоДоходам.СубконтоДт2;
	Строка.СубконтоДт3 = ВыборкаПоДоходам.СубконтоДт3;
	//vvv
	Строка.СубконтоДт4 = ВыборкаПоДоходам.СубконтоДт4;
	//
	Строка.СубконтоКт1 = ВыборкаПоДоходам.СубконтоКт1;
	Строка.СубконтоКт2 = ВыборкаПоДоходам.СубконтоКт2;
	Строка.СубконтоКт3 = ВыборкаПоДоходам.СубконтоКт3;
	//vvv
	Строка.СубконтоКт4 = ВыборкаПоДоходам.СубконтоКт4;
	Строка.СчетДтСотрудника = ВыборкаПоДоходам.СчетДтСотрудника;
	Строка.СубконтоДтСотрудника1 = ВыборкаПоДоходам.СубконтоДтСотрудника1;
	Строка.СубконтоДтСотрудника2 = ВыборкаПоДоходам.СубконтоДтСотрудника2;
	Строка.СубконтоДтСотрудника3 = ВыборкаПоДоходам.СубконтоДтСотрудника3;
	Строка.СубконтоДтСотрудника4 = ВыборкаПоДоходам.СубконтоДтСотрудника4;
	Строка.СубконтоДтСотрудника4 = ВыборкаПоДоходам.СубконтоДтСотрудника4;
	Строка.ОтчисленияОтносятсяНаЗатратыСотрудника = ВыборкаПоДоходам.ОтчисленияОтносятсяНаЗатратыСотрудника;
	//
	Строка.СчетДтНУ = ВыборкаПоДоходам.СчетДтНУ;
	Строка.СчетКтНУ = ВыборкаПоДоходам.СчетКтНУ;
	Строка.СубконтоДтНУ1 = ВыборкаПоДоходам.СубконтоДтНУ1;
	Строка.СубконтоДтНУ2 = ВыборкаПоДоходам.СубконтоДтНУ2;
	Строка.СубконтоДтНУ3 = ВыборкаПоДоходам.СубконтоДтНУ3;
	Строка.СубконтоКтНУ1 = ВыборкаПоДоходам.СубконтоКтНУ1;
	Строка.СубконтоКтНУ2 = ВыборкаПоДоходам.СубконтоКтНУ2;
	Строка.СубконтоКтНУ3 = ВыборкаПоДоходам.СубконтоКтНУ3;
	//Строка.СчетКтУСН = ВыборкаПоДоходам.СчетКтУСН;
	//Строка.ОтражениеВУСН = ВыборкаПоДоходам.ОтражениеВУСН;
	
	Строка.ОбособленноеПодразделение = Организация;
	Строка.ДокументОснование = ВыборкаПоДоходам.ДокументОснование;

	
КонецПроцедуры  // ДобавитьСтрокуВДвиженияПоДоходам

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого Набор Из Движения Цикл
		Набор.Очистить();
	КонецЦикла;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	ПроверитьЗаполнениеШапки(Отказ, Заголовок);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// определим налоговый режим
	БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету"), КонецМесяца(ПериодРегистрации), Организация);
	УчетнаяПолитика = глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету")[КонецМесяца(ПериодРегистрации)][Организация];
	
	ВыборкаПоДоходам = СформироватьЗапросПоДоходам().Выбрать();
	
	Пока ВыборкаПоДоходам.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ, Не УчетнаяПолитика.УСН, Заголовок);
		Если Не Отказ Тогда
			ДобавитьСтрокуВДвиженияПоДоходам(ВыборкаПоДоходам, Движения.БУОсновныеНачисления, Движения.БУДополнительныеНачисления);
		КонецЕсли;
	КонецЦикла;

	ВыборкаПоОтражениюВУчете = СформироватьЗапросПоОтражениюВУчете().Выбрать();
	ВалютаРеглУчета  = Константы.ВалютаРегламентированногоУчета.Получить();

	Пока ВыборкаПоОтражениюВУчете.Следующий() Цикл

		ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоОтражениюВУчете, Отказ,  Не УчетнаяПолитика.УСН);

	КонецЦикла;
	
КонецПроцедуры // ОбработкаПроведения

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОсновныеНачисления, ДополнительныеНачисления);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого Набор Из Движения Цикл
		Набор.Очистить();
		Набор.Записать();
	КонецЦикла
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

НомерДт = 4;
НомерКт = 7;
//vvv
//добавили 4-е субконто
НомерКт = 8;
//
мНомерСубконтоКонтрагентыКт = 1;
мНомерСубконтоИсполнДокументыКт = 0;
мДлинаСуток = 86400;		// в секундах

