

&НаКлиенте
Процедура ПодборДолжностей(Команда)
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.ДолжностиОрганизаций.ФормаВыбора", СтруктураПараметры, Элементы.КонтролируемыеДолжности);
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеДолжностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ДолжностиОрганизаций") Тогда
		СтандартнаяОбработка = Ложь;
		Если Объект.КонтролируемыеДолжности.НайтиСтроки(Новый Структура("Должность", ВыбранноеЗначение)).Количество() = 0 Тогда
			Объект.КонтролируемыеДолжности.Добавить().Должность = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроводитсяОднократноПриИзменении(Элемент)
	УстановитьДоступностьПериодичности();
КонецПроцедуры


Процедура УстановитьДоступностьПериодичности()
	Элементы.СрокДействия.Доступность = Не Объект.ПроводитсяОднократно;
	Элементы.Периодичность.Доступность = Не Объект.ПроводитсяОднократно;
КонецПроцедуры //УстановитьДоступностьПериодичности()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Если ДокументОбъект.ЭтоНовый() Тогда
		Объект.СрокДействия = 1;
		Объект.Периодичность = Перечисления.Периодичность.Год;
	ИначеЕсли ДокументОбъект.Предопределенный Тогда
		Элементы.Группа1.Видимость = Ложь;
	КонецЕсли;
	
	
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПериодичности()
КонецПроцедуры


&НаКлиенте
Процедура КонтролируемыеДолжностиДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ДолжностиОрганизаций") Тогда
		СтандартнаяОбработка = Ложь;
		Если Объект.КонтролируемыеДолжности.НайтиСтроки(Новый Структура("Должность", ВыбранноеЗначение)).Количество() = 0 Тогда
			Элементы.КонтролируемыеДолжности.ТекущиеДанные.Должность = ВыбранноеЗначение;
		Иначе
			Предупреждение("Должность " + ВыбранноеЗначение + " уже присутствует в списке.");	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КонтролируемыеДолжностиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и Копирование Тогда
		Элементы.КонтролируемыеДолжности.ТекущиеДанные.Должность = "";
	КонецЕсли;
КонецПроцедуры

