
Функция СписокДокументовВводимыхНаОсновании(ТекущиеДанные) Экспорт
	
	ДокументыВводимыеНаОсновании = Новый СписокЗначений;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ДокументыВводимыеНаОсновании.Добавить(
			Метаданные.Документы.ПлатежныйОрдерСписаниеДенежныхСредств.Имя, 
			Метаданные.Документы.ПлатежныйОрдерСписаниеДенежныхСредств.Синоним,,
			БиблиотекаКартинок.Документ);
	КонецЕсли;
	
	Возврат ДокументыВводимыеНаОсновании;
	
КонецФункции

#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура ОбработкаВводаНаОсновании(ИмяМетаданныхДокумента, ТекущиеДанные, Форма) Экспорт
	
	ЭлементыФормы = Форма.ЭлементыФормы;

	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяМетаданныхДокумента]) Тогда
		ДокументОбъект = Документы[ИмяМетаданныхДокумента].СоздатьДокумент();
		ДокументОбъект.Заполнить(ТекущиеДанные.Ссылка);
		ФормаДокумента = ДокументОбъект.ПолучитьФорму();
		ФормаДокумента.Открыть();
	Иначе
		Предупреждение("Нарушение прав доступа!");	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
