////////////////////////////////////////////////////////////////////////////////
// Процедуры печати документа.

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналРегистрацииИнструктажаПоОхранеТруда") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналРегистрацииИнструктажаПоОхранеТруда", "Журнал регистрации инструктажа по охране труда", ПечатьЖурналаИнструктажей(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ПечатьЖурналаИнструктажей(ТекущиеОтборы, ОбъектыПечати)
	
	 ДокументРезультат = Новый ТабличныйДокумент;
	 
     КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	 Схема = Документы.ИнструктажПоОхранеТруда.ПолучитьМакет("ЖурналРегистрацииИнструктажаПоОхранеТруда");
	
	 Настройка = Схема.НастройкиПоУмолчанию;
	 
	 Для каждого ЭлементОтбора Из ТекущиеОтборы Цикл
	 	ДобавляемыйОтбор = Настройка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ДобавляемыйОтбор.ВидСравнения = ЭлементОтбора.ВидСравнения;
	    ДобавляемыйОтбор.Использование = ЭлементОтбора.Использование;
	    ДобавляемыйОтбор.ЛевоеЗначение = ЭлементОтбора.ЛевоеЗначение;
	    ДобавляемыйОтбор.ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
	    ДобавляемыйОтбор.Применение = ЭлементОтбора.Применение;
	 КонецЦикла;
     
     МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройка, );
     
     ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
     ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ,,  Истина);
     
     ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
     ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	 ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	 ДокументРезультат.АвтоМасштаб = Истина;
     Возврат ДокументРезультат;
	
КонецФункции // ПечатьЖурналаИнструктажей()
