Перем ЗапрещенныеСчета Экспорт;
Перем СписокИсключений Экспорт;

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Порядок = ПолучитьПорядокКода();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ ЗначениеЗаполнено(КодБыстрогоВыбора) Тогда
		КодБыстрогоВыбора = СокрЛП(СтрЗаменить(Код, ".", ""));
	КонецЕсли;
КонецПроцедуры

//ЗапрещенныеСчета = Новый СписокЗначений();
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановкеИСтроительныеМатериалы);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеИСозданиеОсновныхСредств);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Товары);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ТоварыПринятыеНаКомиссию);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДепонированнымСуммам);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов);
//  
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
////99
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиямВал);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиямУЕ);

//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Касса);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.КассаОрганизации);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ОперационнаяКасса);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.КассаОрганизацииВал);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.СпециальныеСчета);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.Аккредитивы);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ЧековыеКнижки);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчета);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеСпециальныеСчета); //55.04
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.АккредитивыВал);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчетаВал);
//ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.КурсовыеРазницы);
////ЗапрещенныеСчета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеСпециальныеСчетаВал);   //55.24

//СписокИсключений = Новый СписокЗначений();
//СписокИсключений.Добавить(ПланыСчетов.Хозрасчетный.ВекселяВыданные);
//СписокИсключений.Добавить(ПланыСчетов.Хозрасчетный.ВекселяПолученные);
//СписокИсключений.Добавить(ПланыСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации);

