///////////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ПОДСИСТЕМЫ ФУНКЦИЙ ОТЧЕТОВ




Процедура ПараметрОтчетаПриИзменении(ФормаОтчета, СтруктураПараметровВызоваОтчета, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ОтборОтчетаПриИзменении(ФормаОтчета, СтруктураПараметровВызоваОтчета, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ОбработкаРасшифровки(ФормаОтчета, Расшифровка, СтруктураПараметровВызоваОтчета = Неопределено, СтандартнаяОбработка = ложь) Экспорт
	
КонецПроцедуры