#Если Клиент Тогда
	
Функция УстановитьЗакладку(ИмяЗакладки, ЭлементыФормы) Экспорт
	
	ТекущаяСтраницаИмя = ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница.Имя;
	ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница = ЭлементыФормы.ОсновнаяПанель.Страницы[ИмяЗакладки];
	ЭлементыФормы[ТекущаяСтраницаИмя + "Активная"].Видимость = Ложь;
	ЭлементыФормы[ТекущаяСтраницаИмя].Видимость = Истина;
	ЭлементыФормы[ИмяЗакладки + "Активная"].Видимость = Истина;
	ЭлементыФормы[ИмяЗакладки].Видимость = Ложь;
	Возврат ЭлементыФормы[ИмяЗакладки + "Активная"];
	
КонецФункции

Процедура УстановитьИмяТекущегоПользователя(ЗаголовокНадписи) Экспорт
	// заполним команду Мои настройки представлением текущего пользователя
	Если Не ПустаяСтрока(ИмяПользователя()) Тогда
		ЗаголовокНадписи = ОбщегоНазначения.ПолучитьПредставленияОбъектов(глЗначениеПеременной("глТекущийПользователь"));
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьОсновнуюОрганизацию(ЗаголовокНадписиОсновнойОрганизации, ЗаголовокКомандыОсновнойОрганизации, ОбъектОбработка) Экспорт
	ОбъектОбработка.ОсновнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	ЗаголовокНадписиОсновнойОрганизации = ОбщегоНазначения.ПолучитьПредставленияОбъектов(ОбъектОбработка.ОсновнаяОрганизация);
	ЗаголовокКомандыОсновнойОрганизации = ?(ЗначениеЗаполнено(ОбъектОбработка.ОсновнаяОрганизация), "Изменить ", "Установить ") + ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("основную организацию");
КонецПроцедуры

Функция ОтсечьЦифры(ИсходнаяСтрока) 

	ФинальнаяСтрока = ИсходнаяСтрока;
	
	КодСимвола = КодСимвола(Прав(ИсходнаяСтрока, 1));
	
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - 1);
	КонецЕсли; 
	
	Возврат ФинальнаяСтрока;
		
КонецФункции // ОтсечьЦифры()

Процедура ОбработкаИсключения(ИнформацияОбОшибке) Экспорт
	
	ПричинаОшибки = ИнформацияОбОшибке.Причина;
	Предупреждение(?(ПричинаОшибки = Неопределено,
					 "При выполнении действия произошла ошибка.",
					 ПричинаОшибки.Описание));
	
КонецПроцедуры // ОбработкаИсключения()

Процедура ОбработатьОткрытиеФормы(Элемент, Менеджер = Неопределено, ФормаСписка = Истина, ИмяФормы = Неопределено) Экспорт

	ИмяОбъектаМетаданных = ОтсечьЦифры(Элемент.Имя);
	
	Попытка
		
		Если Менеджер = Неопределено Тогда
			Форма = ПолучитьОбщуюФорму(ИмяОбъектаМетаданных);
		ИначеЕсли ФормаСписка Тогда
			Если ИмяФормы = Неопределено Тогда
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФормуСписка();
			Иначе
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФормуСписка(ИмяФормы);
			КонецЕсли;
		Иначе
			Если ИмяФормы = Неопределено Тогда
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФорму();
			Иначе
				Форма = Менеджер[ИмяОбъектаМетаданных].ПолучитьФорму(ИмяФормы);
			КонецЕсли;
		КонецЕсли;	
		Форма.Открыть();
		
	Исключение
		ОбработкаИсключения(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры // ОткрытьДокумент()



Процедура ФормаОбработкиПисьмоВТехподдержку(Элемент, ФормаОбработки) Экспорт
	
	УправлениеЭлектроннойПочтой.ОтправитьСообщениеВОтделТехническойПоддержки();
	
КонецПроцедуры

Процедура ФормаОбработкиНаписатьОтзыв(Элемент, ФормаОбработки) Экспорт
	
	//РаботаСДиалогамиПереопределяемый.ПерейтиНаСтраницуОтзывОПрограмме();

КонецПроцедуры

Процедура ФормаОбработкиСайт1С(Элемент, ФормаОбработки) Экспорт
	
	РаботаСДиалогами.ПоказатьВебСтраницу("http://www.1c.ru", "Сайт фирмы 1С", "Сайт1С");
	
КонецПроцедуры

Процедура ФормаОбработкиСайт1СМинск(Элемент, ФормаОбработки) Экспорт
	
	РаботаСДиалогами.ПоказатьВебСтраницу("http://www.1c-minsk.by", "Сайт фирмы 1С-Минск", "Сайт1СМинск");
	
КонецПроцедуры


Процедура ФормаОбработкиМониторЗаконодательства(Элемент, ФормаОбработки) Экспорт
	
	РаботаСДиалогами.ПоказатьВебСтраницу("http://v8.1c.ru/lawmonitor/");
	
КонецПроцедуры

Процедура ФормаОбработкиСайтБУХру(Элемент, ФормаОбработки) Экспорт
	
	РаботаСДиалогами.ПоказатьВебСтраницу("http://www.buh.ru/");

КонецПроцедуры

Процедура ФормаОбработкиПоказатьСтраницуКонфигурации(Элемент, ФормаОбработки) Экспорт
	
	РаботаСДиалогами.ПоказатьВебСтраницу("");
	
КонецПроцедуры

Процедура ФормаОбработкиОткрытьПерерасчетПособий(Элемент, ФормаОбработки) Экспорт
	
	//РаботаСДиалогамиЗК.ОткрытьПерерасчетПособийНаДетей();
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементовУправленияОрганизациями(ЭлементыФормы) Экспорт
	
	Если Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0 Тогда
		УправлениеОрганизациямиДоступно = Ложь;
	Иначе
		ДоступностьОрганизаций = РаботаСДиалогами.ДоступностьОрганизаций();
		УправлениеОрганизациямиДоступно = ДоступностьОрганизаций.ДоступноНесколькоОрганизаций;
	КонецЕсли;
	
	ЭлементыФормы.ПанельНашиОрганизации.Видимость = УправлениеОрганизациямиДоступно;
	ЭлементыФормы.УстановитьОсновнуюОрганизацию.Видимость = УправлениеОрганизациямиДоступно;
	
КонецПроцедуры

#КонецЕсли
