
Процедура ПередЗаписью(Отказ)
	
	Если ТипЗнч(Объект.Предмет) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Предмет = Объект.Предмет;
	Иначе
		Предмет = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	ДанныеХранилища = Хранилище.Получить();
	ТекстФайлаЗаписан = Ложь;
	Если ТипЗнч(ДанныеХранилища) = Тип("ДвоичныеДанные") Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла(ОбщегоНазначения.ПолучитьРасширениеФайла(ИмяФайла));
		Попытка
			ДанныеХранилища.Записать(ВременныйФайл);
			Извлечение = Новый ИзвлечениеТекста(ВременныйФайл);
			ТекстФайла = Новый ХранилищеЗначения(Извлечение.ПолучитьТекст());
			ТекстФайлаЗаписан = Истина;
		Исключение
			ТекстФайлаЗаписан = Ложь;
		КонецПопытки;
		УдалитьФайлы(ВременныйФайл);
	КонецЕсли;
	
	Если НЕ ТекстФайлаЗаписан Тогда
		ТекстФайла = Новый ХранилищеЗначения("");
	КонецЕсли; 
	
КонецПроцедуры

