
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.ПорядокПересчетаМесячнойСтавкиВЧасовую.Пустая() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указан порядок пересчета месячной ставки в часовую. Сведения не записаны!",Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
