///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЗАПОЛНЕНИЯ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ

 //Функция инициализирует глобальную переменную глУчетнаяПолитикаПоПерсоналу.
 //Переменная содержит структуру.
 //Параметры:
 // Нет.
//Функция ЗаполнениеУчетнойПолитикиПоПерсоналу() Экспорт
//	
//	УчетнаяПолитикаПоПерсоналу = Новый Структура("РасчетЗарплатыПоОтветственным,ПоказыватьТабельныеНомераВДокументах,ПоддерживатьНесколькоСхемМотивации,КоличествоДнейОтпускаВГод", Ложь, Ложь, Ложь, 20);
//	
//	Выборка = РегистрыСведений.УчетнаяПолитикаПоПерсоналу.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		УчетнаяПолитикаПоПерсоналу = Новый Структура("РасчетЗарплатыПоОтветственным,ПоказыватьТабельныеНомераВДокументах,ПоддерживатьНесколькоСхемМотивации,КоличествоДнейОтпускаВГод", Выборка.РасчетЗарплатыПоОтветственным, Выборка.ПоказыватьТабельныеНомераВДокументах, Выборка.ПоддерживатьНесколькоСхемМотивации, Выборка.КоличествоДнейОтпускаВГод);
//	КонецЦикла;
//	
//	Возврат УчетнаяПолитикаПоПерсоналу;
//	
//КонецФункции
