
Процедура ДополнитьМассивУзловДляВыгрузкиДокумента(Элемент, МассивУзловДляПередачи, 
	ТипЭлемента = Неопределено, ВыгружатьДляВсехУзлов = Ложь, ВозвращатьМассивВсехУзлов = Истина,
	СоотвествиеУзловИОрганизаций = Неопределено) Экспорт
	
	Если ТипЭлемента = Неопределено Тогда
		ТипЭлемента = ТипЗнч(Элемент);
	КонецЕсли;
	
	Если ТипЭлемента = Тип("ДокументСсылка.КорректировкаЗаписейРегистровНакопления")
		ИЛИ ТипЭлемента = Тип("ДокументОбъект.КорректировкаЗаписейРегистровНакопления")	Тогда
		
		ПроцедурыОбменаДаннымиПоОрганизации.ОбеспечитьВыгрузкуОбъектаДляВсехУзлов(ВыгружатьДляВсехУзлов, ВозвращатьМассивВсехУзлов, МассивУзловДляПередачи);
		
	ИначеЕсли ТипЭлемента = Тип("ДокументОбъект.СдельныйНаряд")
		ИЛИ ТипЭлемента = Тип("ДокументСсылка.СдельныйНаряд")
		ИЛИ ТипЭлементаСоответствуетДополнительномуТипу(ТипЭлемента)
		Тогда
		Если Элемент.ОтражатьВБухгалтерскомУчете Тогда
			
			ОрганизацияДокумента = Элемент.Организация;
			Если НЕ ОрганизацияДокумента.ГоловнаяОрганизация.Пустая() Тогда
				ОрганизацияДокумента = ОрганизацияДокумента.ГоловнаяОрганизация;
			КонецЕсли;
			ПроцедурыОбменаДаннымиПоОрганизации.ДополнитьМассивУзламиПоОрганизации(МассивУзловДляПередачи, ОрганизацияДокумента, СоотвествиеУзловИОрганизаций);  	
			
		Иначе
			//ОбеспечитьВыгрузкуОбъектаДляВсехУзлов(ВыгружатьДляВсехУзлов, ВозвращатьМассивВсехУзлов, МассивУзловДляПередачи);	
		КонецЕсли;
		
		
	ИначеЕсли  ТипЭлемента = Тип("ДокументОбъект.Сторнирование")
		ИЛИ ТипЭлемента = Тип("ДокументСсылка.Сторнирование") Тогда
		Если ЗначениеЗаполнено(Элемент.СторнируемыйДокумент) Тогда
			ОрганизацияДокумента = Элемент.СторнируемыйДокумент.Организация;
			Если НЕ ОрганизацияДокумента.ГоловнаяОрганизация.Пустая() Тогда
				ОрганизацияДокумента = ОрганизацияДокумента.ГоловнаяОрганизация;
			КонецЕсли;
			ПроцедурыОбменаДаннымиПоОрганизации.ДополнитьМассивУзламиПоОрганизации(МассивУзловДляПередачи, ОрганизацияДокумента, СоотвествиеУзловИОрганизаций);  
		КонецЕсли;
	Иначе	
		
		ОрганизацияДокумента = ПроцедурыОбменаДаннымиПоОрганизации.ПолучитьЗначениеПараметраОбъектаИлиСсылки(Элемент, "Документы", ТипЭлемента, "Организация");
		// только если из реквизита получена ссылка на организацию - регистрируем на узлах по этой организации
		Если ОрганизацияДокумента <> НеОпределено Тогда
			Если НЕ ОрганизацияДокумента.ГоловнаяОрганизация.Пустая() Тогда
				ОрганизацияДокумента = ОрганизацияДокумента.ГоловнаяОрганизация;
			КонецЕсли;
			ПроцедурыОбменаДаннымиПоОрганизации.ДополнитьМассивУзламиПоОрганизации(МассивУзловДляПередачи, ОрганизацияДокумента, СоотвествиеУзловИОрганизаций);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДополнитьМассивУзловДляВыгрузкиСправочникаПереопределяемый(Элемент, МассивУзловДляПередачи, 
		ТипЭлемента = Неопределено, ВыгружатьДляВсехУзлов = Ложь, ВозвращатьМассивВсехУзлов = Истина,
		СоотвествиеУзловИОрганизаций = Неопределено) Экспорт
		
		
			ПроцедурыОбменаДаннымиПоОрганизации.ОбеспечитьВыгрузкуОбъектаДляВсехУзлов(ВыгружатьДляВсехУзлов, ВозвращатьМассивВсехУзлов, МассивУзловДляПередачи);
		
	
	
КонецПроцедуры // ДополнитьМассивУзловДляВыгрузкиСправочникаПереопределяемый()

Процедура ОпределениеУзловДляВыгрузкиНабораЗаписейРегистраНакопленияПереопределяемый(Элемент, МетаданныеРегистра, СоотвествиеУзловИОрганизаций = Неопределено, МассивУзловДляПередачи) Экспорт

	
		ПроцедурыОбменаДаннымиПоОрганизации.ОпределитьПоНаборуЗаписейСОрганизациейМассивУзловДляПередачи(Элемент, МассивУзловДляПередачи, СоотвествиеУзловИОрганизаций);
		
	
КонецПроцедуры // ОпределениеУзловДляВыгрузкиНабораЗаписейРегистраНакопленияПереопределяемый()



////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

Функция ТипЭлементаСоответствуетДополнительномуТипу(ТипЭлемента) Экспорт

	Если ТипЭлемента = Тип("ДокументОбъект.ДоговорЗаймаСРаботником")
		ИЛИ ТипЭлемента = Тип("ДокументСсылка.ДоговорЗаймаСРаботником")
		ИЛИ ТипЭлемента = Тип("РегистрСведенийНаборЗаписей.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям")
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;		
	КонецЕсли;

КонецФункции