&НаСервере
Функция ПараметрыЗапроса()
	
	СтруктураПараметров = Новый Структура("Сотрудник, Физлицо, Организация, ДатаАктуальности");
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Параметры);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Функция ЗапрашиватьОклад(ВидОрганизационнойСтруктуры, Сотрудник)
	
	Возврат СотрудникиОрганизацийСервер.ДоступныПлановыеНачисленияСотрудника(ВидОрганизационнойСтруктуры, Сотрудник);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	ТаблицаИсторииИзменений = СотрудникиОрганизацийСервер.ТаблицаИзмененийМестаРаботы(Параметры.ВидОрганизационнойСтруктуры, ЗапрашиватьОклад(Параметры.ВидОрганизационнойСтруктуры, Параметры.Сотрудник), Параметры.ПривилегированныйРежимЧтения, ПараметрыЗапроса());
	
	Для Каждого СтрокаТаблицы Из ТаблицаИсторииИзменений Цикл
		ЗаполнитьЗначенияСвойств(ИсторияИзмененияМестаРаботы.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	Элементы.ИсторияИзмененияМестаРаботыОбособленноеПодразделение.Видимость = Параметры.ВидОрганизационнойСтруктуры = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
	
КонецПроцедуры
