
Процедура ВыборФайлаДляЗагрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "(*.xls)|*.xls";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = "xls";
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


Процедура ВыполнитьЗагрузку() Экспорт
	
	Окно = Новый COMОбъект("Excel.Application");
	Книги = Окно.Workbooks;
	Книга = Книги.open(СокрЛП(Файлзагрузки)); 
	
	Если Книга.ActiveSheet.Name <> "Sheet1" Тогда
		Книга.WorkSheets("Sheet1").Activate();    	
	КонецЕсли;
	
	ТЗ=Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("ФИО");
	ТЗ.Колонки.Добавить("Картсчет");
	ТЗ.Колонки.Добавить("ДатаРождения");
	
	Для ном = 2 по 1000 Цикл		
		
		ФИО = Окно.Cells(ном,1).Value;
		
		Если СокрЛП(ФИО)="" Тогда
			Прервать;
		КонецЕсли;
		
		КартСчет = Окно.Cells(ном,2).Value;
		ДатаРождения = Окно.Cells(ном,3).Value;
		
		НоваяСтрока=ТЗ.Добавить();
		
		НоваяСтрока.ФИО=СокрЛП(ФИО);
		НоваяСтрока.КартСчет=СокрЛП(КартСчет);
		НоваяСтрока.ДатаРождения=СтрЗаменить(СокрЛП(ДатаРождения),"/",".");
		
	КонецЦикла;
	
	Попытка
		Окно.Application.Quit();
	Исключение		
	КонецПопытки;
		
	СтруктураОтбора=Новый Структура;
	СтруктураОтбора.Вставить("Организация",Организация);
	
	ВыборкаЗаявок=Документы.ЗаявкаНаОткрытиеСчетов.Выбрать(ВыбДата, ВыбДата,СтруктураОтбора);
	
	Если ВыборкаЗаявок.Следующий()  ТОгда
		Заявка=ВыборкаЗаявок.ПолучитьОбъект();			
		Заявка.РаботникиОрганизации.Очистить();;
	Иначе
		Заявка=Документы.ЗаявкаНаОткрытиеСчетов.СоздатьДокумент();
	КонецЕсли;
	
	Заявка.Организация=Организация;
	Заявка.Дата=ВыбДата;
	Заявка.ВводНачальныхСведений=Истина;
	
	ЗапросФизЛиц=Новый Запрос;
	
	ЗапросФизЛиц.Текст=
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.Наименование КАК ФИО,
	|	ФизическиеЛица.ДатаРождения
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица";
	
	ВыборкаФизЛиц=ЗапросФизЛиц.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ВыборкаФизЛиц Цикл
		Стр.ФИО=ВРЕГ(СТР.ФИО);
		Стр.ФИО=СтрЗаменить(Стр.ФИО,"  "," ");
	КонецЦикла;
	
	ОтборФизЛиц=Новый Структура;
	
	Попытка
		
		НачатьТранзакцию();
		
		Для каждого Стр Из ТЗ Цикл
						
			Нашли=Ложь;
			ФизЛицо=Справочники.ФизическиеЛица.ПустаяСсылка();
			ОтборФизЛиц.Вставить("ФИО",ВРЕГ(Стр.ФИО));
			НайденныеСтроки=ВыборкаФизЛиц.НайтиСтроки(ОтборФизЛиц);
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если ФОРМАТ(НайденнаяСтрока.ДатаРождения,"ДЛФ=Д")=Стр.ДатаРождения ТОгда
					Нашли=Истина;
					ФизЛицо=НайденнаяСтрока.Ссылка;
					Прервать;
				КонецЕсли;			
			КонецЦикла;	
			
			Если Не Нашли ТОгда
				Сообщить("Не найден сотрудник "+ВРЕГ(Стр.ФИО)+" с датой рождения "+ФОРМАТ(Стр.ДатаРождения,"ДЛФ=Д"));  
				Продолжить;
			КонецЕсли;

			НоваяСтрока=Заявка.РаботникиОрганизации.Добавить();
			НоваяСтрока.ФизЛицо=ФизЛицо;	
			НоваяСтрока.НомерЛицевогоСчета=Стр.Картсчет;
			НоваяСтрока.Банк=Банк;
			НоваяСтрока.ДоговорБанка=Договор;
			
			СрезФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ВыбДата, Новый Структура("ФизЛицо", Физлицо));
			Если СрезФИО.Количество() > 0 Тогда
				НоваяСтрока.ЭмбоссированныйТекст1 = СрезФИО[0].Имя;
				   НоваяСтрока.ЭмбоссированныйТекст2 = СрезФИО[0].Фамилия;
			КонецЕсли;
			
		КонецЦикла;
		
		Заявка.Записать();
		Сообщить("Карт счета успешно загружены");
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
	
КонецПроцедуры
