// Этот модуль предназачен для реализации алгоритмов работы форм и 
// содержит процедуры и функции работы с формами и элементами форм,
// а также подготовки данных для представления информации в формах.

#Если ТолстыйКлиентОбычноеПриложение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ОРГАНАЙЗЕРА

// Процедура выполняет открытие формы заметки
//
// Параметры:
//  ТекущийОбъект - объект редактируемого документа,
//  ФормаОбъекта - форма редактируемого документа
//
Процедура СоздатьЗаметку(ТекущийОбъект, ФормаОбъекта) Экспорт
	
	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(ТекущийОбъект.Ссылка);
	Если ВидОбъекта = "Документ" Тогда
		Если ТекущийОбъект.ЭтоНовый() Тогда
			Вопрос = "Перед началом работы с заметками необходимо записать документ. Записать?";
			Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);
			
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				ФормаОбъекта.ЗаписатьВФорме();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаЭлемента", Новый Структура("Предмет", ТекущийОбъект.Ссылка), ФормаОбъекта, ТекущийОбъект.Ссылка);

КонецПроцедуры // СоздатьЗаметку()

// Процедура выполняет открытие формы бизнес-процесса
//
// Параметры:
//  ТекущийОбъект - объект редактируемого документа,
//  ФормаОбъекта - форма редактируемого документа
//
Процедура СоздатьЗадание(ТекущийОбъект, ФормаОбъекта) Экспорт
	
	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(ТекущийОбъект.Ссылка);
	Если ВидОбъекта = "Документ" Тогда
		Если ТекущийОбъект.ЭтоНовый() Тогда
			Вопрос = "Перед началом работы с заданиями необходимо записать документ. Записать?";
			Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);
			
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				ФормаОбъекта.ЗаписатьВФорме();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ОткрытьФорму("БизнесПроцесс.Задание.Форма.ФормаБизнесПроцесса", Новый Структура("Предмет", ТекущийОбъект.Ссылка), ФормаОбъекта, ТекущийОбъект.Ссылка);

КонецПроцедуры // СоздатьБизнесПроцесс()

// Процедура выполняет открытие формы напоминания
//
// Параметры:
//  ТекущийОбъект - объект редактируемого документа,
//  ФормаОбъекта - форма редактируемого документа
//
Процедура СоздатьНапоминание(ТекущийОбъект, ФормаОбъекта) Экспорт

	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(ТекущийОбъект.Ссылка);
	Если ВидОбъекта = "Документ" Тогда
		Если ТекущийОбъект.ЭтоНовый() Тогда
			Вопрос = "Перед началом работы с напоминаниями необходимо записать документ. Записать?";
			Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ОКОтмена);
			
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				ФормаОбъекта.ЗаписатьВФорме();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ОткрытьФорму("РегистрСведений.НапоминанияПользователя.Форма.Напоминание", Новый Структура("Источник", ТекущийОбъект.Ссылка), ФормаОбъекта, ТекущийОбъект.Ссылка);

КонецПроцедуры // СоздатьБизнесПроцесс()
	
#КонецЕсли