////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

Функция ТипВладельцаСоответствуетДополнительномуТипу(ТипВладельца) Экспорт

	Если ТипВладельца = Тип("СправочникСсылка.Помещения")
		ИЛИ ТипВладельца = Тип("СправочникСсылка.Территории")
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;		
	КонецЕсли;

КонецФункции

Функция ТипОбъектаСоответствуетДополнительномуТипу(ТипОбъекта) Экспорт

	Если ТипОбъекта = Тип("СправочникОбъект.ОстаткиОтпусков")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.НачислениеЗарплатыРаботникам") 
		//ИЛИ ТипОбъекта = Тип("ДокументОбъект.ВводРаспределенияЗаработкаРаботников")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ЗарплатаКВыплате")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.КадровоеПеремещение")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.Увольнение")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.РезервированиеПомещений")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ОтражениеЗарплатыВУпрУчете")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ОтражениеВУчетеБухгалтерскихРасчетовСПерсоналом")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.ВводСведенийОПлановыхНачисленияхУдержанияхРаботников")
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.УчетЗаработкаРаботников")
		ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям")
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;		
	КонецЕсли;

КонецФункции