
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ УПРАВЛЕНИЯ ПОЛЯМИ ВВОДА АНАЛИТИКИ В ДОКУМЕНТАХ

// Процедура выполняет установку в строке документа значения аналитики расходов,
// полученное из временного поля ввода
//
Процедура ПриИзмененииАналитикиРасходов(Элемент, ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.АналитикаРасходов = ТекущиеДанные[Элемент.Имя];
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииАналитикиРасходов
