
// Устанавливает блокировку соединений при пакетном 
// обновлении конфигурации информационной базы
//
Процедура УстановитьБлокировкуСоединенийПриОбновлении() экспорт
	
	Блокировка = Новый БлокировкаУстановкиСоединений;
	
	Блокировка.Установлена = Истина;
	Блокировка.Начало = ТекущаяДата();
	Блокировка.КодРазрешения = "ПакетноеОбновлениеКонфигурацииИБ";
	ТекстСообщения = "Администратор просит Вас завершить работу системы самостоятельно," + Символы.ПС+
					 " в связи с необходимостью обновления конфигурации." + Символы.ПС+"
		               |Если через несколько минут работа системы не будет завершена, 
		               |администратор завершит работу принудительно!";
					   
	Блокировка.Сообщение = ТекстСообщения;	
		
	УстановитьБлокировкуУстановкиСоединений(Блокировка);
КонецПроцедуры // УстановитьБлокировкуСоединенийПриОбновлении()

// Процедура подключает обработчик ожижания КонтрольРежимаЗавершенияРаботыПользователей
// 
Процедура УстановитьКонтрольРежимаЗавершенияРаботыПользователей()  Экспорт
		
	РежимБлокировки = ПолучитьБлокировкуУстановкиСоединений();
	ТекущееВремя = ТекущаяДата();
	Если РежимБлокировки.Установлена 
		 И (НЕ ЗначениеЗаполнено(РежимБлокировки.Начало) ИЛИ ТекущееВремя >= РежимБлокировки.Начало) 
		 И (НЕ ЗначениеЗаполнено(РежимБлокировки.Конец) ИЛИ ТекущееВремя <= РежимБлокировки.Конец) Тогда
		// Если пользователь зашел в базу, в которой установлена режим блокировки, значит использовался ключ /UC.
		// Завершать работу такого пользователя не следует
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("КонтрольРежимаЗавершенияРаботыПользователей", 60);	
	
КонецПроцедуры // УстановитьКонтрольРежимаЗавершенияРаботыПользователей 
