// Процедура добавляет в форму списка УчетнаяПолитикаНалоговыйУчет дополнительные колонки
Процедура ПриОткрытииФормыСпискаУчетнаяПолитикаНалоговыйУчетДополнительно(Форма) Экспорт	
	
	РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(4, Форма.ЭлементыФормы.РегистрСведенийСписок, "УСН", "Система налогообложения", "УСН");
	РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(5, Форма.ЭлементыФормы.РегистрСведенийСписок, "ОбъектНалогообложенияУСН", "Объект налогообложения УСН", "ОбъектНалогообложенияУСН");
	РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(6, Форма.ЭлементыФормы.РегистрСведенийСписок, "ВариантУчетаРасходовПоНалогамСФОТВНалоговомУчете", "Учет расходов по налогам с ФОТ", "ВариантУчетаРасходовПоНалогамСФОТВНалоговомУчете",,,,,ПоложениеКолонки.НаСледующейСтроке);
	
КонецПроцедуры

// В процедуре производится оформление ячеек табличного поля истории значений
Процедура ОформитьЯчейкиДополнительныхКолонкСпискаУчетнаяПолитикаНалоговый(Форма, ОформлениеСтроки) Экспорт

	ОформлениеСтроки.Ячейки.ОбъектНалогообложенияУСН.Видимость = ОформлениеСтроки.Ячейки.УСН.Значение;
	ОформлениеСтроки.Ячейки.ВариантУчетаРасходовПоНалогамСФОТВНалоговомУчете.Видимость = Не ОформлениеСтроки.Ячейки.УСН.Значение;
	
	ОформлениеСтроки.Ячейки.УСН.Текст = ?(ОформлениеСтроки.Ячейки.УСН.Значение, "Упрощенная", "Общая");

КонецПроцедуры
