////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мВалютаУправленческогоУчета;
Перем мВалютаРегламентированногоУчета;
Перем мМетодПланированияУчетаЗатрат Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Автозаполнение() Экспорт
	
	Если мМетодПланированияУчетаЗатрат = Перечисления.МетодыПланированияУчетаЗатратНаПерсонал.КассовыйМетодБезВыделенияНалогов
		ИЛИ мМетодПланированияУчетаЗатрат = Перечисления.МетодыПланированияУчетаЗатратНаПерсонал.КассовыйМетодСВыделениемНалогов Тогда
		
		ЗаполнитьКассовымМетодом();
		
	Иначе
		ЗаполнитьМетодомНачислений();
		
	КонецЕсли;
	
КонецПроцедуры  // АвтозаполнениеПроводок

Процедура РаспределитьПоКассовомуМетоду() Экспорт
	
	Запрос = ПодготовитьВременныеТаблицы(ДобавитьМесяц(ПериодРегистрации, -1));
	Если Запрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделятьНалоги = мМетодПланированияУчетаЗатрат = Перечисления.МетодыПланированияУчетаЗатратНаПерсонал.КассовыйМетодСВыделениемНалогов;
	
	Запрос.УстановитьПараметр("парамПериодРегистрацииВзаиморасчетов",	ПериодРегистрации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОтражениеВУчете.Сумма) КАК Сумма,
	|	ОтражениеВУчете.КатегорияЗатраты КАК КатегорияЗатраты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата) КАК КатегорияЗатраты,
	|		ВзаиморасчетыСРаботниками.СуммаУпр КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботниками КАК ВзаиморасчетыСРаботниками
	|	ГДЕ
	|		ВзаиморасчетыСРаботниками.Период МЕЖДУ &парамПериодРегистрации И &парамКонецПериодаРегистрации
	|		И ВзаиморасчетыСРаботниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата),
	|		ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов / ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Курс, 1) * ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Кратность, 1)
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалютДляРасчетовСПерсоналом
	|			ПО (КурсыВалютДляРасчетовСПерсоналом.Период = &парамПериодРегистрации)
	|				И (КурсыВалютДляРасчетовСПерсоналом.Валюта = &парамВалютаУправленческогоУчета)
	|	ГДЕ
	|		ВзаиморасчетыСРаботникамиОрганизаций.Период МЕЖДУ &парамПериодРегистрацииВзаиморасчетов И КОНЕЦПЕРИОДА(&парамПериодРегистрацииВзаиморасчетов, МЕСЯЦ)
	|		И ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		" + ?(ВыделятьНалоги, "ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.ЕСН)", "ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата)") + ",
	|		ПромежуточнаяТаблица.Сумма / ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Курс, 1) * ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Кратность, 1)
	|	ИЗ
	|		ВТ_ПромежуточнаяТаблица КАК ПромежуточнаяТаблица
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалютДляРасчетовСПерсоналом
	|			ПО (КурсыВалютДляРасчетовСПерсоналом.Период = &парамПериодРегистрации)
	|				И (КурсыВалютДляРасчетовСПерсоналом.Валюта = &парамВалютаУправленческогоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		" + ?(ВыделятьНалоги, "ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.НДФЛ)", "ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата)") + ",
	|		НДФЛРасчетыСБюджетом.Налог / ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Курс, 1) * ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Кратность, 1)
	|	ИЗ
	|		РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалютДляРасчетовСПерсоналом
	|			ПО (КурсыВалютДляРасчетовСПерсоналом.Период = &парамПериодРегистрации)
	|				И (КурсыВалютДляРасчетовСПерсоналом.Валюта = &парамВалютаУправленческогоУчета)
	|	ГДЕ
	|		НДФЛРасчетыСБюджетом.ИсчисленоИзЗарплаты
	|		И НДФЛРасчетыСБюджетом.Период МЕЖДУ &парамПериодРегистрации И &парамКонецПериодаРегистрации
	|		И НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.Начисление)
	|		И НДФЛРасчетыСБюджетом.Налог <> 0) КАК ОтражениеВУчете
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеВУчете.КатегорияЗатраты
	|
	|УПОРЯДОЧИТЬ ПО
	|	КатегорияЗатраты
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СуммыКРаспределению.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // РаспределитьПоКассовомуМетоду

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПодготовитьВременныеТаблицы(АктуальныйПериодРегистрации)
	
	// Проверим, что задан курс валюты для расчетов с персоналом
	Если мВалютаРегламентированногоУчета <> мВалютаУправленческогоУчета Тогда
		СрезКурсаВалюты	= РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.Получить(НачалоМесяца(ПериодРегистрации), Новый Структура("Валюта", мВалютаУправленческогоУчета));
		Если Не ЗначениеЗаполнено(СрезКурсаВалюты.Курс) ИЛИ Не ЗначениеЗаполнено(СрезКурсаВалюты.Кратность) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не задан курс " + мВалютаУправленческогоУчета + " для расчетов с персоналом на " + ПредставлениеПериода(НачалоМесяца(ПериодРегистрации), КонецМесяца(ПериодРегистрации))+ "!");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ОтражениеВУчете.Очистить();
	
	// фактически - создаем структуру промежуточной таблицы
	ПромежуточнаяТаблица = ОтражениеВУчете.Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамГод",						Год(АктуальныйПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоГода",				НачалоГода(АктуальныйПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериодРегистрации",			АктуальныйПериодРегистрации);
	Запрос.УстановитьПараметр("парамКонецПериодаРегистрации",	КонецМесяца(АктуальныйПериодРегистрации));
	Запрос.УстановитьПараметр("парамВалютаУправленческогоУчета",мВалютаУправленческогоУчета);
	
	// УУДоходыПоВР
	//	Поля:
	//		ОбособленноеПодразделение
	//		Сотрудник
	//		Физлицо
	//		ВидРасчета
	//		ПериодРегистрации
	//		Подразделение
	//		СтатьяЗатрат
	//		НоменклатурнаяГруппа
	//		ОбъектСтроительства
	//		Результат
	//	
	//	Описание:
	//	Данные отражения начислений в упручете
	
	УУДоходыПоВРТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Начисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Физлицо,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	Начисления.ПериодДействия КАК ПериодДействия,
	|	ВЫБОР
	|		КОГДА Начисления.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				И (НЕ СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение ЕСТЬ NULL )
	|			ТОГДА СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
	|		ИНАЧЕ Начисления.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	Начисления.СтатьяЗатрат,
	|	Начисления.НоменклатурнаяГруппа,
	|	Начисления.ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА Начисления.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				И (НЕ СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение ЕСТЬ NULL )
	|			ТОГДА Начисления.Результат / ЕСТЬNULL(СоответствиеПодразделенийКоличество.КоличествоПодразделений, 1)
	|		ИНАЧЕ Начисления.Результат
	|	КОНЕЦ КАК Результат,
	|	Начисления.ЭтоСтатьяЗатратЕНВД
	|ПОМЕСТИТЬ ВТ_УУДоходыПоВР
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОсновныеНачисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		ОсновныеНачисления.ФизЛицо КАК Физлицо,
	|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|		ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|		ВЫБОР
	|			КОГДА РаспределениеЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И РаспределениеЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.Подразделение
	|			КОГДА УчетЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И УчетЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.Подразделение
	|			КОГДА Работники.Подразделение ЕСТЬ НЕ NULL 
	|					И Работники.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА Работники.Подразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		КОНЕЦ КАК Подразделение,
	|		ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат))) КАК СтатьяЗатрат,
	|		ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа))) КАК НоменклатурнаяГруппа,
	|		ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства))) КАК ОбъектСтроительства,
	|		ОсновныеНачисления.Результат * ЕСТЬNULL(РаспределениеЗаработкаРаботников.ДоляСпособаОтражения, 100) / 100 КАК Результат,
	|		ВЫБОР
	|			КОГДА (ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат)))).ОтнесениеРасходовКДеятельностиЕНВД = ЗНАЧЕНИЕ(Перечисление.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоСтатьяЗатратЕНВД,
	|		ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период,
	|					УчетЗаработкаРаботников.Физлицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|						ПО ОсновныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|							И ОсновныеНачисления.ПериодРегистрации >= УчетЗаработкаРаботников.Период
	|				ГДЕ
	|					ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					УчетЗаработкаРаботников.Физлицо) КАК УчетЗаработкаСрез
	|				ПО УчетЗаработкаРаботников.Физлицо = УчетЗаработкаСрез.Физлицо
	|					И УчетЗаработкаРаботников.Период = УчетЗаработкаСрез.Период
	|			ПО ОсновныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗаработкаРаботников КАК РаспределениеЗаработкаРаботников
	|			ПО ОсновныеНачисления.ПериодРегистрации = РаспределениеЗаработкаРаботников.ПериодРегистрации
	|				И ОсновныеНачисления.ФизЛицо = РаспределениеЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
	|			ПО (СпособыОтраженияЗарплатыВУпрУчете.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(Работники.Период) КАК Период,
	|					Работники.ФизЛицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|						ПО ОсновныеНачисления.ФизЛицо = Работники.ФизЛицо
	|							И ОсновныеНачисления.ПериодРегистрации >= Работники.Период
	|				ГДЕ
	|					ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Работники.ФизЛицо) КАК РаботникиСрез
	|				ПО Работники.ФизЛицо = РаботникиСрез.Физлицо
	|					И Работники.Период = РаботникиСрез.Период
	|			ПО ОсновныеНачисления.ФизЛицо = Работники.ФизЛицо
	|				И (Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|	ГДЕ
	|		ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|		И ОсновныеНачисления.Результат <> 0
	|		И ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпрУчете)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДополнительныеНачисления.ОбособленноеПодразделение,
	|		ДополнительныеНачисления.Сотрудник,
	|		ДополнительныеНачисления.ФизЛицо,
	|		ДополнительныеНачисления.ВидРасчета,
	|		ДополнительныеНачисления.ПериодРегистрации,
	|		ДополнительныеНачисления.ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА РаспределениеЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И РаспределениеЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.Подразделение
	|			КОГДА УчетЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И УчетЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.Подразделение
	|			КОГДА Работники.Подразделение ЕСТЬ НЕ NULL 
	|					И Работники.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА Работники.Подразделение
	|			ИНАЧЕ ЕСТЬNULL(СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|		КОНЕЦ,
	|		ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат))),
	|		ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа))),
	|		ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства))),
	|		ДополнительныеНачисления.Результат * ЕСТЬNULL(РаспределениеЗаработкаРаботников.ДоляСпособаОтражения, 100) / 100,
	|		ВЫБОР
	|			КОГДА (ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат)))).ОтнесениеРасходовКДеятельностиЕНВД = ЗНАЧЕНИЕ(Перечисление.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ДополнительныеНачисления.ПодразделениеОрганизации
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|			ПО ДополнительныеНачисления.ОбособленноеПодразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Организация
	|				И ДополнительныеНачисления.ПодразделениеОрганизации = СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период,
	|					УчетЗаработкаРаботников.Физлицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|						ПО ДополнительныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|							И ДополнительныеНачисления.ПериодРегистрации >= УчетЗаработкаРаботников.Период
	|				ГДЕ
	|					НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					УчетЗаработкаРаботников.Физлицо) КАК УчетЗаработкаСрез
	|				ПО УчетЗаработкаРаботников.Период = УчетЗаработкаСрез.Период
	|					И УчетЗаработкаРаботников.Физлицо = УчетЗаработкаСрез.Физлицо
	|			ПО ДополнительныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗаработкаРаботников КАК РаспределениеЗаработкаРаботников
	|			ПО ДополнительныеНачисления.ПериодРегистрации = РаспределениеЗаработкаРаботников.ПериодРегистрации
	|				И ДополнительныеНачисления.ФизЛицо = РаспределениеЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
	|			ПО (СпособыОтраженияЗарплатыВУпрУчете.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(Работники.Период) КАК Период,
	|					Работники.ФизЛицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|						ПО ДополнительныеНачисления.ФизЛицо = Работники.ФизЛицо
	|							И ДополнительныеНачисления.ПериодРегистрации >= Работники.Период
	|				ГДЕ
	|					ДополнительныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Работники.ФизЛицо) КАК РаботникиСрез
	|				ПО Работники.Период = РаботникиСрез.Период
	|					И Работники.ФизЛицо = РаботникиСрез.Физлицо
	|			ПО ДополнительныеНачисления.ФизЛицо = Работники.ФизЛицо
	|				И (Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|		И ДополнительныеНачисления.Результат <> 0
	|		И ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпрУчете)) КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|		ПО Начисления.ОбособленноеПодразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Организация
	|			И Начисления.ПодразделениеОрганизации = СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	|			И (Начисления.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.Организация КАК Организация,
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение) КАК КоличествоПодразделений
	|		ИЗ
	|			РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.Организация,
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации) КАК СоответствиеПодразделенийКоличество
	|		ПО Начисления.ОбособленноеПодразделение = СоответствиеПодразделенийКоличество.Организация
	|			И Начисления.ПодразделениеОрганизации = СоответствиеПодразделенийКоличество.ПодразделениеОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбособленноеПодразделение,
	|	Сотрудник,
	|	ВидРасчета,
	|	ПериодРегистрации,
	|	ПериодДействия";
	
	Запрос.Текст = УУДоходыПоВРТекст;
	Запрос.Выполнить();
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	// отражение начислений
	//
	
	// УУНачисления
	//	Поля:
	//		Подразделение
	//		СтатьяЗатрат
	//		НоменклатурнаяГруппа
	//		ОбъектСтроительства
	//		Сумма
	// Объединение:
	// 
	
	Запрос.УстановитьПараметр("ПромежуточнаяТаблица",	ПромежуточнаяТаблица);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПромежуточнаяТаблица.КатегорияЗатраты,
	|	ПромежуточнаяТаблица.Подразделение,
	|	ПромежуточнаяТаблица.СтатьяЗатрат,
	|	ПромежуточнаяТаблица.НоменклатурнаяГруппа,
	|	ПромежуточнаяТаблица.ОбъектСтроительства,
	|	ПромежуточнаяТаблица.Сумма
	|ПОМЕСТИТЬ ВТ_ПромежуточнаяТаблица
	|ИЗ
	|	&ПромежуточнаяТаблица КАК ПромежуточнаяТаблица";
	Запрос.Выполнить();
	
	// сдельный заработок по упр.нарядам рассматриваем отдельно, в этот документ он попадать не должен
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОтражаемыеНачисления
	|ИЗ
	|	ПланВидовРасчета.УправленческиеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели1
	|		ПО Начисления.Ссылка = Показатели1.Ссылка
	|			И (Показатели1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели2
	|		ПО Начисления.Ссылка = Показатели2.Ссылка
	|			И (Показатели2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели3
	|		ПО Начисления.Ссылка = Показатели3.Ссылка
	|			И (Показатели3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели4
	|		ПО Начисления.Ссылка = Показатели4.Ссылка
	|			И (Показатели4.НомерСтроки = 4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели5
	|		ПО Начисления.Ссылка = Показатели5.Ссылка
	|			И (Показатели5.НомерСтроки = 5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели6
	|		ПО Начисления.Ссылка = Показатели6.Ссылка
	|			И (Показатели6.НомерСтроки = 6)
	|ГДЕ
	|	((НЕ Начисления.ЗачетОтработанногоВремени)
	|			ИЛИ ЕСТЬNULL(Показатели1.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели2.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели3.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели4.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели5.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели6.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка))
	|	И Начисления.Ссылка <> ЗНАЧЕНИЕ(ПланВидовРасчета.УправленческиеНачисления.НачисленоПоБухгалтерии)
	|	И Начисления.Ссылка <> ЗНАЧЕНИЕ(ПланВидовРасчета.УправленческиеНачисления.НачисленоПоБухгалтерииСдельно)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	Запрос.Выполнить();
	
	//
	// отражение начислений
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	Возврат Запрос;
	
КонецФункции


Процедура ЗаполнитьМетодомНачислений()
	
	Запрос = ПодготовитьВременныеТаблицы(ПериодРегистрации);
	Если Запрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// из регистра расчетов УправленческиеНачисления берем начисления только по утвержденным схемам мотивации
	// пропускаем тех сотрудников, кому в рег.учете назначено доначисление по данным упр.учета, так как их затраты 
	// уже учтены в данных регучета
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческиеНачисления.ФизЛицо КАК ФизЛицо,
	|	УправленческиеНачисления.ВидРасчета,
	|	УправленческиеНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ВидРасчетаЗачетОтработанногоВремени,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете КАК СпособОтраженияВУпрУчете,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат КАК СпособОтраженияВУпрУчетеСтатьяЗатрат,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа КАК СпособОтраженияВУпрУчетеНоменклатурнаяГруппа,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства КАК СпособОтраженияВУпрУчетеОбъектСтроительства,
	|	УправленческиеНачисления.Подразделение,
	|	УправленческиеНачисления.ПериодДействияНачало,
	|	УправленческиеНачисления.Результат
	|ПОМЕСТИТЬ ВТУправленческиеНачисления
	|ИЗ
	|	РегистрРасчета.УправленческиеНачисления КАК УправленческиеНачисления
	|ГДЕ
	|	УправленческиеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|	И УправленческиеНачисления.ВидРасчета В
	|			(ВЫБРАТЬ
	|				ВидыРасчета.Ссылка
	|			ИЗ
	|				ВТ_ОтражаемыеНачисления КАК ВидыРасчета)
	|	И (НЕ УправленческиеНачисления.ПоВременнойСхемеМотивации)
	|	И (НЕ УправленческиеНачисления.ФизЛицо В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо
	|				ИЗ
	|					РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамПериодРегистрации, Сотрудник.Физлицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							УправленческиеНачисления.ФизЛицо
	|						ИЗ
	|							РегистрРасчета.УправленческиеНачисления КАК УправленческиеНачисления
	|						ГДЕ
	|							УправленческиеНачисления.ПериодРегистрации = &парамПериодРегистрации)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|				ГДЕ
	|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоначислениеПоУправленческомуУчету)))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражениеВУчете.КатегорияЗатраты КАК КатегорияЗатраты,
	|	ОтражениеВУчете.Подразделение КАК Подразделение,
	|	ОтражениеВУчете.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ОтражениеВУчете.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ОтражениеВУчете.ОбъектСтроительства КАК ОбъектСтроительства,
	|	СУММА(ОтражениеВУчете.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата) КАК КатегорияЗатраты,
	|		ВЫБОР
	|			КОГДА РаспределениеЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.Подразделение
	|			КОГДА УчетЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.Подразделение
	|			ИНАЧЕ ОтражениеВУпрУчете.Подразделение
	|		КОНЕЦ КАК Подразделение,
	|		ВЫБОР
	|			КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчетеСтатьяЗатрат
	|			КОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|			ИНАЧЕ СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат
	|		КОНЕЦ КАК СтатьяЗатрат,
	|		ВЫБОР
	|			КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчетеНоменклатурнаяГруппа
	|			КОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|			ИНАЧЕ СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа
	|		КОНЕЦ КАК НоменклатурнаяГруппа,
	|		ВЫБОР
	|			КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчетеОбъектСтроительства
	|			КОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|			ИНАЧЕ СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства
	|		КОНЕЦ КАК ОбъектСтроительства,
	|		ОтражениеВУпрУчете.Результат * ЕСТЬNULL(РаспределениеЗаработкаРаботников.ДоляСпособаОтражения, 100) / 100 КАК Сумма
	|	ИЗ
	|		ВТУправленческиеНачисления КАК ОтражениеВУпрУчете
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Начисления.ФизЛицо КАК ФизЛицо,
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|				ИЗ
	|					ВТУправленческиеНачисления КАК Начисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|						ПО Начисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|							И Начисления.ПериодДействияНачало >= УчетЗаработкаРаботников.Период
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Начисления.ФизЛицо) КАК СведенияОРаботникахСрез
	|				ПО УчетЗаработкаРаботников.Физлицо = СведенияОРаботникахСрез.ФизЛицо
	|					И УчетЗаработкаРаботников.Период = СведенияОРаботникахСрез.Период
	|			ПО ОтражениеВУпрУчете.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗаработкаРаботников КАК РаспределениеЗаработкаРаботников
	|			ПО ОтражениеВУпрУчете.ФизЛицо = РаспределениеЗаработкаРаботников.Физлицо
	|				И (РаспределениеЗаработкаРаботников.ПериодРегистрации = &парамПериодРегистрации)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
	|			ПО (СпособыОтраженияЗарплатыВУпрУчете.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию))
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|					ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете
	|				КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|					ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпручете)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата),
	|		ОтражениеВРеглУчете.Подразделение,
	|		ОтражениеВРеглУчете.СтатьяЗатрат,
	|		ОтражениеВРеглУчете.НоменклатурнаяГруппа,
	|		ОтражениеВРеглУчете.ОбъектСтроительства,
	|		ОтражениеВРеглУчете.Результат / ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Курс, 1) * ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Кратность, 1)
	|	ИЗ
	|		ВТ_УУДоходыПоВР КАК ОтражениеВРеглУчете
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалютДляРасчетовСПерсоналом
	|			ПО (КурсыВалютДляРасчетовСПерсоналом.Период = &парамПериодРегистрации)
	|				И (КурсыВалютДляРасчетовСПерсоналом.Валюта = &парамВалютаУправленческогоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПромежуточнаяТаблица.КатегорияЗатраты,
	|		ПромежуточнаяТаблица.Подразделение,
	|		ПромежуточнаяТаблица.СтатьяЗатрат,
	|		ПромежуточнаяТаблица.НоменклатурнаяГруппа,
	|		ПромежуточнаяТаблица.ОбъектСтроительства,
	|		ПромежуточнаяТаблица.Сумма / ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Курс, 1) * ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Кратность, 1)
	|	ИЗ
	|		ВТ_ПромежуточнаяТаблица КАК ПромежуточнаяТаблица
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалютДляРасчетовСПерсоналом
	|			ПО (КурсыВалютДляРасчетовСПерсоналом.Период = &парамПериодРегистрации)
	|				И (КурсыВалютДляРасчетовСПерсоналом.Валюта = &парамВалютаУправленческогоУчета)) КАК ОтражениеВУчете
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеВУчете.КатегорияЗатраты,
	|	ОтражениеВУчете.Подразделение,
	|	ОтражениеВУчете.СтатьяЗатрат,
	|	ОтражениеВУчете.НоменклатурнаяГруппа,
	|	ОтражениеВУчете.ОбъектСтроительства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	СтатьяЗатрат,
	|	НоменклатурнаяГруппа,
	|	ОбъектСтроительства,
	|	КатегорияЗатраты
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ОтражениеВУчете.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//
	// отражение начислений
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры // ЗаполнитьМетодомНачислений

Процедура ЗаполнитьКассовымМетодом()
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамПериодРегистрации",			ДобавитьМесяц(ПериодРегистрации,-1));
	Запрос.УстановитьПараметр("парамВалютаУправленческогоУчета",мВалютаУправленческогоУчета);
	
	// Проверим, что задан курс валюты для расчетов с персоналом
	Если мВалютаРегламентированногоУчета <> мВалютаУправленческогоУчета Тогда
		СрезКурсаВалюты	= РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.Получить(НачалоМесяца(ПериодРегистрации), Новый Структура("Валюта", мВалютаУправленческогоУчета));
		Если Не ЗначениеЗаполнено(СрезКурсаВалюты.Курс) ИЛИ Не ЗначениеЗаполнено(СрезКурсаВалюты.Кратность) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не задан курс " + мВалютаУправленческогоУчета + " для расчетов с персоналом на " + ПредставлениеПериода(НачалоМесяца(ПериодРегистрации), КонецМесяца(ПериодРегистрации))+ "!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОтражениеВУчете.Очистить();
	
	// сдельный заработок по упр.нарядам рассматриваем отдельно, в этот документ он попадать не должен
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОтражаемыеНачисления
	|ИЗ
	|	ПланВидовРасчета.УправленческиеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели1
	|		ПО Начисления.Ссылка = Показатели1.Ссылка
	|			И (Показатели1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели2
	|		ПО Начисления.Ссылка = Показатели2.Ссылка
	|			И (Показатели2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели3
	|		ПО Начисления.Ссылка = Показатели3.Ссылка
	|			И (Показатели3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели4
	|		ПО Начисления.Ссылка = Показатели4.Ссылка
	|			И (Показатели4.НомерСтроки = 4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели5
	|		ПО Начисления.Ссылка = Показатели5.Ссылка
	|			И (Показатели5.НомерСтроки = 5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели6
	|		ПО Начисления.Ссылка = Показатели6.Ссылка
	|			И (Показатели6.НомерСтроки = 6)
	|ГДЕ
	|	((НЕ Начисления.ЗачетОтработанногоВремени)
	|			ИЛИ ЕСТЬNULL(Показатели1.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели2.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели3.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели4.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели5.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	|				И ЕСТЬNULL(Показатели6.Показатель, ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка))
	|	И Начисления.Ссылка <> ЗНАЧЕНИЕ(ПланВидовРасчета.УправленческиеНачисления.НачисленоПоБухгалтерии)
	|	И Начисления.Ссылка <> ЗНАЧЕНИЕ(ПланВидовРасчета.УправленческиеНачисления.НачисленоПоБухгалтерииСдельно)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";
	Запрос.Выполнить();
	
	// из регистра расчетов УправленческиеНачисления берем начисления только по утвержденным схемам мотивации
	// пропускаем тех сотрудников, кому в рег.учете назначено доначисление по данным упр.учета, так как их затраты 
	// уже учтены в данных регучета
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческиеНачисления.ФизЛицо КАК ФизЛицо,
	|	УправленческиеНачисления.ВидРасчета,
	|	УправленческиеНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ВидРасчетаЗачетОтработанногоВремени,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете КАК СпособОтраженияВУпрУчете,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат КАК СпособОтраженияВУпрУчетеСтатьяЗатрат,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа КАК СпособОтраженияВУпрУчетеНоменклатурнаяГруппа,
	|	УправленческиеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства КАК СпособОтраженияВУпрУчетеОбъектСтроительства,
	|	УправленческиеНачисления.Подразделение,
	|	УправленческиеНачисления.ПериодДействияНачало,
	|	УправленческиеНачисления.Результат
	|ПОМЕСТИТЬ ВТУправленческиеНачисления
	|ИЗ
	|	РегистрРасчета.УправленческиеНачисления КАК УправленческиеНачисления
	|ГДЕ
	|	УправленческиеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|	И УправленческиеНачисления.ВидРасчета В
	|			(ВЫБРАТЬ
	|				ВидыРасчета.Ссылка
	|			ИЗ
	|				ВТ_ОтражаемыеНачисления КАК ВидыРасчета)
	|	И (НЕ УправленческиеНачисления.ПоВременнойСхемеМотивации)
	|	И (НЕ УправленческиеНачисления.ФизЛицо В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо
	|				ИЗ
	|					РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&парамПериодРегистрации, Сотрудник.Физлицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							УправленческиеНачисления.ФизЛицо
	|						ИЗ
	|							РегистрРасчета.УправленческиеНачисления КАК УправленческиеНачисления
	|						ГДЕ
	|							УправленческиеНачисления.ПериодРегистрации = &парамПериодРегистрации)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|				ГДЕ
	|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоначислениеПоУправленческомуУчету)))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо";
	Запрос.Выполнить();
	
	// УУДоходыПоВР
	//	Поля:
	//		ОбособленноеПодразделение
	//		Сотрудник
	//		Физлицо
	//		ВидРасчета
	//		ПериодРегистрации
	//		Подразделение
	//		СтатьяЗатрат
	//		НоменклатурнаяГруппа
	//		ОбъектСтроительства
	//		Результат
	//	
	//	Описание:
	//	Данные отражения начислений в упручете
	
	УУДоходыПоВРТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Начисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Физлицо,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	Начисления.ПериодДействия КАК ПериодДействия,
	|	ВЫБОР
	|		КОГДА Начисления.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				И (НЕ СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение ЕСТЬ NULL )
	|			ТОГДА СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
	|		ИНАЧЕ Начисления.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	Начисления.СтатьяЗатрат,
	|	Начисления.НоменклатурнаяГруппа,
	|	Начисления.ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА Начисления.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				И (НЕ СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение ЕСТЬ NULL )
	|			ТОГДА Начисления.Результат / ЕСТЬNULL(СоответствиеПодразделенийКоличество.КоличествоПодразделений, 1)
	|		ИНАЧЕ Начисления.Результат
	|	КОНЕЦ КАК Результат,
	|	Начисления.ЭтоСтатьяЗатратЕНВД
	|ПОМЕСТИТЬ ВТ_УУДоходыПоВР
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОсновныеНачисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|		ОсновныеНачисления.ФизЛицо КАК Физлицо,
	|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|		ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|		ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|		ВЫБОР
	|			КОГДА РаспределениеЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И РаспределениеЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.Подразделение
	|			КОГДА УчетЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И УчетЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.Подразделение
	|			КОГДА Работники.Подразделение ЕСТЬ НЕ NULL 
	|					И Работники.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА Работники.Подразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		КОНЕЦ КАК Подразделение,
	|		ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат))) КАК СтатьяЗатрат,
	|		ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа))) КАК НоменклатурнаяГруппа,
	|		ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства))) КАК ОбъектСтроительства,
	|		ОсновныеНачисления.Результат * ЕСТЬNULL(РаспределениеЗаработкаРаботников.ДоляСпособаОтражения, 100) / 100 КАК Результат,
	|		ВЫБОР
	|			КОГДА (ЕСТЬNULL(ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат)))).ОтнесениеРасходовКДеятельностиЕНВД = ЗНАЧЕНИЕ(Перечисление.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоСтатьяЗатратЕНВД,
	|		ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период,
	|					УчетЗаработкаРаботников.Физлицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|						ПО ОсновныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|							И ОсновныеНачисления.ПериодРегистрации >= УчетЗаработкаРаботников.Период
	|				ГДЕ
	|					ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					УчетЗаработкаРаботников.Физлицо) КАК УчетЗаработкаСрез
	|				ПО УчетЗаработкаРаботников.Физлицо = УчетЗаработкаСрез.Физлицо
	|					И УчетЗаработкаРаботников.Период = УчетЗаработкаСрез.Период
	|			ПО ОсновныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗаработкаРаботников КАК РаспределениеЗаработкаРаботников
	|			ПО ОсновныеНачисления.ПериодРегистрации = РаспределениеЗаработкаРаботников.ПериодРегистрации
	|				И ОсновныеНачисления.ФизЛицо = РаспределениеЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
	|			ПО (СпособыОтраженияЗарплатыВУпрУчете.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(Работники.Период) КАК Период,
	|					Работники.ФизЛицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|						ПО ОсновныеНачисления.ФизЛицо = Работники.ФизЛицо
	|							И ОсновныеНачисления.ПериодРегистрации >= Работники.Период
	|				ГДЕ
	|					ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Работники.ФизЛицо) КАК РаботникиСрез
	|				ПО Работники.ФизЛицо = РаботникиСрез.Физлицо
	|					И Работники.Период = РаботникиСрез.Период
	|			ПО ОсновныеНачисления.ФизЛицо = Работники.ФизЛицо
	|				И (Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|	ГДЕ
	|		ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	|		И ОсновныеНачисления.Результат <> 0
	|		И ОсновныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпрУчете)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДополнительныеНачисления.ОбособленноеПодразделение,
	|		ДополнительныеНачисления.Сотрудник,
	|		ДополнительныеНачисления.ФизЛицо,
	|		ДополнительныеНачисления.ВидРасчета,
	|		ДополнительныеНачисления.ПериодРегистрации,
	|		ДополнительныеНачисления.ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА РаспределениеЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И РаспределениеЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.Подразделение
	|			КОГДА УчетЗаработкаРаботников.Подразделение ЕСТЬ НЕ NULL 
	|					И УчетЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.Подразделение
	|			КОГДА Работники.Подразделение ЕСТЬ НЕ NULL 
	|					И Работники.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА Работники.Подразделение
	|			ИНАЧЕ ЕСТЬNULL(СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|		КОНЕЦ,
	|		ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат))),
	|		ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа, СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа))),
	|		ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства, СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства))),
	|		ДополнительныеНачисления.Результат * ЕСТЬNULL(РаспределениеЗаработкаРаботников.ДоляСпособаОтражения, 100) / 100,
	|		ВЫБОР
	|			КОГДА (ЕСТЬNULL(ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, ЕСТЬNULL(УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат, СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат)))).ОтнесениеРасходовКДеятельностиЕНВД = ЗНАЧЕНИЕ(Перечисление.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ДополнительныеНачисления.ПодразделениеОрганизации
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|			ПО ДополнительныеНачисления.ОбособленноеПодразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Организация
	|				И ДополнительныеНачисления.ПодразделениеОрганизации = СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период,
	|					УчетЗаработкаРаботников.Физлицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|						ПО ДополнительныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|							И ДополнительныеНачисления.ПериодРегистрации >= УчетЗаработкаРаботников.Период
	|				ГДЕ
	|					НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					УчетЗаработкаРаботников.Физлицо) КАК УчетЗаработкаСрез
	|				ПО УчетЗаработкаРаботников.Период = УчетЗаработкаСрез.Период
	|					И УчетЗаработкаРаботников.Физлицо = УчетЗаработкаСрез.Физлицо
	|			ПО ДополнительныеНачисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗаработкаРаботников КАК РаспределениеЗаработкаРаботников
	|			ПО НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = РаспределениеЗаработкаРаботников.ПериодРегистрации
	|				И ДополнительныеНачисления.ФизЛицо = РаспределениеЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
	|			ПО (СпособыОтраженияЗарплатыВУпрУчете.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(Работники.Период) КАК Период,
	|					Работники.ФизЛицо КАК Физлицо
	|				ИЗ
	|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
	|						ПО ДополнительныеНачисления.ФизЛицо = Работники.ФизЛицо
	|							И ДополнительныеНачисления.ПериодРегистрации >= Работники.Период
	|				ГДЕ
	|					НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Работники.ФизЛицо) КАК РаботникиСрез
	|				ПО Работники.Период = РаботникиСрез.Период
	|					И Работники.ФизЛицо = РаботникиСрез.Физлицо
	|			ПО ДополнительныеНачисления.ФизЛицо = Работники.ФизЛицо
	|				И (Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|		И ДополнительныеНачисления.Результат <> 0
	|		И ДополнительныеНачисления.ВидРасчета.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпрУчете)) КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|		ПО Начисления.ОбособленноеПодразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Организация
	|			И Начисления.ПодразделениеОрганизации = СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	|			И (Начисления.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.Организация КАК Организация,
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение) КАК КоличествоПодразделений
	|		ИЗ
	|			РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.Организация,
	|			СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации) КАК СоответствиеПодразделенийКоличество
	|		ПО Начисления.ОбособленноеПодразделение = СоответствиеПодразделенийКоличество.Организация
	|			И Начисления.ПодразделениеОрганизации = СоответствиеПодразделенийКоличество.ПодразделениеОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбособленноеПодразделение,
	|	Сотрудник,
	|	ВидРасчета,
	|	ПериодРегистрации,
	|	ПериодДействия";
	
	Запрос.Текст = УУДоходыПоВРТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗатраты.Зарплата) КАК КатегорияЗатраты,
	|	ОтражениеВУчете.Подразделение КАК Подразделение,
	|	ОтражениеВУчете.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ОтражениеВУчете.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ОтражениеВУчете.ОбъектСтроительства КАК ОбъектСтроительства,
	|	СУММА(ОтражениеВУчете.Сумма) КАК СуммаЗарплата,
	|	СУММА(ВЫБОР
	|			КОГДА ОтражениеВУчете.РаспределятьЕСН
	|				ТОГДА ОтражениеВУчете.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЕСН,
	|	СУММА(ВЫБОР
	|			КОГДА ОтражениеВУчете.РаспределятьНДФЛ
	|				ТОГДА ОтражениеВУчете.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДФЛ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА РаспределениеЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.Подразделение
	|			КОГДА УчетЗаработкаРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.Подразделение
	|			ИНАЧЕ ОтражениеВУпрУчете.Подразделение
	|		КОНЕЦ КАК Подразделение,
	|		ВЫБОР
	|			КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчетеСтатьяЗатрат
	|			КОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.СтатьяЗатрат
	|			ИНАЧЕ СпособыОтраженияЗарплатыВУпрУчете.СтатьяЗатрат
	|		КОНЕЦ КАК СтатьяЗатрат,
	|		ВЫБОР
	|			КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчетеНоменклатурнаяГруппа
	|			КОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.НоменклатурнаяГруппа
	|			ИНАЧЕ СпособыОтраженияЗарплатыВУпрУчете.НоменклатурнаяГруппа
	|		КОНЕЦ КАК НоменклатурнаяГруппа,
	|		ВЫБОР
	|			КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчетеОбъектСтроительства
	|			КОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА РаспределениеЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|			КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|				ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете.ОбъектСтроительства
	|			ИНАЧЕ СпособыОтраженияЗарплатыВУпрУчете.ОбъектСтроительства
	|		КОНЕЦ КАК ОбъектСтроительства,
	|		ОтражениеВУпрУчете.Результат * ЕСТЬNULL(РаспределениеЗаработкаРаботников.ДоляСпособаОтражения, 100) / 100 КАК Сумма,
	|		ЛОЖЬ КАК РаспределятьЕСН,
	|		ЛОЖЬ КАК РаспределятьНДФЛ
	|	ИЗ
	|		ВТУправленческиеНачисления КАК ОтражениеВУпрУчете
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Начисления.ФизЛицо КАК ФизЛицо,
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|				ИЗ
	|					ВТУправленческиеНачисления КАК Начисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|						ПО Начисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|							И Начисления.ПериодДействияНачало >= УчетЗаработкаРаботников.Период
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Начисления.ФизЛицо) КАК СведенияОРаботникахСрез
	|				ПО УчетЗаработкаРаботников.Физлицо = СведенияОРаботникахСрез.ФизЛицо
	|					И УчетЗаработкаРаботников.Период = СведенияОРаботникахСрез.Период
	|			ПО ОтражениеВУпрУчете.ФизЛицо = УчетЗаработкаРаботников.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗаработкаРаботников КАК РаспределениеЗаработкаРаботников
	|			ПО ОтражениеВУпрУчете.ФизЛицо = РаспределениеЗаработкаРаботников.Физлицо
	|				И (РаспределениеЗаработкаРаботников.ПериодРегистрации = &парамПериодРегистрации)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВУпрУчете КАК СпособыОтраженияЗарплатыВУпрУчете
	|			ПО (СпособыОтраженияЗарплатыВУпрУчете.Ссылка = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию))
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|					ТОГДА ОтражениеВУпрУчете.СпособОтраженияВУпрУчете
	|				КОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|					ТОГДА УчетЗаработкаРаботников.СпособОтраженияВУпрУчете
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка)
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпручете)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОтражениеВРеглУчете.Подразделение,
	|		ОтражениеВРеглУчете.СтатьяЗатрат,
	|		ОтражениеВРеглУчете.НоменклатурнаяГруппа,
	|		ОтражениеВРеглУчете.ОбъектСтроительства,
	|		ОтражениеВРеглУчете.Результат / ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Курс, 1) * ЕСТЬNULL(КурсыВалютДляРасчетовСПерсоналом.Кратность, 1),
	|		ВЫБОР
	|			КОГДА ОтражениеВРеглУчете.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ОтражениеВРеглУчете.ВидРасчета.КодДоходаНДФЛ = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	ИЗ
	|		ВТ_УУДоходыПоВР КАК ОтражениеВРеглУчете
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалютДляРасчетовСПерсоналом
	|			ПО (КурсыВалютДляРасчетовСПерсоналом.Период = &парамПериодРегистрации)
	|				И (КурсыВалютДляРасчетовСПерсоналом.Валюта = &парамВалютаУправленческогоУчета)) КАК ОтражениеВУчете
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеВУчете.Подразделение,
	|	ОтражениеВУчете.СтатьяЗатрат,
	|	ОтражениеВУчете.НоменклатурнаяГруппа,
	|	ОтражениеВУчете.ОбъектСтроительства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	СтатьяЗатрат,
	|	НоменклатурнаяГруппа,
	|	ОбъектСтроительства
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ОтражениеДляРаспределения = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из СуммыКРаспределению Цикл
		Если СтрокаТЧ.КатегорияЗатраты = Перечисления.КатегорииЗатраты.Зарплата Тогда
			Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(ОтражениеДляРаспределения,"СуммаЗарплата");
			РезультатыЗарплата = ОбщегоНазначенияЗК.РаспределитьПропорционально(СтрокаТЧ.Сумма, Коэффициенты);
			
		ИначеЕсли СтрокаТЧ.КатегорияЗатраты = Перечисления.КатегорииЗатраты.ЕСН Тогда
			Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(ОтражениеДляРаспределения,"СуммаЕСН");
			РезультатыЕСН = ОбщегоНазначенияЗК.РаспределитьПропорционально(СтрокаТЧ.Сумма, Коэффициенты);
			
		ИначеЕсли СтрокаТЧ.КатегорияЗатраты = Перечисления.КатегорииЗатраты.НДФЛ Тогда
			Коэффициенты = ВыделитьКоэффициентыОтраженияИзМассиваСтрок(ОтражениеДляРаспределения,"СуммаНДФЛ");
			РезультатыНДФЛ = ОбщегоНазначенияЗК.РаспределитьПропорционально(СтрокаТЧ.Сумма, Коэффициенты);
			
		КонецЕсли;
	КонецЦикла;
	
	ВыделятьНалоги = мМетодПланированияУчетаЗатрат = Перечисления.МетодыПланированияУчетаЗатратНаПерсонал.КассовыйМетодСВыделениемНалогов;
	
	Индекс = 0;
	Для Каждого СтрокаОтражения Из ОтражениеДляРаспределения Цикл
		Если РезультатыЗарплата <> Неопределено Тогда
			СтрокаТЧ = ОтражениеВУчете.Добавить();
			ЗаполнитьРеквизитыСтроки(СтрокаТЧ, СтрокаОтражения);
			
			СтрокаТЧ.Сумма = РезультатыЗарплата[Индекс];
		КонецЕсли;
		
		Если РезультатыЕСН <> Неопределено Тогда
			СтрокаТЧ = ОтражениеВУчете.Добавить();
			ЗаполнитьРеквизитыСтроки(СтрокаТЧ, СтрокаОтражения, ВыделятьНалоги, Перечисления.КатегорииЗатраты.ЕСН);
			
			СтрокаТЧ.Сумма = РезультатыЕСН[Индекс];
		КонецЕсли;
		
		Если РезультатыНДФЛ <> Неопределено Тогда
			СтрокаТЧ = ОтражениеВУчете.Добавить();
			ЗаполнитьРеквизитыСтроки(СтрокаТЧ, СтрокаОтражения, ВыделятьНалоги, Перечисления.КатегорииЗатраты.НДФЛ);
			
			СтрокаТЧ.Сумма = РезультатыНДФЛ[Индекс];
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ОтражениеВУчете.Свернуть("КатегорияЗатраты, Подразделение, СтатьяЗатрат, НоменклатурнаяГруппа, ОбъектСтроительства", "Сумма");
	
КонецПроцедуры // ЗаполнитьКассовымМетодом


// Выделяет коэффициенты отражения из массива переданных строк отражения
//
// Параметры
//  МассивСтрокОтражения - массив строк таблицы значений
//  ИмяКолонки - строка - имя колонки таблицы значений, содержащей 
//                 коэффициенты отражения
//
// Возвращаемое значение:
//   массив чисел - коэффициентов отражения
//
Функция ВыделитьКоэффициентыОтраженияИзМассиваСтрок(МассивСтрокОтражения,ИмяКолонки)
	
	Коэффициенты = Новый Массив;
	
	Для каждого СтрокаОтражения Из МассивСтрокОтражения Цикл
		Коэффициенты.Добавить(СтрокаОтражения[ИмяКолонки]);
	КонецЦикла; 
	
	Возврат Коэффициенты
КонецФункции // ВыделитьКоэффициентыОтраженияИзМассиваСтрок()

Процедура ЗаполнитьРеквизитыСтроки(СтрокаПриемник, СтрокаИсточник, ВыделятьНалоги = Ложь, КатегорияЗатраты = Неопределено)
	
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, "КатегорияЗатраты, Подразделение, СтатьяЗатрат, НоменклатурнаяГруппа, ОбъектСтроительства");
	
	Если ВыделятьНалоги Тогда
		СтрокаПриемник.КатегорияЗатраты = КатегорияЗатраты;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мВалютаУправленческогоУчета		= Константы.ВалютаУправленческогоУчета.Получить();
мВалютаРегламентированногоУчета	= Константы.ВалютаРегламентированногоУчета.Получить();

мМетодПланированияУчетаЗатрат	= Константы.МетодПланированияУчетаЗатратНаПерсонал.Получить();

