/////////////////////////////////////////////////////////////////////////////
// Данный модуль предназначен для настройки типовых отчетов для конфигурации
// В нем указывается значение настроек отчета по умолчанию:

// ПолучитьНастройкиОтчетаПоУмолчанию – задает настройки отчета по умолчанию. 
// Параметры:
// МинимальныйПериод          – значение перечисления доступные периоды отчета.
// ПараметрНачалоПериода      – название параметра задающего начало периода в отчете
// ПараметрКонецПериода       - название параметра задающего конец периода в отчете
// ПараметрДата               - название параметра задающего дату, на которую формируется в отчете
// ПараметрыПечатиПоУмолчанию – параметры табличного документ задаваемые по умолчанию при формировании отчета
//
Функция ПолучитьНастройкиОтчетаПоУмолчанию() Экспорт
	
	Настройки = Новый Структура();
	Настройки.Вставить("СоответствиеПериодичностиПараметров", Новый Соответствие);          
	
	ПараметрыПечатиПоУмолчанию 
	= Новый Структура("ПолеСверху, ПолеСлева, ПолеСнизу, ПолеСправа, ОриентацияСтраницы, АвтоМасштаб, МасштабПечати",
	10, 10, 10, 10, ОриентацияСтраницы.Портрет, истина, 100);
	
	Настройки.Вставить("ПараметрыПечатиПоУмолчанию",         ПараметрыПечатиПоУмолчанию); 
	Возврат Настройки;
	
КонецФункции

// ПолучитьЛогическуюСвязьТиповДанных – выборе значения отбора хотелось бы установить отбор по  реквизиту, значение, которого пользователь выбрал в другом отборе отчета. К примеру при установке значения отбора по сотруднику нужно в форму выбора сотрудника установить отбор по организации выбранной в отчете. 
// Для того, что бы настроить связь требуется в возвращаемую таблицу значения добавить строку, в которой
// Тип               – строковое описание типа отбора, при выборе которого будет устанавливать отбор,
// РеквизитПоле      – имя реквизита. по которому будет производится отбор,
// ТипЗначенияОтбора – строковое описание типа отбора значение которого будет подставлено в отбор формы
//
// Пример кода добавляющего строку:
// СтрокаСвязиОтбора = ТаблицаЛогическихСвязейТиповДанных.Добавить();	
// СтрокаСвязиОтбора.Тип  = "СправочникСсылка._ДемоНоменклатура";
// СтрокаСвязиОтбора.РеквизитПоля      = "ВидНоменклатуры";
// СтрокаСвязиОтбора.ТипЗначенияОтбора = "СправочникСсылка._ДемоВидыНоменклатуры";
//
Функция ПолучитьЛогическуюСвязьТиповДанных() Экспорт
	
	ТаблицаЛогическихСвязейТиповДанных = Новый ТаблицаЗначений;
	ТаблицаЛогическихСвязейТиповДанных.Колонки.Добавить("Тип");
	ТаблицаЛогическихСвязейТиповДанных.Колонки.Добавить("РеквизитПоля");
	ТаблицаЛогическихСвязейТиповДанных.Колонки.Добавить("ТипЗначенияОтбора");
	
	// _Демо начало примера
	СтрокаСвязиОтбора = ТаблицаЛогическихСвязейТиповДанных.Добавить();
	СтрокаСвязиОтбора.Тип               = "СправочникСсылка._ДемоНоменклатура";
	СтрокаСвязиОтбора.РеквизитПоля      = "ВидНоменклатуры";
	СтрокаСвязиОтбора.ТипЗначенияОтбора = "СправочникСсылка._ДемоВидыНоменклатуры";
	// _Демо конец примера
	
	Возврат ТаблицаЛогическихСвязейТиповДанных;
	
КонецФункции
