
Функция ПолучитьОбработкуРабочийСтол(ТекущийПользователь) Экспорт
	
	Возврат Обработки.РабочийСтол;
	
КонецФункции
//vvv
#Если ТолстыйКлиентОбычноеПриложение Тогда
Процедура ОткрытьВариантОтчета(Элемент) Экспорт
	
	ЧастиИмениЭлемента = ОбщегоНазначенияЗК.РазложитьСтрокуВМассивПодстрок(Элемент.Имя, "_");
	
	Если ЧастиИмениЭлемента.Количество() > 1 Тогда
		
		ИмяОтчета 			= ЧастиИмениЭлемента[0];
		ИмяВариантаОтчета 	= ЧастиИмениЭлемента[1];
		
		Попытка
			ФункцииОтчетовКлиент.ОткрытьОтчет("Отчет." + ИмяОтчета, ИмяВариантаОтчета);
		Исключение
			РабочийСтол.ОбработкаИсключения(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
