#Если Клиент Тогда 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОХРАНАНИЯ ДАННЫХ

// Функция выполняет проверку необходимости записи набора записей
//
// Параметры
//  НаборЗаписей  - набор записей регистра сведений, существующие значения
//  ТаблицаЗначенийДляЗаписи - таблица значений с новыми значениями
//  СтрокаОтбора - строка, список полей, разделенных зяпятой, в разрезе которых производится проверка
//					и запись набора записей
//
// Возвращаемое значение:
//   Булево   - Ложь, когда набор записей необходимо было записать, и записать набор не удалось
//
Функция ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗначенийДляЗаписи, СтрокаОтбора) Экспорт

	СтруктураПоиска = Новый Структура(СтрокаОтбора);
	
	НаборЗаписей.Прочитать();
	ТаблицаНаборЗаписей = НаборЗаписей.Выгрузить();
	ТаблицаОтборов = ТаблицаНаборЗаписей.Скопировать(,СтрокаОтбора);
	//Если СтрокаОтбора <> "" тогда
	//	ТаблицаОтборов.Свернуть(СтрокаОтбора,);
	//КонецЕсли;
	
	// перепишем данные  во временную таблицу
	ВремТаблицаЗначенийДляЗаписи =  ТаблицаЗначенийДляЗаписи.Скопировать();
	
	Для каждого ЭлементСтруктуры Из СтруктураПоиска Цикл
		ИмяОтбора = ЭлементСтруктуры.Ключ;
		НаборЗаписей.Отбор[ИмяОтбора].Использование = Истина;
	КонецЦикла;

	
	Для каждого СтрокаТЗ Из ТаблицаОтборов Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЗ);
		ТаблицаНовыеЗначения = ВремТаблицаЗначенийДляЗаписи.Скопировать(СтруктураПоиска);
		НадоЗаписать = Не НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(ТаблицаНаборЗаписей.Скопировать(СтруктураПоиска), ТаблицаНовыеЗначения);
		
		Если НадоЗаписать  Тогда
			
			Для каждого ЭлементСтруктуры Из СтруктураПоиска Цикл
				ИмяОтбора = ЭлементСтруктуры.Ключ;
				ЗначениеОтбора = ЭлементСтруктуры.Значение;
				НаборЗаписей.Отбор[ИмяОтбора].Значение = ЗначениеОтбора;
			КонецЦикла;
			
			Если ТаблицаНовыеЗначения.Количество() = 0 Тогда
				НаборЗаписей.Очистить();	
			Иначе
				НаборЗаписей.Загрузить(ТаблицаНовыеЗначения);
			КонецЕсли;	
			
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
			
		КонецЕсли;
		
		// удалим из ВремТаблицаЗначенийДляЗаписи проверенные строки
		МассивСтрок = ВремТаблицаЗначенийДляЗаписи.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаТЗ Из МассивСтрок Цикл
			ВремТаблицаЗначенийДляЗаписи.Удалить(СтрокаТЗ);
		КонецЦикла;
		
	КонецЦикла;
	
	Если ВремТаблицаЗначенийДляЗаписи.Количество() > 0 Тогда
		// остались сведения, которых не было, запишем
		Для каждого СтрокаТЗ Из ВремТаблицаЗначенийДляЗаписи Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЗ);
			ТаблицаНовыеЗначения = ВремТаблицаЗначенийДляЗаписи.Скопировать(СтруктураПоиска);
			
			Для каждого ЭлементСтруктуры Из СтруктураПоиска Цикл
				ИмяОтбора = ЭлементСтруктуры.Ключ;
				ЗначениеОтбора = ЭлементСтруктуры.Значение;
				НаборЗаписей.Отбор[ИмяОтбора].Значение = ЗначениеОтбора;
			КонецЦикла;
			
			НаборЗаписей.Загрузить(ТаблицаНовыеЗначения);
			
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция записывает измененые константы, список констант
// получаетсяиз строковой переменной формы обработки мСтрокаКонстант
//
//  ФормаОбработки - форма обработки
//
// Возвращаемое значение:
//   Булево   - Ложь, когда есть изменные константы, и записать набор констант не удалось
//
Функция ЗаписатьКонстанты(ФормаОбработки) Экспорт

	Если ЗначениеЗаполнено(ФормаОбработки.мСтрокаКонстант) Тогда
		//есть константы, которые могли измениться
		
		// подготовим массив констант, значения которых необходимо записать
		КоллекцияКонстантДляПроверки = Новый Структура(ФормаОбработки.мСтрокаКонстант);
		ЗаполнитьЗначенияСвойств(КоллекцияКонстантДляПроверки, ФормаОбработки);
		МассивИзмененныхКонстант = ОбщегоНазначения.СоздатьМассивИзмененныхКонстант(КоллекцияКонстантДляПроверки);
		
		// запишем изменения
		Если МассивИзмененныхКонстант.Количество() > 0 Тогда
			
			// есть константы, значение которых изменилось, запишем их
			НаборКонстант = Константы.СоздатьНабор(МассивИзмененныхКонстант);
			СтрокаСвойств = "";
			Для каждого Константа Из МассивИзмененныхКонстант Цикл
				СтрокаСвойств = СтрокаСвойств + Константа.Имя + ",";
			КонецЦикла;
			ЗаполнитьЗначенияСвойств(НаборКонстант, ФормаОбработки, СтрокаСвойств);
			
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборКонстант) Тогда
				Возврат Ложь
			КонецЕсли;
			
			Для каждого Константа Из МассивИзмененныхКонстант Цикл
				ОбщегоНазначения.УстановитьЗначениеПеременной("гл" + Константа.Имя, глОбщиеЗначения, Константы[Константа.Имя].Получить() , Истина);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

// Функция записывает изменненые данные в регистры сведений
// АлгоритмыРасчетов, РазмерыПособий, ВычетыНДФЛ
Функция ЗаписатьОбщиеДанные(ФормаОбработки) Экспорт

	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.АлгоритмыРасчетов.Видимость Тогда
		
		НадоЗаписать = Ложь;
		
		НаборЗаписей = РегистрыСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.УдержаниеЗаОтпускУменьшаетНалоги 		= ФормаОбработки.УдержаниеЗаОтпускУменьшаетНалоги;
            НоваяЗапись.АлгоритмРасчетаЧасовойТарифнойСтваки    = ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки;
			НоваяЗапись.ПорядокПересчетаМесячнойСтавкиВЧасовую 	= ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую;
			НадоЗаписать = Истина;
			
		ИначеЕсли НаборЗаписей[0].ПорядокПересчетаМесячнойСтавкиВЧасовую <> ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую 
			ИЛИ НаборЗаписей[0].АлгоритмРасчетаЧасовойТарифнойСтваки    <> ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки
			ИЛИ НаборЗаписей[0].УдержаниеЗаОтпускУменьшаетНалоги <> ФормаОбработки.УдержаниеЗаОтпускУменьшаетНалоги Тогда
	        НаборЗаписей[0].АлгоритмРасчетаЧасовойТарифнойСтваки    = ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки;
			НаборЗаписей[0].ПорядокПересчетаМесячнойСтавкиВЧасовую 	= ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую;
			НаборЗаписей[0].УдержаниеЗаОтпускУменьшаетНалоги 		= ФормаОбработки.УдержаниеЗаОтпускУменьшаетНалоги;
			НадоЗаписать = Истина;
			
		КонецЕсли;
		
		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.СтраховыеВзносы.Видимость
		и Не ФормаОбработки.ЭлементыФормы.СтавкиОтчисленийСФОТиЗП.ТолькоПросмотр Тогда
		
				
		НаборЗаписей = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейСтавкиОтчисленийСФОТиЗП, "Период, ВидОтчисления") Тогда
			Возврат Ложь;	
		КонецЕсли;

		//НаборЗаписей = РегистрыСведений.ТарифыВзносовНаППС.СоздатьНаборЗаписей();
		//Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейТарифыВзносовНаППС, "Период, ВидДеятельности") Тогда
		//	Возврат Ложь;	
		//КонецЕсли;

		ТаблицаТарифыВзносовНаППС = ТарифыВзносовНаППС.Выгрузить();
		ТаблицаТарифыВзносовНаППС.Колонки.Удалить("НомерСтроки");
		ВремТаблица = ТаблицаТарифыВзносовНаППС.Скопировать();
		ВремТаблица.Свернуть("ВидДеятельности");
		СтруктураПоиска = Новый Структура("ВидДеятельности");
		
		Для каждого СтрокаВТ Из ВремТаблица Цикл
			
			СтруктураПоиска = Новый Структура("ВидДеятельности", СтрокаВТ.ВидДеятельности);
			МассивСтрок = ТаблицаТарифыВзносовНаППС.НайтиСтроки(СтруктураПоиска);
			ТаблицаТарифыВзносовНаППСПоВидуДеятильности = ТаблицаТарифыВзносовНаППС.Скопировать(МассивСтрок);
			
			// регистр сведений СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев
			НаборЗаписей = РегистрыСведений.ТарифыВзносовНаППС.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидДеятельности.Установить(СтрокаВТ.ВидДеятельности);
			
			Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаТарифыВзносовНаППСПоВидуДеятильности, "Период") Тогда
				Возврат Ложь;	
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетЗарплаты.Видимость
		и Не ФормаОбработки.ЭлементыФормы.РазмерыПараметровДляРасчетаРБ.ТолькоПросмотр Тогда
		
	
				
		НаборЗаписей = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ, "Период, ВидПараметра") Тогда
			Возврат Ложь;	
		КонецЕсли;
		
	КонецЕсли;

	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РазмерыПособий.Видимость
		и Не ФормаОбработки.ЭлементыФормы.СписокГосударственныеПособия.ТолькоПросмотр Тогда
		
		// максимальные размеры пособий по нетрудоспособности
				
		СтруктураПоиска = Новый Структура("Период");
		СтруктураПоиска.Вставить("Период", ФормаОбработки.ДатаРазмеровОграниченияПособий);
		МассивСтрок = ТаблицаЗаписейОграниченияПособия.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда
			МассивСтрок[0].Размер = ФормаОбработки.ПособиеПоВременнойНетрудоспособности;
			МассивСтрок[0].РазмерПоБеременности = ФормаОбработки.ПособиеПоБеременности;
		Иначе
			// добавим значение из формы в таблицу
			НоваяСтрока = ТаблицаЗаписейОграниченияПособия.Добавить();
			НоваяСтрока.Размер = ФормаОбработки.ПособиеПоВременнойНетрудоспособности;
			НоваяСтрока.РазмерПоБеременности = ФормаОбработки.ПособиеПоБеременности;
			НоваяСтрока.Период = ФормаОбработки.ДатаРазмеровОграниченияПособий;
			ТаблицаЗаписейОграниченияПособия.Сортировать("Период");
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейОграниченияПособия, "Период") Тогда
			Возврат Ложь;	
		КонецЕсли;	
		
		//прочие государственные пособия 
		НаборЗаписей = РегистрыСведений.ГосударственныеПособия.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейГосударственныеПособия, "Период, ВидПособия") Тогда
			Возврат Ложь;	
		КонецЕсли;
		
	КонецЕсли;

	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетНДФЛ.Видимость
		и Не ФормаОбработки.ЭлементыФормы.ШкалаПодоходногоНалога.ТолькоПросмотр Тогда
		
		НаборЗаписей = РегистрыСведений.ШкалаПодоходногоНалога.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейШкалаПодоходногоНалога, "Период,НижнийПредел,ВерхнийПредел") Тогда
			Возврат Ложь;	
		КонецЕсли;
		
	КонецЕсли;

	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.ВычетыНДФЛ.Видимость
		и Не ФормаОбработки.ЭлементыФормы.НДФЛРазмерВычетов.ТолькоПросмотр Тогда
		
		НаборЗаписей = РегистрыСведений.НДФЛВычетыПоДоходам.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейНДФЛВычетыПоДоходам, "Период, КодДохода") Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.НДФЛРазмерВычетов.СоздатьНаборЗаписей();
		Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаЗаписейНДФЛРазмерВычетов, "Период, КодВычета") Тогда
			Возврат Ложь;	
		КонецЕсли;
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

// Функция записывает изменненые данные в регистры сведений
// УчетнаяПолитикаПоПерсоналуОрганизаций, УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций, УчетнаяПолитикаНалоговыйУчет
// УчетнаяПолитикаПоЕСН, СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев
Функция ЗаписатьДанныеПоОрганизации(ФормаОбработки) Экспорт

	НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации = Ложь;
	НадоОбновитьУчетнаяПолитикаОтраженияЗарплатыВУчете = Ложь;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.КадровыйУчет.Видимость и 
		ФормаОбработки.ЭлементыФормы.ПроверкаШтатногоРасписания.Доступность Тогда
		
		НадоЗаписать = Ложь;
		
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций);
		НоваяЗапись.Организация = Организация;

		НаборЗаписейДляПроверки = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписейДляПроверки.Отбор.Организация.Установить(Организация);
		НаборЗаписейДляПроверки.Прочитать();
		НадоЗаписать = Не НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(НаборЗаписейДляПроверки.Выгрузить(), НаборЗаписей.Выгрузить());
				
		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
			НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетЗарплаты.Видимость Тогда
		
		НадоЗаписать = Ложь;
		
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты);
		НоваяЗапись.Организация = Организация;

		НаборЗаписейДляПроверки = РегистрыСведений.УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписейДляПроверки.Отбор.Организация.Установить(Организация);
		НаборЗаписейДляПроверки.Прочитать();
		НадоЗаписать = Не НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(НаборЗаписейДляПроверки.Выгрузить(), НаборЗаписей.Выгрузить());
				
		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
			НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации = Истина;
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.ТарифныеСтавкиПервогоРазряда.Видимость
		и Не ФормаОбработки.ЭлементыФормы.ТарифныеСтавкиПервогоРазрядаОрганизаций.ТолькоПросмотр Тогда
		
		ТаблицаТарифныеСтавкиПервогоРазрядаОрганизаций = ТарифныеСтавкиПервогоРазрядаОрганизаций.Выгрузить();
		ТаблицаТарифныеСтавкиПервогоРазрядаОрганизаций.Колонки.Удалить("НомерСтроки");
		ВремТаблица = ТаблицаТарифныеСтавкиПервогоРазрядаОрганизаций.Скопировать();
		ВремТаблица.Свернуть("Организация");
		СтруктураПоиска = Новый Структура("Организация");
		
		Для каждого СтрокаВТ Из ВремТаблица Цикл
			
			СтруктураПоиска = Новый Структура("Организация", СтрокаВТ.Организация);
			МассивСтрок = ТаблицаТарифныеСтавкиПервогоРазрядаОрганизаций.НайтиСтроки(СтруктураПоиска);
			ТаблицаТарифныеСтавкиПервогоРазрядаОрганизацийПоОрганизации = ТаблицаТарифныеСтавкиПервогоРазрядаОрганизаций.Скопировать(МассивСтрок);
			
			// регистр сведений 
			НаборЗаписей = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(СтрокаВТ.Организация);
			
			Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаТарифныеСтавкиПервогоРазрядаОрганизацийПоОрганизации, "Период,ТарифнаяСтавка") Тогда
				Возврат Ложь;	
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;

	
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.СтраховыеВзносы.Видимость
		и Не ФормаОбработки.ЭлементыФормы.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ТолькоПросмотр Тогда
		
		ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев = СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Выгрузить();
		ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Колонки.Удалить("НомерСтроки");
		ВремТаблица = ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Скопировать();
		ВремТаблица.Свернуть("Организация");
		СтруктураПоиска = Новый Структура("Организация");
		
		Для каждого СтрокаВТ Из ВремТаблица Цикл
			
			СтруктураПоиска = Новый Структура("Организация", СтрокаВТ.Организация);
			МассивСтрок = ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.НайтиСтроки(СтруктураПоиска);
			ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПоОрганизации = ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Скопировать(МассивСтрок);
			
			// регистр сведений СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев
			НаборЗаписей = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(СтрокаВТ.Организация);
			
			Если Не ПроверитьИЗаписатьНаборЗаписей(НаборЗаписей, ТаблицаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПоОрганизации, "Период") Тогда
				Возврат Ложь;	
			КонецЕсли;
			
		КонецЦикла;
		
		НадоЗаписать = Ложь;
		
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты);
		НоваяЗапись.Организация = Организация;

		НаборЗаписейДляПроверки = РегистрыСведений.УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписейДляПроверки.Отбор.Организация.Установить(Организация);
		НаборЗаписейДляПроверки.Прочитать();
		НадоЗаписать = Не НастройкаПравДоступа.СравнитьТаблицыНаборовЗаписей(НаборЗаписейДляПроверки.Выгрузить(), НаборЗаписей.Выгрузить());
				
		Если НадоЗаписать Тогда
			Если Не ОбщегоНазначения.ЗаписатьНабор(НаборЗаписей) Тогда
				Возврат Ложь
			КонецЕсли;	
			НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации = Истина;
		КонецЕсли;

		
	КонецЕсли;

		
	Если НадоОбновитьУчетнаяПолитикаПоПерсоналуОрганизации Тогда
		глЗначениеПеременнойУстановить("глУчетнаяПолитикаПоПерсоналуОрганизации", ОбщегоНазначенияЗК.ЗаполнениеУчетнойПолитикиПоПерсоналуОрганизации(), ИСТИНА);
	КонецЕсли;
	
	Если НадоОбновитьУчетнаяПолитикаОтраженияЗарплатыВУчете Тогда
		глЗначениеПеременнойУстановить("УчетнаяПолитикаОтраженияЗарплатыВУчете", ОбщегоНазначенияПереопределяемый.ЗаполнениеУчетнойПолитикиНалоговомуУчету(), ИСТИНА);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ 

Процедура ЗначениеПеречисленияНачалоВыбора(ЭтаФорма, МенеджерПеречисление, Элемент, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	СписокДляВыбора = Новый СписокЗначений;
	Для каждого ЗначениеПеречисления Из МенеджерПеречисление Цикл
		СписокДляВыбора.Добавить(ЗначениеПеречисления);
	КонецЦикла;
	
	ЭлементСписка = ЭтаФорма.ВыбратьИзСписка(СписокДляВыбора,Элемент,СписокДляВыбора.НайтиПоЗначению(Элемент.Значение));
	Если ЭлементСписка <> Неопределено и Элемент.Значение <> ЭлементСписка.Значение Тогда
		Элемент.Значение = ЭлементСписка.Значение;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;	

КонецПроцедуры

Процедура ПоказатьИсториюПараметровДляРасчетаРБ(Элемент, ФормаОбработки) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе 
		ВидПараметра = Элемент.ТекущиеДанные.ВидПараметра;
		ОткрытьФормуИсторииЗначений(ФормаОбработки, ФормаОбработки.ЭлементыФормы.РазмерыПараметровДляРасчетаРБ, "РазмерыПараметровДляРасчетаРБ", "ВидПараметра", ВидПараметра, "История праметра : " + ВидПараметра, ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ, Элемент.ТолькоПросмотр);
	КонецЕсли;	

КонецПроцедуры

Процедура ПоказатьИсториюИзмененияОтчисленийСФОТиЗП(Элемент, ФормаОбработки) Экспорт
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе 
		ВидОтчисления = Элемент.ТекущиеДанные.ВидОтчисления;
		ОткрытьФормуИсторииЗначений(ФормаОбработки, ФормаОбработки.ЭлементыФормы.СтавкиОтчисленийСФОТиЗП, "СтавкиОтчисленийСФОТиЗП", "ВидОтчисления", ВидОтчисления, "История отчисления с ФОТ и ЗП: " + ВидОтчисления, ТаблицаЗаписейСтавкиОтчисленийСФОТиЗП, Элемент.ТолькоПросмотр);
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ПоказатьИсториюИзмененияТарифовВзносовНаППС(Элемент, ФормаОбработки) Экспорт
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе 
		ВидДеятельности = Элемент.ТекущиеДанные.ВидДеятельности;
		ОткрытьФормуИсторииЗначений(ФормаОбработки, ФормаОбработки.ЭлементыФормы.ТарифыВзносовНаППС, "ТарифыВзносовНаППС", "ВидДеятельности", ВидДеятельности, "История тарифов взносов на ППС: " + ВидДеятельности, ТаблицаЗаписейТарифыВзносовНаППС, Элемент.ТолькоПросмотр);
	КонецЕсли;	

	
КонецПроцедуры


Процедура ПоказатьИсториюИзмененияСкидкиКДоходамСтраховыеВзносы(Элемент, ФормаОбработки) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе
		ВидДохода = Элемент.ТекущиеДанные.ВидДохода;
		ОткрытьФормуИсторииЗначений(ФормаОбработки, ФормаОбработки.ЭлементыФормы.СтраховыеВзносыСкидкиКДоходам, "СтраховыеВзносыСкидкиКДоходам", "ВидДохода", ВидДохода, "История изменения скидок к доходу: " + ВидДохода, ТаблицаЗаписейСтраховыеВзносыСкидкиКДоходам, Элемент.ТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПоказатьИсториюИзмененияВычетыНДФЛКДоходам(Элемент, ФормаОбработки) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе
		КодДохода = Элемент.ТекущиеДанные.КодДохода;
		ОткрытьФормуИсторииЗначений(ФормаОбработки, ФормаОбработки.ЭлементыФормы.НДФЛВычетыПоДоходам, "НДФЛВычетыПоДоходам", "КодДохода", КодДохода, "История изменения вычетов к доходу: " + КодДохода, ТаблицаЗаписейНДФЛВычетыПоДоходам, Элемент.ТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьИсториюИзмененияВычетыНДФЛ(Элемент, ФормаОбработки) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе
		КодВычета = Элемент.ТекущиеДанные.КодВычета;
		ОткрытьФормуИсторииЗначений(ФормаОбработки, ФормаОбработки.ЭлементыФормы.НДФЛВычетыПоДоходам, "НДФЛРазмерВычетов", "КодВычета", КодВычета, "История изменения вычета:  " + КодВычета, ТаблицаЗаписейНДФЛРазмерВычетов, Элемент.ТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьИсториюИзмененияШкалыПодоходногоНалога(Элемент, ФормаОбработки) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	Иначе
		Период = Элемент.ТекущиеДанные.Период;
		ОткрытьФормуИсторииШкалыПодоходногоНалога(ФормаОбработки, ФормаОбработки.ЭлементыФормы.ШкалаПодоходногоНалога, "ШкалаПодоходногоНалога", Период, "История изменения шкалы подоходного налога:  ", ТаблицаЗаписейШкалаПодоходногоНалога, Элемент.ТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуИсторииШкалыПодоходногоНалога(ФормаОбработки, КлючУникальности, ИмяТаблицыИсторииЗначений, ПараметрИсторииЗначений, Заголовок, ТаблицаИстории, РежимТолькоПросмотр = Истина) Экспорт

	
	ТаблицаИсторииЗначений = ТаблицаИстории.Скопировать();
		
	ФормаИстории = ПолучитьФорму("ФормаИстории", ФормаОбработки, );
	ФормаИстории.ИмяТаблицыИсторииЗначений = ИмяТаблицыИсторииЗначений;
	ФормаИстории.Заголовок = Заголовок;
	ФормаИстории.ПараметрИсторииЗначений   = ПараметрИсторииЗначений;

	ФормаИстории.ТолькоПросмотр = РежимТолькоПросмотр;
	ФормаИстории.Открыть();	

КонецПроцедуры



Функция ПолучитьПредставлениеПериода(ДатаПериода) Экспорт
	
	ПериодСтрокой = РаботаСДиалогами.ДатаКакМесяцПредставление(ДатаПериода);
	УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ПериодСтрокой, 2, Перечисления.ПолФизическихЛиц.Мужской, ПериодСтрокой);
	Возврат ПериодСтрокой;
	
КонецФункции

Процедура УстановитьЗаголовокНадписьПорядокРасчетаЧасовойСтавки(ФормаОбработки) Экспорт
	
	ТекстЗаголовка = "Пересчет месячного оклада в часовую ставку применяется для расчета оплаты сверхурочных часов, ночных часов и прочих часовых доплат." + Символы.ПС;
	Если ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую = Перечисления.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоМесячнойНормеВремени Тогда
		ТекстЗаголовка = ТекстЗаголовка + "Часовая ставка будет рассчитана путем деления оклада на количество рабочих часов в месяце по графику работы сотрудника.";	
	ИначеЕсли ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую = Перечисления.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце Тогда
		ТекстЗаголовка = ТекстЗаголовка + "Часовая ставка будет рассчитана путем деления оклада на среднее количество часов в месяце за год.";
	КонецЕсли;	
	ФормаОбработки.ЭлементыФормы.НадписьПорядокРасчетаЧасовойСтавки.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры 

Процедура УстановитьЗаголовокНадписьАлгоритмРасчетаЧасовойТарифнойСтавки(ФормаОбработки) Экспорт
	
	ТекстЗаголовка = "Расчет часовой тарифной ставки осуществляется в кадровых документах." + Символы.ПС;
	Если ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки = Перечисления.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки.РасчетЧасовойТарифгойСтавкиОтДолжностногоОклада Тогда
		ТекстЗаголовка = ТекстЗаголовка + "Часовая тарифная ставка расчитывается путем деления месяной тарифной ставки на среднемесячное количество часов.";	
	ИначеЕсли ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки = Перечисления.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки.РасчетЧасовойТарифгойСтавкиОтТарифнойСтавкиПоЕТС Тогда
		ТекстЗаголовка = ТекстЗаголовка + "Часовая тарифная ставка расчитывается путем деления тарифной ставки по ЕТС на среднемесячное количество часов.";
	КонецЕсли;	
	ФормаОбработки.ЭлементыФормы.НадписьАлгоритмРасчетаЧасовойТарифнойСтавки.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры 

Процедура УстановитьЗаголовокНадписьУдержаниеЗаОтпускУменьшаетНалогиИнформация(ФормаОбработки) Экспорт
	
	Если ФормаОбработки.УдержаниеЗаОтпускУменьшаетНалоги Тогда
		ТекстЗаголовка = "Удержание за неотработанный отпуск при увольнении будет регистрироваться как сторно начисление.";
	Иначе
		ТекстЗаголовка = "Удержание за неотработанный отпуск при увольнении будет регистрироваться как «обычное» удержание.";
	КонецЕсли;	
	ФормаОбработки.ЭлементыФормы.НадписьУдержаниеЗаОтпускУменьшаетНалогиИнформация.Заголовок = ТекстЗаголовка;	
	
КонецПроцедуры

Процедура ФормаОбработкиУплачиватьДобровольныеВзносыВФССПриИзменении(Элемент, ФормаОбработки) Экспорт

	ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаНалоговыйУчет, ФормаОбработки);	

КонецПроцедуры

Процедура ОбработатьИзменениеПериодНалоговыйУчет(ФормаОбработки) Экспорт
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(ФормаОбработки.ПериодНалоговыйУчет, ФормаОбработки.ДатаНачалаНалоговыйУчет);
	
	ДатаОкончания = "";
	Для каждого СтрокаТаблицы Из ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет Цикл
		Если СтрокаТаблицы.Период > ФормаОбработки.ДатаНачалаНалоговыйУчет Тогда
			ДатаОкончания = СтрокаТаблицы.Период;
			Прервать;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаНалоговыйУчет, СтрокаТаблицы);
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаНалоговыйУчет);
		НадписьОкончанияДействия = "по " + РаботаСДиалогами.ДатаКакМесяцПредставление(ДатаОкончания);
	Иначе
		НадписьОкончанияДействия = "";
	КонецЕсли;
	ФормаОбработки.ЭлементыФормы.НадписьОкончанияДействияНУ.Заголовок = НадписьОкончанияДействия;
	
КонецПроцедуры

Процедура ОбработатьИзменениеПериодаЕСН(ФормаОбработки) Экспорт
	
	ДатаПериодЕСН = Дата(ФормаОбработки.ПериодЕСН,1,1);
	
	ДатаОкончания = "";
	Для каждого СтрокаТаблицы Из ТаблицаЗаписейУчетнаяПолитикаЕСН Цикл
		Если СтрокаТаблицы.Период > ДатаПериодЕСН Тогда
			ДатаОкончания = СтрокаТаблицы.Период;
			Прервать;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоЕСН, СтрокаТаблицы);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоЕСН);
		НадписьОкончанияДействия = "по " + Формат(Год(ДатаОкончания), "ЧГ=") + " год";
	Иначе
		НадписьОкончанияДействия = "";
	КонецЕсли;
	ФормаОбработки.ЭлементыФормы.НадписьОкончанияДействияЕСН.Заголовок = НадписьОкончанияДействия;
	
КонецПроцедуры

Процедура ОбработатьИзменениеПериодаНДФЛ(ФормаОбработки) Экспорт
	
	ДатаПериодНДФЛ = Дата(ФормаОбработки.ПериодНДФЛ,1,1);
	
	ДатаОкончания = "";
	Для каждого СтрокаТаблицы Из ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ Цикл
		Если СтрокаТаблицы.Период > ДатаПериодНДФЛ Тогда
			ДатаОкончания = СтрокаТаблицы.Период;
			Прервать;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоНДФЛ, СтрокаТаблицы);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоНДФЛ);
		НадписьОкончанияДействия = "по " + Формат(Год(ДатаОкончания), "ЧГ=") + " год";
	Иначе
		НадписьОкончанияДействия = "";
	КонецЕсли;
	ФормаОбработки.ЭлементыФормы.НадписьОкончанияДействияНДФЛ.Заголовок = НадписьОкончанияДействия;
	
КонецПроцедуры

Процедура ОткрытьФормуИсторииЗначений(ФормаОбработки, КлючУникальности, ИмяТаблицыИсторииЗначений, ИмяПараметраИсторииЗначений, ПараметрИсторииЗначений, Заголовок, ТаблицаИстории, РежимТолькоПросмотр = Истина) Экспорт

	Если ИмяПараметраИсторииЗначений = Неопределено Тогда
		ТаблицаИсторииЗначений = ТаблицаИстории.Скопировать();
	Иначе
		СтруктураПоиска = Новый Структура(ИмяПараметраИсторииЗначений, ПараметрИсторииЗначений);
		МассивСтрок = ТаблицаИстории.НайтиСтроки(СтруктураПоиска);
		ТаблицаИсторииЗначений = ТаблицаИстории.Скопировать(МассивСтрок);
	КонецЕсли;
	
	ФормаИстории = ПолучитьФорму("ФормаИстории", ФормаОбработки, );
	ФормаИстории.ИмяТаблицыИсторииЗначений = ИмяТаблицыИсторииЗначений;
	ФормаИстории.ПараметрИсторииЗначений   = ПараметрИсторииЗначений;
	ФормаИстории.Заголовок = Заголовок;
	ФормаИстории.ТолькоПросмотр = РежимТолькоПросмотр;
	ФормаИстории.Открыть();	

КонецПроцедуры

Процедура ОбработатьОкончаниеРедактирвоанияСтрокиТабличногоПоля(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, СтруктураТекущиеДанные, ТабицаДанных)Экспорт

	Если НоваяСтрока и ОтменаРедактирования Тогда
		Возврат;
	ИначеЕсли Элемент.ТекущиеДанные <> Неопределено и (Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период)
		или (Элемент.Колонки.Найти("Организация")<> Неопределено и Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Организация)))Тогда 
		Отказ = Истина;
		Возврат;
	ИначеЕсли ОтменаРедактирования Тогда
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, СтруктураТекущиеДанные);
	Иначе
		
		Если Элемент.Колонки.Найти("Организация") = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Период", Элемент.ТекущиеДанные.Период);
		Иначе
			СтруктураПоиска = Новый Структура("Период, Организация", Элемент.ТекущиеДанные.Период, Элемент.ТекущиеДанные.Организация);	
		КонецЕсли;	
		
		Если Элемент.Колонки.Найти("ВидДеятельности") <> Неопределено  Тогда
			СтруктураПоиска = Новый Структура("Период, ВидДеятельности", Элемент.ТекущиеДанные.Период, Элемент.ТекущиеДанные.ВидДеятельности);	
		КонецЕсли;
		
		Если Элемент.Колонки.Найти("ТарифнаяСтавка") <> Неопределено  Тогда
			СтруктураПоиска = Новый Структура("Период, ТарифнаяСтавка", Элемент.ТекущиеДанные.Период, Элемент.ТекущиеДанные.ТарифнаяСтавка);	
		КонецЕсли;
		
		МассивСтрок = ТабицаДанных.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 1 Тогда
			Предупреждение("Значение на дату: " + Формат(Элемент.ТекущиеДанные.Период, "ДФ=dd.MM.yyyy") + " уже задано!");
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Элемент.Колонки.Найти("Организация") = Неопределено Тогда
		ТабицаДанных.Сортировать("Период");
	Иначе
		ТабицаДанных.Сортировать("Организация,Период");	
	КонецЕсли;	

КонецПроцедуры

Процедура ФормаОбработкиМинимальнаяОплатаТрудаРФДатаПриИзменении(Элемент, ФормаОбработки) Экспорт

	Элемент.Значение = НачалоМесяца(Элемент.Значение);
	ДатаОкончания = "";
	НовоеЗначениеМинимальнаяОплатаТрудаРФ = 0;
	Для каждого СтрокаТаблицы Из ТаблицаЗаписейМРОТ Цикл
		Если СтрокаТаблицы.Период > ФормаОбработки.МинимальнаяОплатаТрудаРФДата Тогда
			ДатаОкончания = СтрокаТаблицы.Период;
			Прервать;
		КонецЕсли;
		НовоеЗначениеМинимальнаяОплатаТрудаРФ = СтрокаТаблицы.Размер;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ФормаОбработки.МинимальнаяОплатаТрудаРФ = НовоеЗначениеМинимальнаяОплатаТрудаРФ;
		НадписьОкончанияДействия = "по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	Иначе
		НадписьОкончанияДействия = "";
	КонецЕсли;
	ФормаОбработки.ЭлементыФормы.НадписьОкончанияДействияМРОТ.Заголовок = НадписьОкончанияДействия;

КонецПроцедуры

Процедура ФормаОбработкиСтавкаРефинансированияЦБДатаПриИзменении(Элемент, ФормаОбработки) Экспорт

	ДатаОкончания = "";
	НовоеЗначениеСтавкаРефинансированияЦБ = 0;
	Для каждого СтрокаТаблицы Из ТаблицаЗаписейСтавкиРефинансированияЦБ Цикл
		Если СтрокаТаблицы.Период > ФормаОбработки.СтавкаРефинансированияЦБДата Тогда
			ДатаОкончания = СтрокаТаблицы.Период;
			Прервать;
		КонецЕсли; 
		НовоеЗначениеСтавкаРефинансированияЦБ = СтрокаТаблицы.Размер;
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ФормаОбработки.СтавкаРефинансированияЦБ = НовоеЗначениеСтавкаРефинансированияЦБ;
		НадписьОкончанияДействия = "по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	Иначе
		НадписьОкончанияДействия = "";
	КонецЕсли;
	ФормаОбработки.ЭлементыФормы.НадписьОкончанияДействияСтавкиРефинансирования.Заголовок = НадписьОкончанияДействия;

КонецПроцедуры  

Процедура ФормаОбработкиДатаРазмеровОграниченияПособийПриИзменении(Элемент, ФормаОбработки) Экспорт

	Элемент.Значение = НачалоМесяца(Элемент.Значение);
	ДатаОкончания = "";
	НовоеЗначениеПособиеПоВременнойНетрудоспособности = 0;
	НовоеЗначениеПособиеПоБеременности = 0;
	Для каждого СтрокаТаблицы Из ТаблицаЗаписейОграниченияПособия Цикл
		Если СтрокаТаблицы.Период > ФормаОбработки.ДатаРазмеровОграниченияПособий Тогда
			ДатаОкончания = СтрокаТаблицы.Период;
			Прервать;
		КонецЕсли;
		НовоеЗначениеПособиеПоВременнойНетрудоспособности = СтрокаТаблицы.Размер;
		НовоеЗначениеПособиеПоБеременности = СтрокаТаблицы.РазмерПоБеременности;
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ФормаОбработки.ПособиеПоВременнойНетрудоспособности = НовоеЗначениеПособиеПоВременнойНетрудоспособности;
		ФормаОбработки.ПособиеПоБеременности = НовоеЗначениеПособиеПоБеременности;
		НадписьОкончанияДействия = "по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	Иначе
		НадписьОкончанияДействия = "";
	КонецЕсли;
	ФормаОбработки.ЭлементыФормы.НадписьОкончанияДействияОграниченияПособий.Заголовок = НадписьОкончанияДействия;

КонецПроцедуры

Процедура ФормаОбработкиСтавкиФССНСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, ФормаОбработки) Экспорт

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		Если Не Элемент.Колонки.Организация.Видимость Тогда
			Элемент.ТекущиеДанные.Организация = Организация;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ФормаОбработки.мСтавкиФССНСДоРедактирования, Элемент.ТекущиеДанные);	

КонецПроцедуры

Процедура ФормаОбработкиСтавкиФССНСПериодПриИзменении(Элемент, ФормаОбработки) Экспорт

	Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		Элемент.Значение = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если Элемент.Значение <> НачалоМесяца(Элемент.Значение) Тогда
		Элемент.Значение = НачалоМесяца(Элемент.Значение);
	КонецЕсли;

КонецПроцедуры

Процедура ФормаОбработкиСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, ФормаОбработки) Экспорт

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		Если Не Элемент.Колонки.Организация.Видимость Тогда
			Элемент.ТекущиеДанные.Организация = Организация;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ФормаОбработки.мСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевДоРедактирования, Элемент.ТекущиеДанные);	

КонецПроцедуры

Процедура ФормаОбработкиСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодПриИзменении(Элемент, ФормаОбработки) Экспорт

	Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		Элемент.Значение = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если Элемент.Значение <> НачалоМесяца(Элемент.Значение) Тогда
		Элемент.Значение = НачалоМесяца(Элемент.Значение);
	КонецЕсли;

КонецПроцедуры


Процедура ФормаОбработкиТарифныеСтавкиПервогоРазрядаОрганизацийПериодПриИзменении(Элемент, ФормаОбработки) Экспорт
	
	Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		Элемент.Значение = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если Элемент.Значение <> НачалоМесяца(Элемент.Значение) Тогда
		Элемент.Значение = НачалоМесяца(Элемент.Значение);
	КонецЕсли;

	
КонецПроцедуры

Процедура ФормаОбработкиТарифныеСтавкиПервогоРазрядаОрганизацийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, ФормаОбработки) Экспорт

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		Если Не Элемент.Колонки.Организация.Видимость Тогда
			Элемент.ТекущиеДанные.Организация = Организация;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ФормаОбработки.мТарифныеСтавкиПервогоРазрядаОрганизацийДоРедактирования, Элемент.ТекущиеДанные);	

КонецПроцедуры

Процедура УстановитьЗаголовокНадписиПорядокУчетаСтандартныхВычетов(ФормаОбработки) Экспорт

	ТекстНадписи = "";
	Если ФормаОбработки.ОсобенностиИсчисленияНДФЛ = Перечисления.ОсобенностиИсчисленияНДФЛ.СтандартныеВычетыНарастающимИтогом Тогда
		ТекстНадписи = "Стандартные вычеты применяются нарастающим итогом в течение налогового периода – в этом случае вычеты, на которые имеет право налогоплательщик (сотрудник) с начала года по месяц исчисления налога, применяются к налоговой базе, исчисленной нарастающим итогом за год";	
	Иначе
		ТекстНадписи = "Стандартные вычеты применяются в пределах месячного дохода налогоплательщика – в этом случае вычеты, на которые имеет право налогоплательщик (сотрудник) в каждом месяце налогового периода, применяются к налоговой базе, исчисленной за этот месяц (вариант соответствует положениям письма Минфина РФ от 7 октября 2004 г. №03-05-01-04/41)";
	КонецЕсли;	
	
	ФормаОбработки.ЭлементыФормы.НадписьПорядокУчетаСтандартныхВычетов.Заголовок = ТекстНадписи;	

КонецПроцедуры

Процедура ФормаОбработкиТарифыВзносовНаППСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование, ФормаОбработки) Экспорт

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ФормаОбработки.мТарифыВзносовНаППСДоРедактирования, Элемент.ТекущиеДанные);	

КонецПроцедуры

Процедура ФормаОбработкиарифыВзносовНаППСПериодПриИзменении(Элемент, ФормаОбработки) Экспорт

	Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		Элемент.Значение = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	Если Элемент.Значение <> НачалоМесяца(Элемент.Значение) Тогда
		Элемент.Значение = НачалоМесяца(Элемент.Значение);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОЛУЧЕНИЯ ДАННЫХ И ЗАПОЛНЕНИЯ РЕКВИЗИТОВ ФОРМЫ 

Процедура ПолучитьАлгоритмыРасчетов(ФормаОбработки)
	
	НаборЗаписей = РегистрыСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
	 	ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки = Перечисления.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки.РасчетЧасовойТарифгойСтавкиОтДолжностногоОклада;
		ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую 		 = Перечисления.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце;
	Иначе
	    ФормаОбработки.ВариантыАлгоритмаРасчетаЧасовойТарифнойСтваки = НаборЗаписей[0].АлгоритмРасчетаЧасовойТарифнойСтваки;
		ФормаОбработки.ПорядокПересчетаМесячнойСтавкиВЧасовую 		 = НаборЗаписей[0].ПорядокПересчетаМесячнойСтавкиВЧасовую;
		ФормаОбработки.УдержаниеЗаОтпускУменьшаетНалоги 			 = НаборЗаписей[0].УдержаниеЗаОтпускУменьшаетНалоги;

		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСведенияОВзносахСФОТ(ФормаОбработки)
	
	Запрос = Новый Запрос;
	МассивВидовОтчислений = Новый Массив;
	МассивВидовОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд);
	МассивВидовОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН);
	МассивВидовОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды);
	Запрос.УстановитьПараметр("ВидыОтчислений",МассивВидовОтчислений);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиОтчисленийСФОТиЗП.Период,
	|	СтавкиОтчисленийСФОТиЗП.ВидОтчисления,
	|	СтавкиОтчисленийСФОТиЗП.Размер,
	|	СтавкиОтчисленийСФОТиЗП.ВидПараметра,
	|	СтавкиОтчисленийСФОТиЗП.СчетБУ,
	//vvv комментируем
	//|	СтавкиОтчисленийСФОТиЗП.СчетНУ,
	|	СтавкиОтчисленийСФОТиЗП.ОграничениеПоДоходам,
	|	СтавкиОтчисленийСФОТиЗП.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.СтавкиОтчисленийСФОТиЗП КАК СтавкиОтчисленийСФОТиЗП
	|ГДЕ
	|	СтавкиОтчисленийСФОТиЗП.ВидОтчисления В(&ВидыОтчислений)";
	
	
	
	
	ТаблицаЗаписейСтавкиОтчисленийСФОТиЗП = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаписейСтавкиОтчисленийСФОТиЗП.Сортировать("Период");
	
	//НаборЗаписей = РегистрыСведений.ТарифыВзносовНаППС.СоздатьНаборЗаписей();
	//НаборЗаписей.Прочитать();
	//ТаблицаЗаписейТарифыВзносовНаППС = НаборЗаписей.Выгрузить();
	//ТаблицаЗаписейТарифыВзносовНаППС.Сортировать("Период");

	
	ЗаполнитьТабличнуюЧасть(СтавкиОтчисленийСФОТиЗП, ТаблицаЗаписейСтавкиОтчисленийСФОТиЗП, "ВидОтчисления");
	//ЗаполнитьТабличнуюЧасть(ТарифыВзносовНаППС, ТаблицаЗаписейТарифыВзносовНаППС, "ВидДеятельности");



	
	
КонецПроцедуры

Процедура ПолучитьРазмерыПараметровДляРасчетаРБ(ФормаОбработки)
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяВеличина);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяСтавка1разряда);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.БПМ);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.КоэффициентДляРасчетаОтпуска);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗП);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников);
	МассивПараметров.Добавить(Перечисления.ВидыПараметровДляРасчетаЗарплаты.ЧасоваяМинимальнаяЗарплата);
  	
	НаборЗаписей = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.Сортировать("ВидПараметра,Период");
	
	Если ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.Количество() = 0 Тогда
		// заполним таблицу
		Для каждого ВидПараметра Из МассивПараметров Цикл
			НоваяСтрока = ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.Добавить();
			НоваяСтрока.Период = Дата(2000,1,1);
			НоваяСтрока.ВидПособия = ВидПараметра;
			НоваяСтрока.Размер = 0;
		КонецЦикла;
		РазмерыПараметровДляРасчетаРБ = ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.Скопировать();
	Иначе
		СтруктураПоиска = Новый Структура("ВидПараметра");
		Для каждого ВидПараметра Из МассивПараметров Цикл
			СтруктураПоиска.Очистить();
			СтруктураПоиска.Вставить("ВидПараметра", ВидПараметра);
			МассивСтрок = ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.Добавить();
				НоваяСтрока.Период = Дата(2000,1,1);
				НоваяСтрока.ВидПараметра = ВидПараметра;
				НоваяСтрока.Размер = 0;
				ЗаполнитьЗначенияСвойств(РазмерыПараметровДляРасчетаРБ.Добавить(),НоваяСтрока);
			Иначе
				ДатаДействия = Дата(1,1,1);
				Размер = 0;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					Если СтрокаТаблицы.Период > ДатаДействия Тогда
						ДатаДействия = СтрокаТаблицы.Период;
						Размер = СтрокаТаблицы.Размер;
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока = РазмерыПараметровДляРасчетаРБ.Добавить();
				НоваяСтрока.Период = ДатаДействия;
				НоваяСтрока.ВидПараметра = ВидПараметра;
				НоваяСтрока.Размер = Размер;
			КонецЕсли;
		КонецЦикла;
		ТаблицаЗаписейРазмерыПараметровДляРасчетаРБ.Сортировать("ВидПараметра,Период");
		РазмерыПараметровДляРасчетаРБ.Сортировать("ВидПараметра,Период");
	КонецЕсли;

	
КонецПроцедуры



Процедура ПолучитьРазмерыГосударственныхПособий(ФормаОбработки)
	
	НаборЗаписей = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейОграниченияПособия = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейОграниченияПособия.Сортировать("Период");
	
	Если НаборЗаписей.Количество() > 0 тогда
		ФормаОбработки.ДатаРазмеровОграниченияПособий = НаборЗаписей[НаборЗаписей.Количество()-1].Период;
		ФормаОбработки.ПособиеПоВременнойНетрудоспособности = НаборЗаписей[НаборЗаписей.Количество()-1].Размер;
		ФормаОбработки.ПособиеПоБеременности = НаборЗаписей[НаборЗаписей.Количество()-1].РазмерПоБеременности;
	КонецЕсли;	
	
	МассивПособий = Новый Массив;
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности);
    МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет50ПроцентовБПМ);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалидаДо3Лет100ПроцентовБПМ);	
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалидаПосле3Лет120ПроцентовБПМ);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3ЛетНаВторого);	
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3ЛетНаРебенкаИнвалида);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3ЛетНаРебенкаИнвалида);	
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаВичИнфицРебенка);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида);
	МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ВСвязиСоСмертью);
	
	//До 2013
	//vvv комментируем
	//МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПриУсыновленииРебенка);
	//МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеМатериОдиночкеДо1_5Лет);
    //МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеМатериОдиночкеДо3Лет);
	//МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40);
; 	//МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиенаРебенкаСНадбавкой40До3Лет);
    //МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРабМатериНадб40До3Лет);
    //МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРабМатериОдиночкеДо1_5Лет);
	//МассивПособий.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРабМатериОдиночкеДо3Лет);

	

	
	НаборЗаписей = РегистрыСведений.ГосударственныеПособия.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейГосударственныеПособия = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейГосударственныеПособия.Сортировать("ВидПособия,Период");
	
	Если ТаблицаЗаписейГосударственныеПособия.Количество() = 0 Тогда
		// заполним таблицу
		Для каждого ВидПособия Из МассивПособий Цикл
			НоваяСтрока = ТаблицаЗаписейГосударственныеПособия.Добавить();
			НоваяСтрока.Период = Дата(2007,1,1);
			НоваяСтрока.ВидПособия = ВидПособия;
			НоваяСтрока.Размер = 0;
			ЗаполнитьЗначенияСвойств(СписокГосударственныеПособия.Добавить(),НоваяСтрока);
		КонецЦикла;
	Иначе
		СтруктураПоиска = Новый Структура("ВидПособия");
		Для каждого ВидПособия Из МассивПособий Цикл
			СтруктураПоиска.Очистить();
			СтруктураПоиска.Вставить("ВидПособия", ВидПособия);
			МассивСтрок = ТаблицаЗаписейГосударственныеПособия.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаЗаписейГосударственныеПособия.Добавить();
				НоваяСтрока.Период = Дата(2007,1,1);
				НоваяСтрока.ВидПособия = ВидПособия;
				НоваяСтрока.Размер = 0;
				ЗаполнитьЗначенияСвойств(СписокГосударственныеПособия.Добавить(),НоваяСтрока);
			Иначе
				ДатаДействия = Дата(1,1,1);
				Размер = 0;
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					Если СтрокаТаблицы.Период > ДатаДействия Тогда
						ДатаДействия = СтрокаТаблицы.Период;
						Размер = СтрокаТаблицы.Размер;
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока = СписокГосударственныеПособия.Добавить();
				НоваяСтрока.Период = ДатаДействия;
				НоваяСтрока.ВидПособия = ВидПособия;
				НоваяСтрока.Размер = Размер;
			КонецЕсли;
		КонецЦикла;
		//ТаблицаЗаписейГосударственныеПособия.Сортировать("ВидПособия");
		//СписокГосударственныеПособия.Сортировать("ВидПособия");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьПрочиеСтавки(ФормаОбработки)
	
	НаборЗаписей = РегистрыСведений.СтавкаРефинансированияЦБ.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейСтавкиРефинансированияЦБ = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейСтавкиРефинансированияЦБ.Сортировать("Период");
	
	НаборЗаписей = РегистрыСведений.МинимальнаяОплатаТрудаРФ.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейМРОТ = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейМРОТ.Сортировать("Период");
	
	Если ТаблицаЗаписейСтавкиРефинансированияЦБ.Количество() = 0 Тогда
		ФормаОбработки.СтавкаРефинансированияЦБДата = НачалоГода(ОбщегоНазначения.ПолучитьРабочуюДату());
		ФормаОбработки.СтавкаРефинансированияЦБ = 0;
	Иначе
		ФормаОбработки.СтавкаРефинансированияЦБДата = ТаблицаЗаписейСтавкиРефинансированияЦБ[ТаблицаЗаписейСтавкиРефинансированияЦБ.Количество()-1].Период;
		ФормаОбработки.СтавкаРефинансированияЦБ 	 = ТаблицаЗаписейСтавкиРефинансированияЦБ[ТаблицаЗаписейСтавкиРефинансированияЦБ.Количество()-1].Размер;
	КонецЕсли;
	
	Если ТаблицаЗаписейМРОТ.Количество() = 0 Тогда
		ФормаОбработки.МинимальнаяОплатаТрудаРФДата = НачалоГода(ОбщегоНазначения.ПолучитьРабочуюДату());
		ФормаОбработки.МинимальнаяОплатаТрудаРФ     = 0;
	Иначе
		ФормаОбработки.МинимальнаяОплатаТрудаРФДата = ТаблицаЗаписейМРОТ[ТаблицаЗаписейМРОТ.Количество()-1].Период;
		ФормаОбработки.МинимальнаяОплатаТрудаРФ     = ТаблицаЗаписейМРОТ[ТаблицаЗаписейМРОТ.Количество()-1].Размер;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет табличную часть данными из таблицы значений, из таблицы значений
// выбираются последние значения по колонке Период
// 	ТабличнаяЧастьОбработки - табличная часть, в которую необходимо переписать данные
//	ТаблицаЗначенийСДанными - таблица значений из которой получаем данные
//	ИмяКолонки - строка, имя колонки, по которой будут выбираться последние значения на дату
//	
Процедура ЗаполнитьТабличнуюЧасть(ТабличнаяЧастьОбработки, ТаблицаЗначенийСДанными, ИмяКолонки)

	СтрокаКолонкиСортировки = ИмяКолонки + ",Период";
	ТаблицаЗначенийСДанными.Сортировать(СтрокаКолонкиСортировки);
	
	ВремТаблица = ТаблицаЗначенийСДанными.Скопировать();
	ВремТаблица.Свернуть(ИмяКолонки);
	МассивКодов = ВремТаблица.ВыгрузитьКолонку(ИмяКолонки);	
	
	Если ТаблицаЗначенийСДанными.Количество() > 0 Тогда
		СтруктураПоиска = Новый Структура(ИмяКолонки);
		Для каждого ЭлементМассива Из МассивКодов Цикл
			СтруктураПоиска.Очистить();
			СтруктураПоиска.Вставить(ИмяКолонки, ЭлементМассива);
			МассивСтрок = ТаблицаЗначенийСДанными.НайтиСтроки(СтруктураПоиска);
			ДатаДействия = Дата(1,1,1);
			Для каждого СтрокаТаблицы Из МассивСтрок Цикл
				Если СтрокаТаблицы.Период > ДатаДействия Тогда
					СтрокаТЗПоследнееЗначение = СтрокаТаблицы;
				КонецЕсли;
			КонецЦикла;
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьОбработки.Добавить(), СтрокаТЗПоследнееЗначение);
		КонецЦикла;
		ТабличнаяЧастьОбработки.Сортировать(СтрокаКолонкиСортировки);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоПериоду(ТабличнаяЧастьОбработки, ТаблицаЗначенийСДанными)

	СтрокаКолонкиСортировки = "Период Возр ,НижнийПредел Возр,ВерхнийПредел Возр";
	ТаблицаЗначенийСДанными.Сортировать(СтрокаКолонкиСортировки);
	ДатаДействия = Дата(1,1,1);

	Для Каждого Строка из ТаблицаЗначенийСДанными Цикл
		Если Строка.Период >= ДатаДействия тогда
			НайденныеСтроки = ТабличнаяЧастьОбработки.НайтиСтроки(Новый Структура("Период",ДатаДействия));
			Для Каждого НайденнаяСтрока  из НайденныеСтроки Цикл
				ТабличнаяЧастьОбработки.Удалить(НайденнаяСтрока);
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьОбработки.Добавить(),Строка);
			ДатаДействия = Строка.Период;
     	КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ПолучитьШкалуПодоходногоНалога()
	НаборЗаписей = РегистрыСведений.ШкалаПодоходногоНалога.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейШкалаПодоходногоНалога = НаборЗаписей.Выгрузить();
	ЗаполнитьТабличнуюЧастьПоПериоду(ШкалаПодоходногоНалога,ТаблицаЗаписейШкалаПодоходногоНалога);

	
КонецПроцедуры

Процедура ПолучитьВычетыПоНДФЛ()
	
	// получим вычеты к доходам и запомним все данные в таблице значений
	// ТаблицаЗаписейНДФЛВычетыПоДоходам
	НаборЗаписей = РегистрыСведений.НДФЛВычетыПоДоходам.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейНДФЛВычетыПоДоходам = НаборЗаписей.Выгрузить();
	
	// перепишем из таблицы значений ТаблицаЗаписейНДФЛВычетыПоДоходам
	// в табличную часть НДФЛВычетыПоДоходам последние значения
	// по каждому коду дохода
	ЗаполнитьТабличнуюЧасть(НДФЛВычетыПоДоходам, ТаблицаЗаписейНДФЛВычетыПоДоходам, "КодДохода");
	
	// получим размеры вычетов и запомним все данные в таблице значений
	// ТаблицаЗаписейНДФЛРазмерВычетов
	НаборЗаписей = РегистрыСведений.НДФЛРазмерВычетов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаЗаписейНДФЛРазмерВычетов = НаборЗаписей.Выгрузить();
	
	// перепишем из таблицы значений ТаблицаЗаписейНДФЛВычетыПоДоходам
	// в табличную часть НДФЛВычетыПоДоходам последние значения
	// по каждому коду дохода
	ЗаполнитьТабличнуюЧасть(НДФЛРазмерВычетов, ТаблицаЗаписейНДФЛРазмерВычетов, "КодВычета");
	
КонецПроцедуры

// Процедура получает данные: АлгоритмыРасчетов, РазмерыПособий, ВычетыНДФЛ
// и заполняет реквизиты формы
Процедура ПолучитьОбщиеДанныеИЗаполнитьФорму(ФормаОбработки) Экспорт

	// получим значения констант 
	Если ЗначениеЗаполнено(ФормаОбработки.мСтрокаКонстант) Тогда
		НаборКонстант = Константы.СоздатьНабор(ФормаОбработки.мСтрокаКонстант);
		НаборКонстант.Прочитать();
		ЗаполнитьЗначенияСвойств(ФормаОбработки, НаборКонстант);
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.АлгоритмыРасчетов.Видимость Тогда
		ПолучитьАлгоритмыРасчетов(ФормаОбработки);
		УстановитьЗаголовокНадписьПорядокРасчетаЧасовойСтавки(ФормаОбработки);
		УстановитьЗаголовокНадписьАлгоритмРасчетаЧасовойТарифнойСтавки(ФормаОбработки);
		УстановитьЗаголовокНадписьУдержаниеЗаОтпускУменьшаетНалогиИнформация(ФормаОбработки);
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.СтраховыеВзносы.Видимость Тогда
		// Заполним сведения о страховых взносах
		ПолучитьСведенияОВзносахСФОТ(ФормаОбработки);
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетЗарплаты.Видимость Тогда
		ПолучитьРазмерыПараметровДляРасчетаРБ(ФормаОбработки);	
	КонецЕсли;

	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РазмерыПособий.Видимость Тогда
		ПолучитьРазмерыГосударственныхПособий(ФормаОбработки);	
	КонецЕсли;
	
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетНДФЛ.Видимость Тогда
		ПолучитьШкалуПодоходногоНалога();	
	КонецЕсли;

	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.ВычетыНДФЛ.Видимость Тогда
		ПолучитьВычетыПоНДФЛ();	
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьУчетнуюПолитикуПоПерсоналу(ФормаОбработки) 
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций, НаборЗаписей[0]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьУчетнуюПолитикуПоРасчетуЗарплаты(ФормаОбработки) 
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоРасчетуЗарплатыОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты, НаборЗаписей[0]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьТарифПочтовогоСбора(ФормаОбработки)
	//НаборЗаписей = РегистрыСведений.ТарифПочтовогоСбораОрганизации.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Организация.Установить(Организация);
	//НаборЗаписей.Прочитать();
	//Если НаборЗаписей.Количество() > 0 Тогда
	//	ФормаОбработки.ТарифПочтовогоСбора = НаборЗаписей[0].Тариф;
	//КонецЕсли;

КонецПроцедуры //ПолучитьТарифПочтовогоСбора

Процедура ПолучитьТарифныеСтавкиПервогоРазряда(ФормаОбработки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТСписокОрганизаций
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	(Организации.Ссылка = &Организация
	|			ИЛИ Организации.ГоловнаяОрганизация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Организация,
	|	ТарифныеСтавкиПервогоРазрядаОрганизаций.ТарифнаяСтавка,
	|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Размер,
	|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Период
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций КАК ТарифныеСтавкиПервогоРазрядаОрганизаций
	|ГДЕ
	|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Организация В
	|			(ВЫБРАТЬ
	|				ВТСписокОрганизаций.Организация
	|			ИЗ
	|				ВТСписокОрганизаций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Организация.Наименование,
	|	Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);

	ТарифныеСтавкиПервогоРазрядаОрганизаций.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ПолучитьСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев(ФормаОбработки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТСписокОрганизаций
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	(Организации.Ссылка = &Организация
	|			ИЛИ Организации.ГоловнаяОрганизация = &Организация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтавкаВзноса.Организация КАК Организация,
	|	СтавкаВзноса.Период КАК Период,
	|	СтавкаВзноса.Ставка,
	|	СтавкаВзноса.Контрагент,
	|	СтавкаВзноса.Договор,
	|	СтавкаВзноса.СчетБУ,
	|	СтавкаВзноса.СчетНУ,
	|	СтавкаВзноса.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев КАК СтавкаВзноса
	|ГДЕ
	|	СтавкаВзноса.Организация В
	|			(ВЫБРАТЬ
	|				ВТСписокОрганизаций.Организация
	|			ИЗ
	|				ВТСписокОрганизаций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтавкаВзноса.Организация.Наименование,
	|	Период";
	Запрос.УстановитьПараметр("Организация", Организация);
	СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Загрузить(Запрос.Выполнить().Выгрузить());
	
		
КонецПроцедуры

Процедура ПолучитьТарифыВзносовНаППС(ФормаОбработки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТарифыВзносовНаППС.Период КАК Период,
	|	ТарифыВзносовНаППС.ВидДеятельности,
	|	ТарифыВзносовНаППС.Процент,
	|	ТарифыВзносовНаППС.ОграничениеПоДоходам,
	|	ТарифыВзносовНаППС.СчетБУ,
	|	ТарифыВзносовНаППС.СчетНУ,
	|	ТарифыВзносовНаППС.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.ТарифыВзносовНаППС КАК ТарифыВзносовНаППС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ТарифыВзносовНаППС.Загрузить(Запрос.Выполнить().Выгрузить());
	
		
КонецПроцедуры

 
Процедура ПолучитьУчетнуюПолитикуНалоговыйУчет(ФормаОбработки) 
		
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаНалоговыйУчет.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет.Сортировать("Период");
	
	Если ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет.Количество() > 0 Тогда
		СтрокаТаблицы = ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет[ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет.Количество()-1];
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаНалоговыйУчет, СтрокаТаблицы);
		ФормаОбработки.ДатаНачалаНалоговыйУчет = СтрокаТаблицы.Период;
	Иначе
		НоваяСтрока = ТаблицаЗаписейУчетнаяПолитикаНалоговыйУчет.Добавить();
		НоваяСтрока.Период = НачалоГода(ФормаОбработки.ДатаНачалаНалоговыйУчет);
		НоваяСтрока.Организация = Организация;
		ФормаОбработки.ДатаНачалаНалоговыйУчет = НоваяСтрока.Период;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ФормаОбработки.мУчетнаяПолитикаНалоговыйУчет);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьУчетнуюПолитикуНДФЛ(ФормаОбработки)
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ = НаборЗаписей.Выгрузить();
	ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ.Сортировать("Период");
	
	Если ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ.Количество() > 0 Тогда
		СтрокаТаблицы = ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ[ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ.Количество()-1];
		ЗаполнитьЗначенияСвойств(ФормаОбработки.мУчетнаяПолитикаПоНДФЛ, СтрокаТаблицы);
		ФормаОбработки.ПериодНДФЛ = Год(СтрокаТаблицы.Период);
	Иначе
		НоваяСтрока = ТаблицаЗаписейУчетнаяПолитикаПоНДФЛ.Добавить();
		НоваяСтрока.Период = Дата(ФормаОбработки.ПериодНДФЛ,1,1);
		НоваяСтрока.Организация = Организация;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ФормаОбработки.мУчетнаяПолитикаПоНДФЛ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура получает по организации и заполняет реквизиты формы
Процедура ПолучитьДанныеПоОрганизации(ФормаОбработки) Экспорт
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.КадровыйУчет.Видимость Тогда
		ПолучитьУчетнуюПолитикуПоПерсоналу(ФормаОбработки);
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоПерсоналуОрганизаций);
	КонецЕсли;
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.РасчетЗарплаты.Видимость Тогда
		// тут будут заполнены данные и для страницы Плановый аванс
		ПолучитьУчетнуюПолитикуПоРасчетуЗарплаты(ФормаОбработки);
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты);
		ФормаОбработки.ЭлементыФормы.НадписьСписокРасчетчиковЗарплаты.Видимость = ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты.РасчетЗарплатыОрганизацииПоОтветственным;
			
	КонецЕсли;
	
	
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.СтраховыеВзносы.Видимость Тогда
		ПолучитьСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев(ФормаОбработки);
		ПолучитьТарифыВзносовНаППС(ФормаОбработки);
		ЗаполнитьЗначенияСвойств(ФормаОбработки, ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты);
		ФормаОбработки.ЭлементыФормы.НадписьСписокРасчетчиковЗарплаты.Видимость = ФормаОбработки.мУчетнаяПолитикаПоРасчетуЗарплаты.РасчетЗарплатыОрганизацииПоОтветственным;
	КонецЕсли;
		
	Если ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы.ТарифныеСтавкиПервогоРазряда.Видимость Тогда
   		ПолучитьТарифныеСтавкиПервогоРазряда(ФормаОбработки);
	КонецЕсли;

    			
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ 

Процедура ФормаОбработкиПередОткрытием(ФормаОбработки, Отказ) Экспорт

	Если ЗначениеЗаполнено(Организация) Тогда
		// в форму передана организация
		// проверим доступ к головной организации
		Организация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
		Отказ = Не ОбщегоНазначения.ЭтоДоступнаяОрганизация(ОбщегоНазначения.ГоловнаяОрганизация(Организация))
	Иначе
		Организация = РаботаСДиалогами.ПолучитьОрганизацию(Истина);
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		РаботаСДиалогами.СформироватьСтраницыФормы(ФормаОбработки.мСоответствиеОбъектыМетаданных, ФормаОбработки.мСоответствиеРеквизитыФормы);
		
		Отказ = Истина;
		Для каждого СтраницаФормы Из ФормаОбработки.ЭлементыФормы.ПанельНастроек.Страницы Цикл
			Если СтраницаФормы.Видимость Тогда
				// на форме есть видимые страницы, можно открывать форму
				Если Отказ Тогда
					// это первая из видимых страниц, сделаем ее текущей
					ФормаОбработки.ЭлементыФормы.ПанельНастроек.ТекущаяСтраница = СтраницаФормы;
				КонецЕсли;
				Отказ = Ложь;
				
				МассивОбъектовМетаданных = ФормаОбработки.мСоответствиеОбъектыМетаданных[СтраницаФормы];
				Для каждого ОбъектМетаданных Из МассивОбъектовМетаданных Цикл
					Если Найти(ОбъектМетаданных.ПолноеИмя(), "Константа") <> 0 Тогда
						ФормаОбработки.мСтрокаКонстант = ФормаОбработки.мСтрокаКонстант + ОбъектМетаданных.Имя + ",";
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры


#КонецЕсли



