

Процедура РассчитатьПоСтавкеПервогоРазряда(ДатаРасчета, Организация) Экспорт
	
	СреднеМесячнаяНормаЧасов = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДатаРасчета), 
																						Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов)).Размер;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамПериод", ДатаРасчета);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамПустаяТарифнаяСтвака", Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка()); 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасценкиСрезПоследних.ТехнологическаяОперация,
	|	РасценкиСрезПоследних.Организация,
	|	РасценкиСрезПоследних.ТарифнаяСтавкаПервогоРазряда,
	|	РасценкиСрезПоследних.РазмерТарифнойСтавкиПервогоРазряда,
	|	РасценкиСрезПоследних.РазрядЕТС,
	|	ЕСТЬNULL(РасценкиСрезПоследних.КоэффициентЕТС, 1) КАК КоэффициентЕТС,
	|	ЕСТЬNULL(РасценкиСрезПоследних.ПовышенныйКоэффициентЕТС, 1) КАК ПовышенныйКоэффициентЕТС,
	|	ЕСТЬNULL(РасценкиСрезПоследних.ТарифнаяСтавка, 0) КАК ТарифнаяСтавка,
	|	ЕСТЬNULL(РасценкиСрезПоследних.НормаВремени, 0) КАК НормаВремени,
	|	РасценкиСрезПоследних.Расценка,
	|	РасценкиСрезПоследних.Валюта,
	|	РасценкиСрезПоследних.Комментарий
	|ИЗ
	|	РегистрСведений.Расценки.СрезПоследних(&парамПериод, Организация = &парамОрганизация) КАК РасценкиСрезПоследних
	|ГДЕ
	|	РасценкиСрезПоследних.ТарифнаяСтавкаПервогоРазряда <> &парамПустаяТарифнаяСтвака";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 тогда
		ЭтотОбъект.Очистить();
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ТарифнаяСтавкаПервогоРазряда) тогда
			РазмерСтавкиПервогоРазряда = ПолучитьРазмерСтавкиПервогоРазряда(Выборка.ТарифнаяСтавкаПервогоРазряда,ДатаРасчета, Организация);
			Если РазмерСтавкиПервогоРазряда.Следующий() тогда
				Запись = ЭтотОбъект.Добавить();
				ЗаполнитьЗначенияСвойств(Запись,Выборка);
				Запись.Период = ДатаРасчета;
				Запись.РазмерТарифнойСтавкиПервогоРазряда =  РазмерСтавкиПервогоРазряда.Размер;
				ТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.КоэффициентЕТС*?(Выборка.ПовышенныйКоэффициентЕТС=0,1,Выборка.ПовышенныйКоэффициентЕТС)*РазмерСтавкиПервогоРазряда.Размер/СреднеМесячнаяНормаЧасов, Константы.ВалютаРегламентированногоУчета.Получить());
				Запись.ТарифнаяСтавка = ТарифнаяСтавка;
				Запись.Расценка = ТарифнаяСтавка*Выборка.НормаВремени;
			Иначе
				Сообщить("Не заполнен размер ставки первого разряда для: " + Выборка.ТарифнаяСтавкаПервогоРазряда, СтатусСообщения.Важное);	
			КонецЕсли;
		Иначе
			Сообщить("Не заполнен вид ставки первого разряда для : " + Выборка.ПодразделениеОрганизации +", " + Выборка.Должность, СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРазмерСтавкиПервогоРазряда(ТарифнаяСтавкаПервогоРазряда,ДатаРасчета, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСтавка", ТарифнаяСтавкаПервогоРазряда);
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамПериод", ДатаРасчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&парамПериод,
	|			Организация = &парамОрганизация
	|				И ТарифнаяСтавка = &парамСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции

