
&НаСервере
Процедура ВосстановитьЗначения()
	
	ОтборПоПодразделению = ХранилищеОбщихНастроек.Загрузить("СправочникСотрудники", "ОтборПоПодразделению");
	Если ОтборПоПодразделению = Неопределено Тогда
		ПоПодразделению = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделение");
	Иначе
		ПоПодразделению = ОтборПоПодразделению;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначения()
	
	ХранилищеОбщихНастроек.Сохранить("СправочникСотрудники", "ОтборПоПодразделению", ПоПодразделению);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ТекущееПодразделениеКомпании", ПоПодразделению, , , НЕ ПоПодразделению.Пустая());
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Элементы.ГруппаВКомпании.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьУправленческийУчетЗарплаты");
	
КонецПроцедуры // УстановитьСвойстваЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьЗначения();
	УстановитьОтбор();
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьЗначения();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоПодразделениюПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры
