//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УточнитьСтратегиюОтраженияВУчете() Экспорт

	СтратегияОтраженияВУчете = ?(СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.РаспределятьПоБазовымНачислениям,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления,?(СпособОтраженияВБухучете.Пустая(), Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоВидуРасчета));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ВидПремии = Перечисления.ВидыПремии.НеПремия И ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Перечисления.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоТрудовомуЗаконодательству Тогда
			ЧислоМесяцев = 0
		КонецЕсли;
		УточнитьСтратегиюОтраженияВУчете();
		//vvv
		Если НЕ ЗначениеЗаполнено(ПериодичностьНачисления) Тогда
			ПериодичностьНачисления = Перечисления.ПериодичностьНачисления.НеОпределена;
		КонецЕсли;
	    //
	КонецЕсли;
КонецПроцедуры
