Процедура ВыборФайлаДляЗагрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "(*.xls)|*.xls";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = "xls";
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьВыборкуПоСправочнику()
	
	Запрос=Новый Запрос;
	
	Запрос.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорпоративныйПлан.Сотрудник,
	|	КорпоративныйПлан.Код КАК Номер
	|ИЗ
	|	Справочник.КорпоративныйПлан КАК КорпоративныйПлан
	|ГДЕ
	|	КорпоративныйПлан.Владелец = &Организация
	|	И НЕ КорпоративныйПлан.НомерНеАктуален";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗагрузитьРазговоры() Экспорт
	
	Если СокрЛП(ФайлЗагрузки) = "" Тогда
		Сообщить("Не выбран файл загрузки!");
		возврат
	КонецЕсли;   
	
	Разговоры.Очистить();
	
	// Создаем OLE соединение
	Окно=новый COMОбъект("Excel.Application");
	Книга=окно.Workbooks; 
	Книга1=Книга.open(СокрЛП(Файлзагрузки));  
	// 
	
	Выборка=СформироватьВыборкуПоСправочнику();
	
	Если Книга1.Sheets.Count>2 ТОгда
		
		Если Книга1.ActiveSheet.Name <> "ChargeDetails" Тогда
			Рез_=Книга1.WorkSheets("ChargeDetails").Activate();    	
		КонецЕсли;
		Если (Окно.Range("A1").Value="№ по порядку") И (Окно.Range("E1").Value="итого начислений с учетом округления") Тогда			
			Для ном = 2 по 2000 Цикл    
				Номер_ = Окно.Cells(ном,2).Value;   				
				Если Найти(Строка(Номер_),",")>0 ТОгда //если несколько номеров - пропускаем
					Продолжить;
				КонецЕсли;
				Если СокрЛП(Строка(Номер_))="" ТОгда
					Продолжить;
				КонецЕсли;
				С="375";
				Номер_=Число(С+СокрЛП(Строка(Номер_))); 				
				Состояние("Обрабатывается номер "+Строка(Номер_));
				НайденныйСотр=Выборка.Найти(Номер_,"Номер");
				Если НайденныйСотр<>Неопределено ТОгда
					Если ЗначениеЗаполнено(Номер_) Тогда  
						Сумма_=Окно.Cells(ном,5).Value;
						Если ЗначениеЗаполнено(Сумма_) Тогда					
							НоваяСтрока=Разговоры.Добавить();  
							НоваяСтрока.Номер=Номер_;
							НоваяСтрока.Абонент = Окно.Cells(ном,3).Value;   
							НоваяСтрока.Сотрудник=НайденныйСотр.Сотрудник;
							НоваяСтрока.Сумма = Окно.Cells(ном,5).Value;							
						КонецЕсли;	
					КонецЕсли;
				ИначеЕсли СокрЛП(Строка(Номер_))<>"" Тогда
					Сообщить("Не найден сотрудник для номера "+Строка(Номер_),СтатусСообщения.Важное);
				КонецЕсли;
			КонецЦикла; 
		Иначе
			Предупреждение("У Вас неизвестные данные на листе "+Книга1.ActiveSheet.Name+" указанного XLS файла!");
		КонецЕсли;	
	Иначе
		
		Если Нрег(Книга1.ActiveSheet.Name) <> "data" Тогда
			Книга1.WorkSheets("data").Activate();    	
		КонецЕсли;
		Для ном = 2 по 1000 Цикл    
				Номер_ = Окно.Cells(ном,2).Value;   
				Состояние("Обрабатывается номер "+Строка(Номер_));
				НайденныйСотр=Выборка.Найти(Номер_,"Номер");
				Если НайденныйСотр<>Неопределено ТОгда
					Если ЗначениеЗаполнено(Номер_) Тогда  
						Сумма_= Окно.Cells(ном,3).Value;
						Если ЗначениеЗаполнено(Сумма_) Тогда
							НоваяСтрока=Разговоры.Добавить();;  
							НоваяСтрока.Номер=Номер_;
							НоваяСтрока.Сотрудник=НайденныйСотр.Сотрудник;
							НоваяСтрока.Сумма = Окно.Cells(ном,3).Value;		
						КонецЕсли;	
					КонецЕсли;
				ИначеЕсли СокрЛП(Строка(Номер_))<>"" Тогда
					Сообщить("Не найден сотрудник для номера "+Строка(Номер_),СтатусСообщения.Важное);	
				КонецЕсли;
		КонецЦикла; 
	КонецЕсли;            
	
	Попытка
		Окно.Application.Quit();
	Исключение
	КонецПопытки;

	
	К=Разговоры.Количество()-1;
	Пока К>=0 Цикл 
		Если (Разговоры[к].Номер=0) или (Разговоры[к].Сумма=0) ТОгда
			Разговоры.Удалить(к);
		КонецЕсли;		
		к=к-1;
	КонецЦикла; 
	
КонецПроцедуры 

Функция ПолучитьТаблицу() Экспорт
	
	ВременнаяТаблица = Разговоры.Выгрузить();
	ВременнаяТаблица.Колонки.Добавить("ВидРасчета");
	ВременнаяТаблица.ЗаполнитьЗначения(ВидРасчета,"ВидРасчета");
   	ВременнаяТаблица.Колонки.Добавить("ДатаНачала");
	ВременнаяТаблица.ЗаполнитьЗначения(НачалоМесяца(ПериодРегистрации),"ДатаНачала");	
	ВременнаяТаблица.Колонки.Добавить("ДатаОкончания");
	ВременнаяТаблица.ЗаполнитьЗначения(КонецМесяца(ПериодРегистрации),"ДатаОкончания");

	Возврат ВременнаяТаблица;
	
КонецФункции
