
Процедура ДобавитьСпособОтражения() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СпособыОтраженияЗарплатыВРеглУчете.Ссылка
	|ИЗ
	|	Справочник.СпособыОтраженияЗарплатыВРеглУчете КАК СпособыОтраженияЗарплатыВРеглУчете
	|ГДЕ
	|	СпособыОтраженияЗарплатыВРеглУчете.СчетДт = &СчетДт
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт1 = &СубконтоДт1
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт2 = &СубконтоДт2
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт3 = &СубконтоДт3
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоДт4 = &СубконтоДт4
	|	И СпособыОтраженияЗарплатыВРеглУчете.СчетКт = &СчетКт
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт1 = &СубконтоКт1
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт2 = &СубконтоКт2
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт3 = &СубконтоКт3
	|	И СпособыОтраженияЗарплатыВРеглУчете.СубконтоКт4 = &СубконтоКт4";
	
	Запрос.УстановитьПараметр("СчетДт",СчетДт);
	Запрос.УстановитьПараметр("СубконтоДт1",СубконтоДт1);
	Запрос.УстановитьПараметр("СубконтоДт2",СубконтоДт2);
	Запрос.УстановитьПараметр("СубконтоДт3",СубконтоДт3);
	Запрос.УстановитьПараметр("СубконтоДт4",СубконтоДт4);
	
	Запрос.УстановитьПараметр("СчетКт",СчетКт);
	Запрос.УстановитьПараметр("СубконтоКт1",СубконтоКт1);
	Запрос.УстановитьПараметр("СубконтоКт2",СубконтоКт2);
	Запрос.УстановитьПараметр("СубконтоКт3",СубконтоКт3);
	Запрос.УстановитьПараметр("СубконтоКт4",СубконтоКт4);
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбработкаКомментариев=глЗначениеПеременной("глОбработкаСообщений");
		ОбработкаКомментариев.УдалитьСообщения();
		ОбработкаКомментариев.ДобавитьСообщение("Способ отражения с данной аналитикой уже существует в справочнике!",Перечисления.ВидыСообщений.Ошибка);
		ОбработкаКомментариев.ПоказатьСообщения();
	Иначе
		Отражение = Справочники.СпособыОтраженияЗарплатыВРеглУчете.СоздатьЭлемент();
		Отражение.СчетДт=СчетДт;       
		Отражение.СубконтоДт1=СубконтоДт1;
		Отражение.СубконтоДт2=СубконтоДт2;
		Отражение.СубконтоДт3=СубконтоДт3;
		Отражение.СубконтоДт4=СубконтоДт4;
		Отражение.СчетКт=СчетКт;       
		Отражение.СубконтоКт1=СубконтоКт1;
		Отражение.СубконтоКт2=СубконтоКт2;
		Отражение.СубконтоКт3=СубконтоКт3;
		Отражение.СубконтоКт4=СубконтоКт4;
		Отражение.Родитель=Родитель;
		Отражение.Наименование = Наименование;
		Отражение.Записать();		
		
	КонецЕсли;
	
КонецПроцедуры