Процедура НастройкиОтчета(Настройки) Экспорт

	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ВсеПриказы"			, "Отчет формирует реестр всех кадровых приказов (Прием, Увольнение, Кадровое перемещение, Предоставление отпуска, Направление в командировку).");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ПриказыОПриеме"		, "Отчет формирует реестр приказов о приеме на работу.");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ПриказыОбУвольнении"	, "Отчет формирует реестр приказов об увольнении.");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ПриказыОПеремещении"	, "Отчет формирует реестр приказов о кадровом перемещении.");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ПриказыОбОтпусках"		, "Отчет формирует реестр приказов о предоставлении отпуска.");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ПриказыОКомандировках"	, "Отчет формирует реестр приказов о направлении в командировку.");

КонецПроцедуры
